[{"courseNum": "ACFM 220", "courseName": "Business Law I", "info": "Survey of the judicial system; analysis of contract law and government regulation of business using lecture and case method.  Not open to first-year students."}, {"courseNum": "ACFM 261", "courseName": "Foundations Acct & Fin Mgt II", "info": "Covers general purpose financial statements, the theoretical framework that underlies the measurement of income, and asset and liability valuation.  Prerequisite: MGMT 200 or permission of instructor."}, {"courseNum": "ACFM 310", "courseName": "Independent Study in ACFM", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "ACFM 315", "courseName": "Special Topics in ACFM", "info": "A seminar on selected topics in accounting and financial management.  Prerequisite: permission of the instructor."}, {"courseNum": "ACFM 340", "courseName": "Busi Analytics & Fin Modeling", "info": "Decision making of individuals and groups in organizations, emphasizing the organization's financial dimension.  Topics: optimization, decision theory, simulation.  Prerequisites: MGMT 102, MGMT 203 or ACFM 261."}, {"courseNum": "ACFM 351", "courseName": "Intermediate Acct & Fin Mgt I", "info": "Accounting theory and practice applicable to income determination and asset valuation.  Develops students' understanding of the accounting and financial reporting environment.  Prerequisite: ACFM 261."}, {"courseNum": "ACFM 352", "courseName": "Intermediate Acct & Fin Mgt II", "info": "A continuation of ACFM 351.  Topics include: investments, debt, leases, pensions, deferred taxes, EPS, equity, and cash flows.  Prerequisite: permission of instructor."}, {"courseNum": "ACFM 358", "courseName": "Forensic Accounting", "info": "Uses of audit software to obtain and develop evidence, provide decision support, and solve audit problems. Introduction to forensic accounting and auditing. Prerequisite: ACFM 357."}, {"courseNum": "ACFM 359", "courseName": "Advanced Seminar in Accounting", "info": "An integrative seminar addressing special topics and current issues faced by the accounting profession. Prerequisite: permission of the instructor."}, {"courseNum": "ACFM 365", "courseName": "Adv Managerial and Cost Acct", "info": "Examines managerial accounting and cost behavior, specifically, how product cost information is recorded, reported, analyzed and used by managers in decision making. Prerequisite: ACFM 261."}, {"courseNum": "ACFM 370", "courseName": "Corporate Finance", "info": "Concepts, principles, and recent innovations in corporate finance: risk and return, valuation, capital budgeting and structure, dividend policy, financial planning, risk management. Crosslisted with MGMT 370. Prerequisite: MGMT 200. Not open to students who have taken MGMT 203."}, {"courseNum": "ACFM 375", "courseName": "Student Managed Invest Fund I", "info": "The first course of a two semester experiential learning exercise in which students manage a real dollar investment portfolio.  Prerequisites: ACFM 377 and permission of the instructor."}, {"courseNum": "ACFM 377", "courseName": "Investments", "info": "Principles of investment practice and theory.  Emphasis on the fundamentals of intangible investments (equities, debt and derivative instruments).  Prerequisites: MGMT 102 and ACFM 370 or permission of the instructor."}, {"courseNum": "ACFM 391", "courseName": "The Mass Investing Society", "info": "Traces how the United States has become an \"equity nation\" where most citizens own common stock.  Also explores pivotal moments in stock market history."}, {"courseNum": "ACFM 476", "courseName": "Student Managed Invest Fund II", "info": "The second course of a two semester portfolio management course in which students manage a real dollar investment portfolio.  Prerequisite: ACFM 375 and permission of the instructor."}, {"courseNum": "AFST 155", "courseName": "Blacks in Latin America", "info": ""}, {"courseNum": "AFST 201", "courseName": "Intro Black Performance Theory", "info": ""}, {"courseNum": "AFST 227", "courseName": "Race and Sexuality", "info": ""}, {"courseNum": "AFST 229", "courseName": "Philosophy and Race", "info": ""}, {"courseNum": "AFST 250", "courseName": "Approaches to Africana Studies", "info": ""}, {"courseNum": "AFST 257", "courseName": "Jazz, Rock, and Race", "info": ""}, {"courseNum": "AFST 274", "courseName": "Africa International Relations", "info": ""}, {"courseNum": "AFST 280", "courseName": "Race, Violence & Incarceration", "info": ""}, {"courseNum": "AFST 285", "courseName": "Performing Slavery", "info": ""}, {"courseNum": "AFST 399", "courseName": "Independent Study", "info": ""}, {"courseNum": "ANBE 266", "courseName": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior emphasizing both proximate and ultimate mechanisms and explanations for behavior. Crosslisted as BIOL 266 and PSYC 266."}, {"courseNum": "ANBE 296", "courseName": "Research Methods Animal Behavr", "info": "Laboratory and/or field research to accompany ANBE/PSYC 266."}, {"courseNum": "ANBE 307", "courseName": "Conservation Genetics", "info": ""}, {"courseNum": "ANBE 341", "courseName": "Evolution", "info": "The principles and mechanisms of evolution in plants and animals, covering population phenomena, speciation, life history strategies, adaptation, systematics, and biogeography. Prerequisites: BIOL 208 and permission of the instructor. Crosslisted as BIOL 341."}, {"courseNum": "ANBE 342", "courseName": "Neuroethology", "info": "A course that integrates neurobiology and behavior in natural contexts. Emphasis on signal detection, recognition, discrimination, localization, orientation, and the control of complex acts. Neuronal and hormonal mechanisms, ontogeny and evolution of behavior will be considered."}, {"courseNum": "ANBE 354", "courseName": "Tropical Ecology", "info": "Introduction to tropical ecology including life history strategies of vertebrates and invertebrates, biodiversity management and conservation. Emphasis on class and individual projects, data collection, and journal keeping."}, {"courseNum": "ANBE 391", "courseName": "Research", "info": "Independent research, with faculty supervision, in the study of animal behavior."}, {"courseNum": "ANBE 399", "courseName": "Senior Thesis", "info": "Original research leading to a thesis presentation on a topic related to the study of animal behavior."}, {"courseNum": "ANBE 607", "courseName": "Conservation Genetics", "info": ""}, {"courseNum": "ANBE 641", "courseName": "Evolution", "info": "The principles and mechanisms of evolution in plants and animals, covering population phenomena, speciation, life history strategies, adaptation, systematics, and biogeography. Prerequisite: permission of the instructor. Crosslisted as 341/641."}, {"courseNum": "ANBE 642", "courseName": "Neuroethology", "info": "A course that integrates neurobiology and behavior in natural contexts. Emphasis on signal detection, recognition, discrimination, localization, orientation, and the control of complex acts. Neuronal and hormonal mechanisms, ontogeny and evolution of behavior will be considered."}, {"courseNum": "ANBE 654", "courseName": "Tropical Ecology", "info": "Introduction to tropical ecosystems. Topics include climate, nutrient cycling and biodiversity of New and Old World tropics."}, {"courseNum": "ANBE 680", "courseName": "Thesis", "info": "Preparation of a thesis leading to the MA or MS degree."}, {"courseNum": "ANTH 201", "courseName": "Field Research-Local Community", "info": "Participant observation, interviewing and other field research methods. Students will carry out exercises and/or projects in local communities. Crosslisted as SOCI 201."}, {"courseNum": "ANTH 248", "courseName": "Latin Amer.:Challenges 21st C", "info": ""}, {"courseNum": "ANTH 266", "courseName": "Money, Markets & Magic", "info": "This course will provide an introduction to the study of economic systems within specific cultural contexts. We will consider how economic systems interact with other aspects of daily life on the level of the individual, the family, and society."}, {"courseNum": "ANTH 283", "courseName": "Theory in Anthropology", "info": "Explores into the major theoretical trends-both historical and contemporary-in cultural anthropology; conceptualizations of culture, society, and humankind; history and current status of the concept of culture."}, {"courseNum": "ANTH 288", "courseName": "Global Cuisines Local Contexts", "info": ""}, {"courseNum": "ANTH 312", "courseName": "Global Health", "info": ""}, {"courseNum": "ANTH 330", "courseName": "Adv Seminar in Anthropology", "info": "Focuses on selected topics of ethnographic and theoretical interest, varying from year to year."}, {"courseNum": "ARBC 102", "courseName": "Beginning Arabic II", "info": "Continuation of Arabic language skills. Practice in listening, speaking, reading, and writing."}, {"courseNum": "ARBC 104", "courseName": "Intermediate Arabic II", "info": "Review of basic grammar with an emphasis on all four language skills and culture."}, {"courseNum": "ARBC 202", "courseName": "Intmd Arabic Conversation II", "info": "Concentration on development of speaking skills. Conducted entirely in Arabic by native speaker."}, {"courseNum": "ARBC 204", "courseName": "Naming violence", "info": ""}, {"courseNum": "ARST 112", "courseName": "Photography I", "info": "An introduction to the theory, practice, and criticism of fine art photography. Not open to seniors."}, {"courseNum": "ARST 131", "courseName": "Drawing I", "info": "The tradition of drawing, its practice and theory in various media. Not open to seniors."}, {"courseNum": "ARST 230", "courseName": "Printmaking II", "info": "Individual projects in intaglio and woodblock printing with an emphasis on concept and refinement of image. Prerequisite: permission of the instructor."}, {"courseNum": "ARST 234", "courseName": "Digital Photography", "info": "Individual projects in digital photography with an emphasis on concept and refinement of image. Prerequisites: ARST 112, ARST 131 and permission of the instructor."}, {"courseNum": "ARST 239", "courseName": "Digital Fabrication", "info": ""}, {"courseNum": "ARST 245", "courseName": "Web Design I", "info": ""}, {"courseNum": "ARST 250", "courseName": "Sculpture II", "info": "Building on the fundamental skills acquired in Sculpture I, students will utilize more technically demanding processes, including: steel fabrication, woodworking, and moldmaking. Prerequisite: permission of the instructor."}, {"courseNum": "ARST 336", "courseName": "Advanced Work in the Studio", "info": "Advanced projects in each studio area: painting, printmaking photography, sculpture, or graphics. This course may be repeated for additional credit. Prerequisite: permission of the instructor."}, {"courseNum": "ARST 340", "courseName": "Video Art and Installation", "info": "This course builds upon the principles of interdisciplinary practices and histories of performance, installation, and video art. The class will function as a survey of modern and contemporary interdisciplinary art as well as a studio for individual and collaborative projects and actions in installation, performance and video. Prerequisites: permission of the instructor and one of the following: ARST 112, 229, 237, or 250."}, {"courseNum": "ARST 346", "courseName": "Printmaking III", "info": "Advanced projects in printmaking to develop individual themes and concepts. Prerequisites: permission of the instructor and ARST 229 or 230."}, {"courseNum": "ARST 348", "courseName": "Sculpture III", "info": "Advanced projects in sculpture to develop individual themes and concepts. Prerequisites: permission of the instructor and ARST 250."}, {"courseNum": "ARST 351", "courseName": "Honors Studio Art", "info": "Independent study or creative work leading either to the writing of a thesis or the completion of a significant studio project.  For courses in theatre production and design, see listings in Theatre and Dance."}, {"courseNum": "ARTH 204", "courseName": "Castle, Cathedral, Cloister", "info": "Architecture, sculpture, and painting from the Early Christian period to the beginning of the Renaissance. Monastic, religious and secular arts will be explored."}, {"courseNum": "ARTH 208", "courseName": "Modern to Postmodern Art", "info": "Examination of artists and movements after 1915, including Dadaism, Surrealism, Constructivism, Abstract Expressionism, Minimalism, Conceptual Art, and Performance Art. Issues of class, race and gender will be central."}, {"courseNum": "ARTH 210", "courseName": "Special Topics in Art History", "info": "Topics will vary each semester."}, {"courseNum": "ARTH 243", "courseName": "Archaeology of Rome", "info": "Survey of the material culture of the Roman world from the Etruscans through the late Empire. Crosslisted as CLAS 214, CLAS 243."}, {"courseNum": "ARTH 275", "courseName": "Art/Architec of Islamic World", "info": "A survey of Islamic art and architecture from the inception of the faith in the 7th century through the 16th century."}, {"courseNum": "ARTH 320", "courseName": "Independent Study-Art History", "info": "Advanced problems in art history."}, {"courseNum": "ARTH 381", "courseName": "Honors Art History", "info": "Independent study leading to the writing of a thesis. Prerequisite: permission of the instructor."}, {"courseNum": "ASTR 102", "courseName": "Stars, Galaxies, and Beyond", "info": "An introduction to astronomy concentrating on the structure of our universe beyond the solar system. Designed for non-science majors. ASTR 101 is not a prerequisite for ASTR 102."}, {"courseNum": "ASTR 301", "courseName": "Astrophysics", "info": "An introduction to general astrophysics covering mechanics of orbiting bodies, radiation laws, stellar spectra, stellar atmospheres, the internal constitution of stars, stellar energy, galaxies, and cosmology."}, {"courseNum": "BIOL 122", "courseName": "Biology for Non-majors", "info": "Introductory course primarily for the non-biology major. Topics covered include principles of ecology and evolution, and animal diversity, behavior, structure and function. This course is not appropriate preparation for the majority of pre-health graduate programs. Please consult with the Pre-health Adviser for more information."}, {"courseNum": "BIOL 206", "courseName": "Organismal Biology", "info": "An introductory course for biology majors emphasizing organisms as dynamic systems by integrating structure with function. Laboratories introduces scientific method and collaborative learning. Second core course. BIOL 205 is strongly recommended as a prerequisite."}, {"courseNum": "BIOL 208", "courseName": "Principles: Ecology/Evolution", "info": "Introduction to systematic biology, evolutionary theory, physiological ecology, behavioral ecology, population and community ecology, and ecosystem structure and function. Fourth core course."}, {"courseNum": "BIOL 221", "courseName": "Human Physiology", "info": "A course that focuses on the functions of and interactions between human organ systems. Does not count towards the biology major."}, {"courseNum": "BIOL 302", "courseName": "Microbiology", "info": "Ultra-structure, behavior, metabolism, molecular biology, and development of micro-organisms. Roles in disease and food production. Laboratory will emphasize cultivation and identification."}, {"courseNum": "BIOL 307", "courseName": "Conservation Genetics", "info": ""}, {"courseNum": "BIOL 320", "courseName": "Seminar", "info": "Topics vary."}, {"courseNum": "BIOL 327", "courseName": "Molecular Biology", "info": "Synthesis of DNA, RNA, and protein, and the regulation of these processes in both prokaryotic and eukaryotic cells; laboratory experience in the manipulation and analysis of genes."}, {"courseNum": "BIOL 331", "courseName": "Genomics", "info": "The study of the structure, content, expression and evolution of genomes, emphasizing the impact of genomic information on our ability to answer biological questions."}, {"courseNum": "BIOL 339", "courseName": "Developmental Biology", "info": "This course provides an introduction to early animal development with emphasis on the molecular, cellular and genetic mechanisms that drive the formation of the embryo."}, {"courseNum": "BIOL 340", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation and analysis of proteins and nucleic acids. Spectrophotometry, chromatography, centrifugation, electrophoresis, and methods of molecular cloning are emphasized. Crosslisted as CHEM 358."}, {"courseNum": "BIOL 341", "courseName": "Evolution", "info": "The principles and mechanisms of evolution in plants and animals, covering population phenomena, speciation, life history strategies, adaptation, systematics, and biogeography. Crosslisted as ANBE 341. Prerequisites: BIOL 208 and permission of the instructor."}, {"courseNum": "BIOL 342", "courseName": "Neuroethology", "info": "A course that integrates neurobiology and behavior in natural contexts. Emphasis on signal detection, recognition, discrimination, localization, orientation, and the control of complex acts. Neuronal and hormonal mechanisms, ontogeny and evolution of behavior will be considered."}, {"courseNum": "BIOL 348", "courseName": "Immunology", "info": "Development and function of the immune system in animals. The immune response in health and disease. Techniques in immunology."}, {"courseNum": "BIOL 354", "courseName": "Tropical Ecology", "info": "Introduction to tropical ecology including life history strategies of vertebrates and invertebrates, biodiversity management and conservation. Emphasis on class and individual projects, data collection, and journal keeping."}, {"courseNum": "BIOL 362", "courseName": "Topics in Cell Biology", "info": ""}, {"courseNum": "BIOL 373", "courseName": "Mycology", "info": ""}, {"courseNum": "BIOL 375", "courseName": "Neurobiology", "info": ""}, {"courseNum": "BIOL 399", "courseName": "Undergraduate Research", "info": "Undergraduate research."}, {"courseNum": "BIOL 602", "courseName": "Microbiology", "info": "Ultra-structure, behavior, metabolism, molecular biology, and development of micro-organisms. Roles in disease and food production. Laboratory will emphasize cultivation and identification. Prerequisites: BIOL 202 and permission of the instructor."}, {"courseNum": "BIOL 607", "courseName": "Conservation Genetics", "info": ""}, {"courseNum": "BIOL 620", "courseName": "Seminar", "info": "Topics vary."}, {"courseNum": "BIOL 627", "courseName": "Molecular Biology", "info": "Synthesis of DNA, RNA, and protein, genetic phenomena in both prokaryotic and eukaryotic cells; laboratory experience in the regulation and manipulation of genes. Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 631", "courseName": "Genomics", "info": "The study of the structure, content, expression and evolution of genomes, emphasizing the impact of genomic information on our ability to answer biological questions."}, {"courseNum": "BIOL 639", "courseName": "Developmental Biology", "info": "This course provides an introduction to early animal development with emphasis on the molecular, cellular and genetic mechanisms that drive the formation of the embryo."}, {"courseNum": "BIOL 640", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation and analysis of proteins and nucleic acids. Spectrophotometry, chromatography, centrifugation, electrophoresis, and methods of molecular cloning are emphasized. Prerequisite: permission of the instructor. Crosslisted as CHEM 358/658."}, {"courseNum": "BIOL 641", "courseName": "Evolution", "info": "The principles and mechanisms of evolution in plants and animals, covering population phenomena, speciation, life history strategies, adaptation, systematics, and biogeography. Prerequisites: permission of the instructor."}, {"courseNum": "BIOL 642", "courseName": "Neuroethology", "info": "A course that integrates neurobiology and behavior in natural contexts. Emphasis on signal detection, recognition, discrimination, localization, orientation, and the control of complex acts. Neuronal and hormonal mechanisms, ontogeny and evolution of behavior will be considered."}, {"courseNum": "BIOL 648", "courseName": "Immunology", "info": "Development and function of the immune system in animals. The immune response in health and disease. Techniques in immunology."}, {"courseNum": "BIOL 654", "courseName": "Tropical Ecology", "info": "Introduction to tropical ecosystems. Topics include climate, nutrient cycling and biodiversity of New and Old World tropics."}, {"courseNum": "BIOL 660", "courseName": "Graduate Research", "info": "Graduate research."}, {"courseNum": "BIOL 673", "courseName": "Mycology", "info": ""}, {"courseNum": "BIOL 675", "courseName": "Neurobiology", "info": ""}, {"courseNum": "BIOL 680", "courseName": "Thesis", "info": "Thesis."}, {"courseNum": "BMEG 205", "courseName": "Bioinstrumentation I", "info": "Introduction to analog and digital circuits with applications to medicine and biology. Corequisite: MATH 212. Prerequisite: MATH 202. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 210", "courseName": "Fundamentals of Biomedicl Engr", "info": "Introduction to the application of fluid mechanics, mass transfer, instrumentation, mechanics, and societal issues to biomedical problems. Hands-on laboratory experiences integrated with lecture. Prerequisites: MATH 201 and PHYS 211 or PHYS 211E. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 220", "courseName": "Intro to Engineering Computing", "info": "Introduction to numerical methods and programming fundamentals. Problems drawn from mathematics, engineering, and biomedical engineering. Corequisite: MATH 212. Not open to students who have taken ENGR 211, ENGR 212, ENGR 214. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 226", "courseName": "Statistical Methods in BMEG", "info": "Introduction to concepts in experimental design and data analysis with application to biomedical engineering, medicine, and biology. Open only to biomedical engineering students. Prerequisite: MATH 201. Not open to students who have taken ENGR 215, MATH 216 or MATH 226. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 300", "courseName": "Biotransport I", "info": "First biotransport course focusing on the application of fluid mechanics principles to biological systems and medical devices. Properties of biological fluids, energy and momentum balances, frictional losses, pumps, porous media flows, computational modeling."}, {"courseNum": "BMEG 402", "courseName": "Biomedical Engr Capstone II", "info": "Second semester of the biomedical engineering design sequence emphasizing fabrication, instrumentation, testing and evaluation, and final presentation of projects."}, {"courseNum": "BMEG 408", "courseName": "Med Device Assess/Development", "info": "An examination of policies and procedures relating to medical device design and approval including medical device benchmarking, technical literature searching and reviewing, intellectual property, regulatory and professional issues, project planning and management, and individual and group work. Topics will be applied through the study of a currently marketed medical device. Prerequisite: BMEG 205. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 451", "courseName": "Biomechanics/Injury Prevention", "info": "Survey course for field of biomechanics and research for injury prevention (lowering risk and/or severity). Mixture of lectures, labs, and projects. Prerequisite: permission of the instructor."}, {"courseNum": "BMEG 472", "courseName": "Advanced Topics in BMEG", "info": "Advanced, in-depth course developed from areas of biomedical engineering. Topics will vary."}, {"courseNum": "BMEG 481", "courseName": "Biomedical Engineering Project", "info": "Individual work with a faculty adviser on development, design, or research project beginning with a written plan and culminating with a written or oral presentation."}, {"courseNum": "BMEG 491", "courseName": "Biomedical Engr Research", "info": "Independent study with a faculty adviser on a research or design project. Submit a project proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group."}, {"courseNum": "CEEG 330", "courseName": "Introduction to Transportation", "info": ""}, {"courseNum": "CEEG 405", "courseName": "Design of Steel Structures", "info": ""}, {"courseNum": "CEEG 422", "courseName": "River Mechanics", "info": ""}, {"courseNum": "CEEG 440", "courseName": "Physical/Chemical Treatment", "info": ""}, {"courseNum": "CEEG 442", "courseName": "Sustainability Princ. for Eng.", "info": ""}, {"courseNum": "CEEG 443", "courseName": "Systems&Life; Cycle Assessment", "info": ""}, {"courseNum": "CEEG 444", "courseName": "Hazardous Waste Management", "info": ""}, {"courseNum": "CEEG 451", "courseName": "Environmental Geotechnology", "info": ""}, {"courseNum": "CEEG 454", "courseName": "Unsaturated Soil Mechanics", "info": ""}, {"courseNum": "CEEG 472", "courseName": "Construction Engineering", "info": ""}, {"courseNum": "CEEG 480", "courseName": "Special Topics in Civil Engr", "info": ""}, {"courseNum": "CEEG 491", "courseName": "Civil Engineering Design", "info": ""}, {"courseNum": "CEEG 622", "courseName": "River Mechanics", "info": ""}, {"courseNum": "CEEG 640", "courseName": "Phys/Chem Treatment Processes", "info": ""}, {"courseNum": "CEEG 642", "courseName": "Sustainability Princ. for Eng", "info": ""}, {"courseNum": "CEEG 643", "courseName": "Systems&Life; Cycle Assessment", "info": ""}, {"courseNum": "CEEG 644", "courseName": "Hazardous Waste Management", "info": ""}, {"courseNum": "CEEG 651", "courseName": "Environmental Geotechnology", "info": ""}, {"courseNum": "CEEG 654", "courseName": "Unsaturated Soil Mechanics", "info": ""}, {"courseNum": "CEEG 699", "courseName": "Thesis", "info": ""}, {"courseNum": "CHEG 101", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 102", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 103", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 104", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 200", "courseName": "Chemical Engineer Principles", "info": "Introduction to the concepts of material and energy balances and phase equilibria for chemical engineering processes. Introduction to problem solving methodologies and computer simulation. With experimental laboratory. Prerequisite: MATH 201."}, {"courseNum": "CHEG 210", "courseName": "Applied Math for Chemical Engr", "info": "Mathematical modeling and methods. Topics include ordinary and partial differential equations, Laplace transforms, and matrices with analytical and computer solutions. With computational laboratory. Prerequisite: MATH 211 or equivalent."}, {"courseNum": "CHEG 302", "courseName": "Equilibrium Stage Processes", "info": "Analysis of binary and multicomponent separations by analytical, graphical, and computer methods. Topics include gas absorption, distillation, liquid-liquid extraction as well as selected novel separation processes. With computational laboratory. Prerequisite: CHEG 200. Corequisite: CHEG 300."}, {"courseNum": "CHEG 310", "courseName": "Chemical Engr Thermodynamics", "info": "Laws of thermodynamics, thermodynamic properties of materials, equations of state, refrigeration and engine cycles, physical and chemical reaction equilibrium, and solution thermodynamics. With computational laboratory. Prerequisites: CHEG 302 and CHEM 341 or CHEM 343."}, {"courseNum": "CHEG 315", "courseName": "Unit Operations Laboratory", "info": "A laboratory course in pilot-scale processes involving momentum, heat and mass transfer. Project definition, experimental operation, analytical procedures, data analysis, technical reports and oral presentations."}, {"courseNum": "CHEG 330", "courseName": "Process Control", "info": "Dynamics of open and closed-loop processes. Design, analysis and tuning of PID feedback control based on transient, Laplace domain, and frequency response methods. Instrumentation and computer-based data acquisition and control for chemical processes. With experimental laboratory. Introduction to feedforward, cascade and advanced control strategies. Prerequisites: CHEG 300 and CHEG 302."}, {"courseNum": "CHEG 410", "courseName": "Project Engineering", "info": "Second of two capstone experiences for chemical engineering majors. Students refine a general problem statement in order to plan, execute and assess a project that achieves specific goals. Design, construction, and testing of an apparatus, system, or simulation. Problem-solving, teamwork, communication, professional development, and laboratory work are emphasized. With design laboratory. Prerequisite: CHEG 400."}, {"courseNum": "CHEG 431", "courseName": "Chemical Engineering Project", "info": "Individual work with a faculty adviser on a development or design project beginning with a written plan and culminating with a deliverable product and a written report. Problem analysis involving information synthesis, experimentation, mathematical modeling, or software development."}, {"courseNum": "CHEG 441", "courseName": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written and an oral presentation before a faculty group."}, {"courseNum": "CHEG 445", "courseName": "Experiments-Polymer Sci & Tech", "info": "Laboratory investigation into problems involving the synthesis, characterization, and processing of polymeric materials. Prerequisite: ENGR 240 or ENGR 242. Not open to students who have taken CHEG 450 prior to Fall 2012 or CHEG 435.."}, {"courseNum": "CHEG 460", "courseName": "Biomaterial-Materl in Medicine", "info": "Classes of biomaterials, their applications, and current trends in biomaterials research and technology. Medical/ ethical implications of biomaterials development and research."}, {"courseNum": "CHEG 470", "courseName": "Special Topics in Chem Engr", "info": "Advanced, in-depth courses developed from areas of chemical engineering science or technology."}, {"courseNum": "CHEG 472", "courseName": "Special Topics in Chem Engr", "info": "Advanced, in-depth courses developed from areas of chemical engineering science or technology."}, {"courseNum": "CHEG 485", "courseName": "Topics in Transport Theory", "info": "Mass, energy, and momentum transfer in continuous media. General equations of transfer developed and used to  analyze physical systems. Development and application of mathematical techniques appropriate to the topic."}, {"courseNum": "CHEG 610", "courseName": "Project Engineering", "info": "Second of two capstone experiences for chemical engineering majors. Students refine a general problem statement in order to plan, execute and assess a project that achieves specific goals. Design, construction, and testing of an apparatus, system, or simulation. Problem-solving, teamwork, communication, professional development, and laboratory work are emphasized. With design laboratory. Prerequisite: permission of the instructor."}, {"courseNum": "CHEG 641", "courseName": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written and an oral presentation before a faculty group."}, {"courseNum": "CHEG 645", "courseName": "Experiments-Polymer Sci & Tech", "info": "Laboratory investigation into problems involving the synthesis, characterization, and processing of polymeric materials."}, {"courseNum": "CHEG 660", "courseName": "Biomaterial-Materl in Medicine", "info": "Classes of biomaterials, their applications, and current trends in biomaterials research and technology. Medical/ ethical implications of biomaterials development and research."}, {"courseNum": "CHEG 670", "courseName": "Special Topics in Chem Engr", "info": "Advanced, in-depth courses developed from areas of chemical engineering science or technology. Prerequisite: permission of the instructor."}, {"courseNum": "CHEG 672", "courseName": "Special Topics in Chem Engr", "info": "Advanced, in-depth courses developed from areas of chemical engineering science or technology. Prerequisite: permission of the instructor."}, {"courseNum": "CHEG 680", "courseName": "Graduate Research and Thesis", "info": "Individual graduate-level investigations culminating in a thesis. Required for the master of science in chemical engineering degree."}, {"courseNum": "CHEG 685", "courseName": "Topics in Transport Theory", "info": "Mass, energy, and momentum transfer in continuous media. General equations of transfer developed and used to analyze physical systems. Development and application of mathematical techniques appropriate to the topic."}, {"courseNum": "CHEM 160", "courseName": "Intro Environmental Chemistry", "info": "One semester terminal course in chemistry. Basic chemical concepts as they relate to chemical behavior, toxicity, and effects in the environment. Case studies are used to illustrate concepts. Satisfies laboratory science requirement for bachelor of arts students not majoring in science or engineering. Laboratory will emphasize techniques used for environmental analysis. Not open to students who have taken CHEM 201, CHEM 202, or CHEM 211. Prerequisite: seniors by permission only."}, {"courseNum": "CHEM 202", "courseName": "General Chemistry II", "info": "Fundamental principles in inorganic chemistry. Atomic structure, bonding, equilibrium, kinetics, etc. Laboratory experiments are both qualitative and quantitative."}, {"courseNum": "CHEM 205", "courseName": "Principles of Chemistry", "info": ""}, {"courseNum": "CHEM 211", "courseName": "Organic Chemistry I", "info": "First year, first semester course for students majoring in chemistry, biochemistry, and biology. Bonding and structure in organic compounds, resonance, organic acid/base reactions, basic nomenclature, conformational analysis, stereochemistry, properties and reactions of functional groups."}, {"courseNum": "CHEM 231", "courseName": "Analytical Chemistry", "info": "Chemical equilibrium and modern analysis with an emphasis on acid-base systems, solubility, metal ion determinations, electroanalytical chemistry, spectrophotometry, and separation methods."}, {"courseNum": "CHEM 322", "courseName": "Inorganic Chemistry II", "info": "Survey course in modern inorganic chemistry covering transition metal, coordination, organometallic, and bioinorganic chemistry. Laboratory will consist of synthetic and physical measurements as well as the manipulation of air sensitive materials."}, {"courseNum": "CHEM 342", "courseName": "Physical Chemistry II", "info": "Introductory physical chemistry with emphasis on quantum mechanics, structure and bonding, molecular spectroscopy and statistical mechanics. The customized laboratory experience will emphasize applications of spectroscopy and computational methods. Prerequisite: CHEM 341."}, {"courseNum": "CHEM 347", "courseName": "Special Topics-Physical Chem", "info": "Available by independent study."}, {"courseNum": "CHEM 352", "courseName": "Biochemistry II", "info": "Advanced topics in protein structure and function, protein folding, enzyme mechanisms, electron transport and free- energy coupling mechanisms, biosynthesis, metabolic regulation, and supramolecular assemblies."}, {"courseNum": "CHEM 358", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation, protein, and nucleic acid analysis. Spectrophotometry, chromatography, centrifugation, electrophoresis, and mass spectrometry are emphasized."}, {"courseNum": "CHEM 371", "courseName": "Chemistry Lecture Series", "info": "Formal oral presentations on current research will be given by students, faculty and visiting scientists. Prerequisites: participation in an approved research project or independent study for seniors or second term juniors only."}, {"courseNum": "CHEM 376", "courseName": "Undergraduate Research", "info": "Original investigations in analytical, biological, organic, physical, environmental or inorganic chemistry."}, {"courseNum": "CHEM 386", "courseName": "Seminar", "info": "Topics vary."}, {"courseNum": "CHEM 622", "courseName": "Inorganic Chemistry II", "info": "Descriptive chemistry of inorganic compounds and topics in coordination chemistry. Prerequisite: CHEM 231."}, {"courseNum": "CHEM 642", "courseName": "Physical Chemistry II", "info": "Introductory physical chemistry with emphasis on quantum mechanics, molecular spectroscopy and statistical mechanics. The customized laboratory experience will emphasize applications of spectroscopy and computational methods."}, {"courseNum": "CHEM 647", "courseName": "Special Topics-Physical Chem.", "info": "Topics will vary. Prerequisite: permission of the instructor."}, {"courseNum": "CHEM 652", "courseName": "Biochemistry II", "info": "Advanced topics in protein structure and function protein folding, enzyme mechanisms, electron transport and free- energy coupling mechanisms, biosynthesis, metabolic regulation, and supramolecular assemblies."}, {"courseNum": "CHEM 658", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation, protein, and nucleic acid analysis. Spectrophotometry, chromatography, centrifugation, and electrophoresis are emphasized. Prerequisite: permission of the instructor. Crosslisted as BIOL 340/640."}, {"courseNum": "CHEM 676", "courseName": "Graduate Research", "info": "Graduate research."}, {"courseNum": "CHEM 686", "courseName": "Seminar", "info": "Topics vary."}, {"courseNum": "CHEM 699", "courseName": "Thesis", "info": "Thesis."}, {"courseNum": "CHIN 102", "courseName": "Chinese I", "info": "Intensive introduction to spoken and written \"Mandarin\" Chinese, the puutonghuah (common language) of modern China."}, {"courseNum": "CHIN 104", "courseName": "Chinese II", "info": "Continued rigorous study of spoken and written \"Mandarin\" Chinese now called puutonghuah (the common language)."}, {"courseNum": "CHIN 202", "courseName": "Chinese III", "info": "Continued study of modern \"Mandarin\". Contemporary essays, movie scripts, short stories and newspaper articles. Equal emphasis on reading and speaking. Conducted in Chinese."}, {"courseNum": "CHIN 204", "courseName": "Chinese IV", "info": "Reading and discussion of selected modern Chinese texts: newspaper and magazine articles, essays, short stories, and film scripts.  Conducted in Chinese."}, {"courseNum": "CLAS 131", "courseName": "Greek Civilization", "info": "Introduction to Near Eastern and Greco-Roman civilization through study of major urban centers. Introduction to the study of ancient Greek civilization through its art, literature, history, religion, etc. Emphasis on the classical period."}, {"courseNum": "CLAS 215", "courseName": "Classical Myth", "info": "Study of the traditional tales of Greece and, to a lesser extent, the Near East and Rome; consideration and application of myth theory."}, {"courseNum": "CLAS 218", "courseName": "Roman History", "info": "Roman history from Rome's foundations as a backwater village ca. 753 BCE, through its rise as a world-power to its fall in the fourth century CE, focusing on economic and political issues."}, {"courseNum": "CLAS 225", "courseName": "The Classical Tradition", "info": "This class establishes, explores, and questions what it means to be \"classically educated\" and to engage in Classical Studies in the modern world. Prerequisite: permission of the instructor. Not open to first-year students."}, {"courseNum": "CLAS 243", "courseName": "Archaeology of Rome", "info": "Survey of the material culture of the Roman world from the Etruscans through the late Empire. Crosslisted as ARTH 243, CLAS 214."}, {"courseNum": "CLAS 252", "courseName": "The New Testament", "info": ""}, {"courseNum": "CLAS 253", "courseName": "Ancient Ships and Seafaring", "info": ""}, {"courseNum": "CLAS 311", "courseName": "Independent Study in Classics", "info": "Topics in classical civilization, to be chosen by the student."}, {"courseNum": "CLAS 322", "courseName": "Honors Tutorial and Thesis", "info": "Independent study and research leading to the writing of a thesis."}, {"courseNum": "CLAS 334", "courseName": "Women in Antiquity", "info": "Seminar-style examination of the lives of women in antiquity both real and imagined, as attested in a variety of ancient media. Crosslisted as WMST 334. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 187", "courseName": "Creative Computing and Society", "info": ""}, {"courseNum": "CSCI 203", "courseName": "Intro to Computer Science I", "info": "Overview of computing that explores relationships between computer organization, various programming approaches, limits to computing, and computing in society. Students solve computational problems using Python."}, {"courseNum": "CSCI 204", "courseName": "Intro to Computer Science II", "info": "Introduction to data structures and algorithms using an object-oriented approach. Topics include software- engineering principals, object-oriented programming, recursion, basic data structures, algorithm analysis, and team programming."}, {"courseNum": "CSCI 205", "courseName": "Software Engineering & Design", "info": "Fundamentals of software design and software engineering. Students will participate in large-scale, team-based software development project. Prerequisite: CSCI 204 or permission of the instructor."}, {"courseNum": "CSCI 206", "courseName": "Computer Organization/Program", "info": "Concepts of software and hardware. Software: instruction set design, assembly language and assemblers. Hardware: processor organization, memory hierarchy, interfacing processors and I/O devices."}, {"courseNum": "CSCI 208", "courseName": "Programming Language Design", "info": "Study of modern programming language paradigms (procedural, functional, logic, object-oriented). Introduction to the design and implementation of programming languages including syntax, semantics, data types and structures, control structures, run-time environments."}, {"courseNum": "CSCI 240", "courseName": "Computers and Society", "info": "The place of the computer in modern society. An in-depth study of the societal, ethical, and legal issues of computing. Historical as well as futurists' views of computing and technology. Public perception of computers and computer scientists and how that influences the role of the computer scientist as a professional. Course work includes oral and written presentations."}, {"courseNum": "CSCI 245", "courseName": "Life,Computers, and Everything", "info": ""}, {"courseNum": "CSCI 305", "courseName": "Introduction to Database", "info": "Relational database design methodologies, evaluation techniques, programming, and query languages. Introduction to database systems design, performance, and object- oriented databases. Prerequisites: junior or senior standing and CSCI 206."}, {"courseNum": "CSCI 320", "courseName": "Computer Architecture", "info": "Use hardware description language to describe and design digital systems. Processor design, pipelining, cache and storage systems. Instruction and thread level parallelism, speculation, branch prediction."}, {"courseNum": "CSCI 376", "courseName": "Computer Sci Honors Thesis", "info": "Independent work on computer science honors thesis."}, {"courseNum": "CSCI 378", "courseName": "Individual Study in Comp Sci", "info": "Independent study in computer science. Recent areas include graph algorithms, computer security, distributed computing, graphics, programming languages, software engineering, web retrieval. Prerequisites: junior standing and permission of the instructor."}, {"courseNum": "CSCI 379", "courseName": "Topics in Computer Science", "info": "Current topics of interest. Course may/may not require laboratory depending upon the topic. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 476", "courseName": "Senior Design II", "info": "Students will undertake several cycles of delivery, including (for each cycle); a design document, an implementation of the product, testing, and feedback. Students will produce a technical manual and a user's manual for the final version. Class presentations of the design versions and implementations will be given to obtain feedback. There will be a public presentation of the final product and design process."}, {"courseNum": "DANC 120", "courseName": "Modern Dance Technique I", "info": "Beginning level technique emphasizing the basic principles of different modern dance styles, dynamics and alignment through floorwork, locomotor patterns, improvisation and movement combinations."}, {"courseNum": "DANC 140", "courseName": "Ballet Technique I", "info": "Beginning level ballet course emphasizing fundamental classical ballet technique and vocabulary necessary for performance."}, {"courseNum": "DANC 205", "courseName": "Jazz Dance Technique II", "info": "Intermediate/advanced jazz dance course emphasizing complex combinations in technique and rhythm of American vernacular, Broadway, and contemporary jazz."}, {"courseNum": "DANC 207", "courseName": "Musical Theatre", "info": "An experiential study of musical theatre as an art form with unique conventions and aesthetics, focusing on the performance and production elements of the Broadway stage. Some experience suggested."}, {"courseNum": "DANC 220", "courseName": "Modern Dance Technique II", "info": "Intermediate level technique exploring the basic principles of different modern dance styles, alignment, dynamics, and musicality through floorwork, locomotor patterns and movement combinations. Prerequisite: DANC 120."}, {"courseNum": "DANC 240", "courseName": "Ballet Technique II", "info": "Intermediate level ballet course emphasizing the development of technique and performance aesthetics."}, {"courseNum": "DANC 262", "courseName": "Dance Composition", "info": "Introduction to the fundamental elements and underlying principles of the craft and art of dance composition emphasizing practical experience in structuring solo and group choreography."}, {"courseNum": "DANC 360", "courseName": "Rehearsal and Performance", "info": "Quarter-course credit for substantial participation in dance production."}, {"courseNum": "EAST 203", "courseName": "Digital Methods: CHIN Studies", "info": ""}, {"courseNum": "EAST 205", "courseName": "Intro to Translation Studies", "info": "An introduction to the history, theories, and development of the field of Translation Studies. Facility in one language other than English is strongly recommended. Crosslisted as HUMN 260."}, {"courseNum": "EAST 208", "courseName": "The Red Brush", "info": ""}, {"courseNum": "EAST 220", "courseName": "Japanese Warrior in Literature", "info": "Traces the literary (re)construction of the 'warrior' in Japanese literature, from the samurai of the 12th century to the Imperial soldier of the mid 20th century. Taught in English."}, {"courseNum": "EAST 226", "courseName": "East Asian Politics", "info": "This course surveys political history, political institutions, economy, and society of major countries in East Asia, with focus on the continuity and changes in politics and policies of China, Japan, and Korea."}, {"courseNum": "EAST 229", "courseName": "Late Imperial Chinese Fiction", "info": ""}, {"courseNum": "EAST 251", "courseName": "Buddhism", "info": "An interdisciplinary introduction to Buddhism, including basic teachings of liberation from suffering, impermanence, no-self, ethics, and meditation. Also explores the historical development of various streams of Buddhism in Asia and the West, with attention to the effect of Buddhism on society, politics, and material culture."}, {"courseNum": "EAST 253", "courseName": "Religions of Japan", "info": "An introduction to the religious traditions of Japan through study of their origins, basic beliefs, practices and values, historical development, as well as their interaction and involvement with politics, culture, society, and each other. Focus on Shinto and the various forms of Japanese Buddhism."}, {"courseNum": "EAST 267", "courseName": "The People's Republic of China", "info": "A historical look at life in China under the rule of the Communist Party.  Unprecedented triumphs and tribulations."}, {"courseNum": "EAST 382", "courseName": "U.S.-China Relations", "info": "Through tracing the evolution of US-China relations from the 19th century to the 21st century, this course discusses major issues and challenges between the two countries today. Future trends of the bilateral relationship will also be explored. Prerequisites: POLS 170. Preference given to EAST, IREL, and POLS seniors. May be crosslisted as IREL 482 and/or POLS 382. Not open to students who have taken EAST 380, IREL 380 or IREL 382."}, {"courseNum": "EAST 395", "courseName": "EAST Honors Thesis", "info": "Focused research relevant to department culminating experience."}, {"courseNum": "ECEG 120", "courseName": "Introduction to ECE", "info": ""}, {"courseNum": "ECEG 226", "courseName": "Circuit Theory II", "info": ""}, {"courseNum": "ECEG 240", "courseName": "Digital System Design", "info": ""}, {"courseNum": "ECEG 301", "courseName": "Praxis of Engineering Design", "info": ""}, {"courseNum": "ECEG 347", "courseName": "Embedded & Cyber-Physical Sys", "info": ""}, {"courseNum": "ECEG 351", "courseName": "Electronics II", "info": ""}, {"courseNum": "ECEG 390", "courseName": "Theory/Appl Electromagnetics", "info": ""}, {"courseNum": "ECEG 401", "courseName": "ECE Capstone Design II", "info": ""}, {"courseNum": "ECEG 463", "courseName": "Introduction to Mechatronics", "info": ""}, {"courseNum": "ECEG 472", "courseName": "Digital Signals and Commun.", "info": ""}, {"courseNum": "ECEG 477", "courseName": "Wireless System Design", "info": ""}, {"courseNum": "ECEG 491", "courseName": "Electrical Energy Conversion", "info": ""}, {"courseNum": "ECEG 663", "courseName": "Introduction to Mechatronics", "info": ""}, {"courseNum": "ECEG 672", "courseName": "Digital Signal Processing", "info": ""}, {"courseNum": "ECEG 677", "courseName": "Wireless System Design", "info": ""}, {"courseNum": "ECON 103", "courseName": "Economic Principles/Problems", "info": "General introduction to both macroeconomics and microeconomics, along with an introduction to economic history, international economics, and political economy. The course also examines the origin of economic ideas in the works of Adam Smith, John Maynard Keynes, Karl Marx, and others."}, {"courseNum": "ECON 222", "courseName": "Economic Topics", "info": "Selected issues in economic theory or policy."}, {"courseNum": "ECON 224", "courseName": "African Women & Social Action", "info": "Analysis of topics in films and novels by Ousmane Sembene: pre-colonial history, colonialism, post-colonial independence, racial and gender oppression, worker exploitation, religious conflict, and modernization. Prerequisite: ECON 103. Crosslisted as WMST 224."}, {"courseNum": "ECON 227", "courseName": "International Economics", "info": "An examination of international economic relations today and of the theory used to analyze trade and financial relations.  Attention is given to the problems of government policy with respect to international issues."}, {"courseNum": "ECON 256", "courseName": "Intermediate  Microeconomic", "info": "Intermediate economic theory of the consumer, the firm, market structures, and resource allocation."}, {"courseNum": "ECON 257", "courseName": "Intermediate Macroeconomic", "info": "The study of national income, employment, inflation, interest rates, and the impact of monetary and fiscal policy on the economy."}, {"courseNum": "ECON 258", "courseName": "Intermediate Political Economy", "info": "Intermediate study of Marxist and institutionalist political economy. The ideas of Marx and Veblen applied to such matters as the distribution of income and power, the environment, working conditions, consumerism, and race and gender issues."}, {"courseNum": "ECON 259", "courseName": "Intmdt Mathematical Microecon", "info": "Intermediate microeconomic theory of the consumer, the firm, market structures, and resource allocation. Topics are introduced using differential calculus. Not open to students who have completed ECON 256."}, {"courseNum": "ECON 299", "courseName": "Teaching Assistants in ECON", "info": "This course can only be taken by economic majors who have permission and have taken the prerequisites."}, {"courseNum": "ECON 313", "courseName": "Public Finance", "info": "An analysis of the government's role in the economy.  Topics include the economic rationale for government, expenditure analysis, and the allocative and distributive consequences of taxation. It is strongly recommended that students have one semester of statistics."}, {"courseNum": "ECON 319", "courseName": "Econ History of Women in U.S.", "info": "Examination of the history of women in the U.S. economy, with particular attention to racial-ethnic and class differences among women. Both neoclassical economics and political economy are utilized to analyze the economic status of women. Crosslisted as WMST 318. Prerequisites: ECON 256 or 257 or 258 or 259 and permission of the instructor."}, {"courseNum": "ECON 327", "courseName": "International Economic Theory", "info": "Theoretical principles underlying international trade, investment, commercial policy, economic integration, adjustment mechanisms, and balance of payments policy will be examined with an application of these principles to current national and international policies. policies."}, {"courseNum": "ECON 328", "courseName": "Money & Financial Institutions", "info": "An analysis of the role of the financial system in the U.S. economy. Topics include determinants of asset prices, risk management, and financial regulations."}, {"courseNum": "ECON 341", "courseName": "Econometrics", "info": "The application of statistical methods to quantify and test economic theories, analyze government policies, and forecast economic variables."}, {"courseNum": "ECON 358", "courseName": "Marxian Economics", "info": "Examines the implications of class struggle on microeconomic competition, the distribution of value within and between firms, and macroeconomic instability accumulation and crises at the national and international level."}, {"courseNum": "ECON 405", "courseName": "Comparative Economic Systems", "info": "A critical analysis of the organization of economic systems. The characteristics of selected capitalist and socialist economics studied and assessed from both mainstream and Marxian analytical perspectives. Prerequisite: ECON 258 or permission of the instructor. Preference given to ECON and ECMA majors. Not open to students who have taken ECON 305."}, {"courseNum": "ECON 410", "courseName": "Risk Mgmt in Financial Markets", "info": ""}, {"courseNum": "ECON 429", "courseName": "Pol Econ of Financial Crises", "info": "This course will explore the courses and consequences of financial crises from macroeconomic perspectives, with most of the attention given to the recent financial crisis in the U. S."}, {"courseNum": "ECON 441", "courseName": "Advanced Econometrics", "info": "The application of statistical methods to quantify and test economic theories, analyze government policies, and forecast economic variables. Prerequisites: ECON 256 or ECON 259 and ECON 257, and one semester of statistics or permission of the instructor. Not open to students who have had ECON 341."}, {"courseNum": "ECON 444", "courseName": "Senior Seminar", "info": ""}, {"courseNum": "EDUC 101", "courseName": "Social Foundation of Education", "info": "Historical, economic, philosophical, and social foundations of education, and their implications for present-day education in America. Provides a background of information for the prospective teacher and citizen."}, {"courseNum": "EDUC 201", "courseName": "Educational Psychology", "info": "Role of psychological concepts in educational practices. Nature, sources of individual differences in development and readiness. Learning theory, motivation, and emotion in learning.  Issues in identifying and supporting the learning of all students. Measurement and evaluation of learning."}, {"courseNum": "EDUC 227", "courseName": "Immigrant Youth in US Society", "info": ""}, {"courseNum": "EDUC 230", "courseName": "Foundation ClassroomAssessment", "info": "Use of observation, documentation, and assessment to develop instructional practices that support learning of all children. Includes assessment across environments and for different purposes. Prerequisite: junior status or permission of the instructor."}, {"courseNum": "EDUC 232", "courseName": "Remaking Public Education", "info": ""}, {"courseNum": "EDUC 235", "courseName": "Integrated Arts in Learning", "info": "Students will be introduced to intermodal aspects of art (dance, music, theatre, visual arts, and poetry) and how they might be used to develop and enhance curriculum within the inclusive classroom as well as alternative learning environments. Issues of health, learning disabilities, learning styles and cultural difference will be actively explored through the theoretical lens of art-based education."}, {"courseNum": "EDUC 240", "courseName": "Literacy/Learning in Diverse", "info": "Students explore how diverse adolescents develop abilities to decode, interpret, and use language and mathematical sign systems to gain access to secondary school content knowledge. Students also analyze structures, and tools of inquiry embedded in secondary school subjects. Other topics: curriculum integration, strategies for literacy development, learning disabilities that impact literacy, and teaching and learning of English Language Learners. Required fieldwork."}, {"courseNum": "EDUC 308", "courseName": "Adv Ed Foundation:Democracy/Ed", "info": "This course employs a multidisciplinary approach to explore the relationship between education and democracy in \"free\" societies such as the United States. Students will critically examine the American educational system and its contemporary problems through the lenses of history, philosophy, sociology, and anthropology."}, {"courseNum": "EDUC 315", "courseName": "Senior Thesis", "info": "Senior thesis."}, {"courseNum": "EDUC 317", "courseName": "Problems in Education", "info": "Research on a problem not involved in a student thesis. Prerequisite: three courses in education or permission of the instructor."}, {"courseNum": "EDUC 318", "courseName": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education."}, {"courseNum": "EDUC 319", "courseName": "Group Processes", "info": "This course provides an overview of the basic dynamics, theoretical components, and developmental aspects of small groups with clients in educational settings. Students participate in a variety of group interventions as both a group leader and a group member. Required field placement."}, {"courseNum": "EDUC 334", "courseName": "Later Childhood & Adolescence", "info": "Uses theory, case studies, and field experience to illustrate early and later adolescent development. Required field work. Not open to students who have taken EDUC 335."}, {"courseNum": "EDUC 341", "courseName": "Early Literacy", "info": "A study of the strategies and techniques involved in teaching children to read and to write  (Pre-K-4 level). Contemporary theories of reading behavior. Required field work."}, {"courseNum": "EDUC 343", "courseName": "Culture and Community", "info": "Consideration of special problems arising in teaching social studies in elementary and secondary schools. Influences determining course content, including state and national standards. Prerequisite: junior status or permission of the instructor."}, {"courseNum": "EDUC 346", "courseName": "Literacy Across Contexts", "info": "Principles of creating a developmentally appropriate elementary learning environment. Emphasis is placed on the process of designing instruction appropriate for learners at various levels of cognitive, emotional, and social development. Language Arts and its domains will be used to illustrate, explain, and extend course concepts. Issues related to student motivation and classroom management will also be examined. Required fieldwork. Prerequisite: junior status or permission of the instructor."}, {"courseNum": "EDUC 347", "courseName": "Family,School,Community", "info": "Students will explore important factors and effective strategies in creating and sustaining respectful, reciprocal, supportive and empowering relationships with families to enhance children's development and learning. Prerequisite: junior status or permission of the instructor."}, {"courseNum": "EDUC 350", "courseName": "Higher Education in the U.S.", "info": "Overview of historical and contemporary trends in post- secondary education: systematic examination of selected social, political, economic, and educational forces and problems affecting contemporary higher education."}, {"courseNum": "EDUC 359", "courseName": "Student Teaching: Secondary", "info": "Supervised practice in the design and implementation of instruction in secondary school classrooms. Emphasis on professional conduct and use of theory to inform practice."}, {"courseNum": "EDUC 362", "courseName": "Quantitative Research Methods", "info": "This course emphasizes the design of experimental research and the development of skills in analyzing and interpreting data. Experimental research in education and psychology is critiqued in terms of theory, past research, hypothesis generation, and research design. Data analysis involves the use of the statistical packages such as SPSS which are broadly applicable to the social and psychological sciences."}, {"courseNum": "EDUC 375", "courseName": "Methods of Teaching ESL", "info": "This course focuses on preparing students to teach students for whom English is their second language (ESL). It focuses on three primary areas: instructional materials development for ESL; assessment and support of ESL students; and cultural awareness and sensitivity."}, {"courseNum": "EDUC 376", "courseName": "ESL Internship/Prof. Seminar", "info": ""}, {"courseNum": "EDUC 398", "courseName": "Stdnt Affairs Program HigherEd", "info": "The study of historical and philosophical foundations of the student affairs profession and the roles and functions of student affairs professionals in contemporary collegiate institutions."}, {"courseNum": "EDUC 425", "courseName": "Internship in Education", "info": "Supervised practice in an educational setting including a structured reflection component. This course may be used to fulfill the culminating experience course requirement for the B.A. in education."}, {"courseNum": "EDUC 439", "courseName": "Student Teaching in Music", "info": "Student teaching in music."}, {"courseNum": "EDUC 459", "courseName": "Professional Seminar-Sec Educ", "info": "Systematic approach to the observation, interpretation, verification, and remediation of problems affecting student learning. Psychological and sociological theory informing teaching practice. Implications of student diversity for adaptation of instruction."}, {"courseNum": "EDUC 617", "courseName": "Problems in Education", "info": "Research on a problem not involved in a student thesis. Prerequisite: permission of the instructor."}, {"courseNum": "EDUC 618", "courseName": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education."}, {"courseNum": "EDUC 619", "courseName": "Group Processes", "info": "This course provides an overview of the basic dynamics, theoretical components, and developmental aspects of small groups with clients in educational settings. Students participate in a variety of group interventions as both a group leader and a group member. Required field placement."}, {"courseNum": "EDUC 650", "courseName": "Higher Education in the U.S.", "info": "Overview of historical and contemporary trends in post- secondary education: systematic examination of selected social, political, economic, and educational forces and problems affecting contemporary higher education."}, {"courseNum": "EDUC 662", "courseName": "Quantitative Research Methods", "info": "This course emphasizes the design of experimental research and the development of skills in analyzing and interpreting data. Experimental research in education and psychology is critiqued in terms of theory, past research, hypothesis generation, and research design. Data analysis involves the use of the statistical packages such as SPSS, which are broadly applicable to the social and psychological sciences."}, {"courseNum": "EDUC 681", "courseName": "Master's Treatise", "info": "Master's Treatise."}, {"courseNum": "EDUC 697", "courseName": "College Stdnt Personnel Intern", "info": "Supervised practice in student affairs, together with group reflection. May be repeated for up to two credits."}, {"courseNum": "EDUC 698", "courseName": "Stdnt Affairs Program HigherEd", "info": "The study of historical and philosophical foundations of the student affairs profession and the roles and functions of student affairs professionals in contemporary collegiate institutions."}, {"courseNum": "ENCW 101", "courseName": "Creative Writing", "info": ""}, {"courseNum": "ENCW 104", "courseName": "Creative Writing: Poetry", "info": ""}, {"courseNum": "ENCW 202", "courseName": "Fiction Workshop", "info": ""}, {"courseNum": "ENCW 204", "courseName": "Poetry Workshop", "info": ""}, {"courseNum": "ENCW 205", "courseName": "Screenwriting Workshop", "info": ""}, {"courseNum": "ENCW 220", "courseName": "Comedy and Satire Workshop", "info": ""}, {"courseNum": "ENCW 302", "courseName": "Advanced Fiction Workshop", "info": ""}, {"courseNum": "ENCW 304", "courseName": "Advanced Poetry Workshop", "info": ""}, {"courseNum": "ENFS 130", "courseName": "Intro to Film/Media Studies", "info": ""}, {"courseNum": "ENFS 234", "courseName": "National Cinemas", "info": ""}, {"courseNum": "ENFS 238", "courseName": "Special Topics in Film Studies", "info": ""}, {"courseNum": "ENFS 254", "courseName": "Film Exhibition & Programming", "info": ""}, {"courseNum": "ENFS 337", "courseName": "Seminar in Film Theory", "info": ""}, {"courseNum": "ENFS 339", "courseName": "Film/Video Production", "info": ""}, {"courseNum": "ENFS 340", "courseName": "Film/Media Prod Practicum", "info": ""}, {"courseNum": "ENGR 101", "courseName": "Engineering Graphics", "info": "Introduction to engineering graphics including drawing with drafting instruments, computer-aided drafting and surveying."}, {"courseNum": "ENGR 200", "courseName": "Thermodynamics", "info": "Properties, first law, second law, entropy, availability, efficiency, pure substances, real gases. Introduction to heat transfer."}, {"courseNum": "ENGR 212", "courseName": "Engineering Computation", "info": "An in-depth introduction to using computers as a fundamental tool for solving civil engineering problems. Course will include: structured programming, and numerical methods."}, {"courseNum": "ENGR 214", "courseName": "Computational Analysis", "info": "Introduction to a modern computer language. Structured programming and algorithm design for engineering problems involving linear algebra, statistical analysis of data, and elementary numerical analysis. Introduction and use of a scientific application package as a tool."}, {"courseNum": "ENGR 215", "courseName": "Experimental Design/Data Analy", "info": "Introduction to the analysis of experimental and industrial data. Topics include statistical inference, analysis of variance, regression analysis, experimental design and computational methods. With computational laboratory. Not open to students who have taken BMEG 226."}, {"courseNum": "ENGR 221", "courseName": "Mechanics", "info": "Equilibrium of two-and three-dimensional force systems. Friction. Kinematics and kinetics of particles and rigid bodies. Corequisite: MATH 212 or MATH 222. Not open to students who have taken ENGR 220. Not open to civil and environmental engineering and mechanical engineering students. Not open to students who have taken ENGR 220 or MECH 220."}, {"courseNum": "ENGR 222", "courseName": "Civil Engr. Fluid Mechanics", "info": "Fluid properties and hydrostatics. Flow concepts and basic equations. Viscous flow in pipes and channels. Steady pipe flow. Potential flow. Introduction to open channels or hydraulic machinery."}, {"courseNum": "ENGR 229", "courseName": "Solid Mechanics I", "info": ""}, {"courseNum": "ENGR 233", "courseName": "Chemical Engr. Fluid Mechanics", "info": "Fluid statics, laminar and turbulent flow of incompressible fluids; introduction to compressible and non-Newtonian fluids; nature of forces, momentum transfer, shell balances; dimensional analysis; applications to pipe flow, drag, fluid measurement and pump design. With experimental laboratory. Prerequisites: ENGR 100 and ENGR 215. Corequisite: CHEG 210."}, {"courseNum": "ENGR 240", "courseName": "Science of Materials", "info": "Study of the relationships between atomic structure and observable properties of materials. Properties of metallic, ceramic, and polymeric materials. Selection of materials for engineering applications. Measurement and modification of material properties. With experimental laboratory. Corequisite: one of the following: CHEM 201, CHEM 211, CHEM 221, CHEM 222, or equivalent, or permission of the instructor."}, {"courseNum": "ENGR 242", "courseName": "Materials Engineering", "info": "Elements of science of materials. Evaluation and control of properties of common civil engineering materials, including steel, concrete, wood and polymers. Laboratory tests of materials. Visitation trips to see fabrication and quality management procedures of selected materials. Prerequisite: ENGR 220."}, {"courseNum": "ENGR 453", "courseName": "Interdisp. Senior Design II", "info": ""}, {"courseNum": "ENLS 101", "courseName": "Literature and Composition", "info": ""}, {"courseNum": "ENLS 150", "courseName": "Enlightenments", "info": ""}, {"courseNum": "ENLS 199", "courseName": "Survey: Literatures in English", "info": ""}, {"courseNum": "ENLS 200", "courseName": "Ways of Reading", "info": ""}, {"courseNum": "ENLS 203", "courseName": "Intro. Topics in Race and Lit", "info": ""}, {"courseNum": "ENLS 216", "courseName": "Studies in Amer Lit Genres", "info": ""}, {"courseNum": "ENLS 217", "courseName": "Studies in Dramatic Literature", "info": ""}, {"courseNum": "ENLS 220", "courseName": "Young Adult Fiction", "info": ""}, {"courseNum": "ENLS 228", "courseName": "Gender & Sexuality in America", "info": ""}, {"courseNum": "ENLS 260", "courseName": "Restoration/18th Century Lit", "info": ""}, {"courseNum": "ENLS 268", "courseName": "Jewish-American Lit. and Film", "info": ""}, {"courseNum": "ENLS 284", "courseName": "The 19th-century English Novel", "info": ""}, {"courseNum": "ENLS 290", "courseName": "Special Topics", "info": ""}, {"courseNum": "ENLS 301", "courseName": "Seminar in American Lit Topics", "info": ""}, {"courseNum": "ENLS 307", "courseName": "Seminar: 19th C American Lit", "info": ""}, {"courseNum": "ENLS 350", "courseName": "Sem in Renaissance Literature", "info": ""}, {"courseNum": "ENLS 358", "courseName": "Seminar in Shakespeare", "info": ""}, {"courseNum": "ENLS 370", "courseName": "Sem in 19th-cen English Lit", "info": ""}, {"courseNum": "ENLS 601", "courseName": "Seminar in American Lit Topics", "info": ""}, {"courseNum": "ENLS 607", "courseName": "Seminar: 19th C American Lit", "info": ""}, {"courseNum": "ENLS 650", "courseName": "Sem in Renaissance Literature", "info": ""}, {"courseNum": "ENLS 658", "courseName": "Seminar in Shakespeare", "info": ""}, {"courseNum": "ENLS 670", "courseName": "Sem in 19th-Cen English Lit", "info": ""}, {"courseNum": "ENST 160", "courseName": "Intro Environmental Chemistry", "info": ""}, {"courseNum": "ENST 201", "courseName": "Environ Probs-Sustain Futures", "info": "Develops a working understanding of the core concepts linked to environmental studies and introduces skills such as posing researchable questions, gathering data, presenting oral arguments, and applying these skills in group projects. Intended only for students majoring or intending to major in Environmental Studies or Environmental Science."}, {"courseNum": "ENST 205", "courseName": "Green Utopias", "info": "Introduction to literary utopias and to the cultural writings of various ecological movements offering alternative concepts to the increasing destruction of nature."}, {"courseNum": "ENST 207", "courseName": "American Environmental History", "info": "This course examines how nature (soil, disease, water, climate, etc.) shaped American history and how Americans transformed the environment, from the colonial period to today. Crosslisted as HIST 212."}, {"courseNum": "ENST 211", "courseName": "Environmentl Pollution/Control", "info": "Introduction for non-engineering students to the major areas of environmental engineering. Topics include environmental chemistry, biology and ecology, water and air pollution and treatment, solid and hazardous wastes, sustainability, and global climate issues."}, {"courseNum": "ENST 235", "courseName": "Marine Environment", "info": "Future of the oceans; global change and sea level rise, pollution and human impact, coastal management, threatened ecology of the ocean, sustainability and marine resources. Crosslisted as GEOG 235."}, {"courseNum": "ENST 286", "courseName": "Imagining Sustainability", "info": ""}, {"courseNum": "ENST 301", "courseName": "Environmental History", "info": ""}, {"courseNum": "ENST 302", "courseName": "Community-Based Research Desig", "info": "Students will learn quantitative and qualitative research methods related to environmental studies including research design, data collection, and analysis. Not open to students who have completed ENST 202. Prerequisite: junior or senior status. Preference to Environmental Studies majors, others by permission of the instructor."}, {"courseNum": "ENST 315", "courseName": "Cold Places", "info": "A seminar exploring the nature and culture of cold places-glaciers, mountain tops, Antarctica, and the Arctic- through art, film, literature, science, and popular media."}, {"courseNum": "ENST 411", "courseName": "Environ. Community Projects", "info": "Community-based \"clinic\" course on environmental problems or projects for local stakeholders, based on integrative, interdisciplinary research and design. Preference to senior ENST and GEOG majors. Crosslisted as GEOG 420."}, {"courseNum": "FOUN 098", "courseName": "Foundation Seminar", "info": "A small writing-intensive first-year seminar."}, {"courseNum": "FREN 101", "courseName": "Discovering French", "info": "Beginning language skills. Practice in listening, speaking, reading, and writing; elementary grammar; and introduction to French civilization. Prerequisite: no more than two years of secondary school French or permission of the instructor."}, {"courseNum": "FREN 102", "courseName": "Exploring French", "info": "Continuation of language skills. Practice in listening, speaking, reading, and writing; grammar; readings in literature and civilization."}, {"courseNum": "FREN 103", "courseName": "Building Proficiency in French", "info": "A review of basic grammar emphasizing all four language skills and culture."}, {"courseNum": "FREN 104", "courseName": "Communicating in Context", "info": "Continuing review of basic grammar emphasizing all four language skills and culture."}, {"courseNum": "FREN 202", "courseName": "Interm French Conversation II", "info": "Concentration on development of speaking skill. Conducted entirely in French by native speaker. Not open to students who have studied in France or other French-speaking countries. Intended for students enrolled in 200-level courses. (Cannot be applied toward the French major or minor)"}, {"courseNum": "FREN 236", "courseName": "Topics-Francophone Lit/Culture", "info": "Study of the literature, language, geography, history, music, and film of a particular Francophone region (French Caribbean, Quebec, West Africa, Maghreb, etc.)."}, {"courseNum": "FREN 255", "courseName": "Introduction to French Cinema", "info": "Introduction to French cinema from a cultural and historical perspective. Students will familiarize themselves with major cinematic movements and with methods of critical reading. The course also includes discussions of the relationships between film, literature, and other visual arts."}, {"courseNum": "FREN 288", "courseName": "Global Cuisines Local Contexts", "info": ""}, {"courseNum": "FREN 302", "courseName": "Advanced Fren Conversation II", "info": "Advanced conversation for students who have studied in France or other French-speaking countries. Conducted entirely in French by native speaker. May not be taken by native speakers of French. (Cannot be applied toward the French major or minor)"}, {"courseNum": "FREN 327", "courseName": "Twentieth-Century Studies", "info": "Topics vary and could focus on a period, a genre, a group of writers, or a theme from the 20th or 21st century."}, {"courseNum": "FREN 371", "courseName": "Topics in the Arts", "info": "Advanced study in themes, topics, or periods of French art history."}, {"courseNum": "FREN 390", "courseName": "Independent Study", "info": "Subject to be selected by student in consultation with the instructor."}, {"courseNum": "GEOG 101", "courseName": "Globalization, People & Place", "info": "Investigates the world from a spatial perspective to understand the complexity of places and the dynamic relationship between peoples and the world they inhabit."}, {"courseNum": "GEOG 202", "courseName": "Solving Problems With Maps", "info": ""}, {"courseNum": "GEOG 204", "courseName": "Applied G.I.S.", "info": "Introduction to the use of Geographical Information Systems to collect, structure, and display large or complex spatial data sets, using examples from human and physical geography. Prerequisite: permission of the instructor."}, {"courseNum": "GEOG 209", "courseName": "Economic Geography", "info": "Inquiry into local and global changes in economic activity, location and spatial organization, especially focusing on implications for the well-being of people in particular places."}, {"courseNum": "GEOG 211", "courseName": "Political Geography", "info": "Considers political processes from a geographical perspective across a range of scales, in particular analyzing the geographical arguments which shape international political relations."}, {"courseNum": "GEOG 220", "courseName": "Cultural Geography", "info": "Role of culture in shaping places. How cultures are geographically expressed, and how geography is a basic element in the constitution of cultures."}, {"courseNum": "GEOG 234", "courseName": "Human Ecology", "info": "A general science course in human ecology, to demonstrate the ways humans continue to adapt to their environment through biological, cultural, scientific, symbolic, political, and technical means. Crosslisted as ENST 234."}, {"courseNum": "GEOG 236", "courseName": "Third World Development", "info": "Socio-cultural, economic, and environmental problems confronting developing countries. Includes such topics as political-economic change in a global and local context, transnational corporations, gender relations, food production/consumption, urbanization, and sustainable development."}, {"courseNum": "GEOG 326", "courseName": "Thinking Space", "info": ""}, {"courseNum": "GEOG 420", "courseName": "Environmentl Community Project", "info": "Community-based \"clinic\" course on environmental problems or projects for local stakeholders, based on integrative, interdisciplinary research and design. Preference to senior ENST and GEOG majors. Crosslisted as ENST 411."}, {"courseNum": "GEOL 203", "courseName": "Physical/Environmental Geology", "info": ""}, {"courseNum": "GEOL 204", "courseName": "Evolution of the Earth", "info": ""}, {"courseNum": "GEOL 250", "courseName": "Geology for Engineers", "info": ""}, {"courseNum": "GEOL 304", "courseName": "Crystallography-Mineralogy", "info": ""}, {"courseNum": "GEOL 320", "courseName": "Undergraduate Research", "info": "Research course for qualified students in any branch of geology."}, {"courseNum": "GEOL 322", "courseName": "Special Topics in Geology", "info": "Investigation, report, or discussion on currently significant topics in geology."}, {"courseNum": "GEOL 334", "courseName": "Geophysics", "info": ""}, {"courseNum": "GEOL 338", "courseName": "Applied Environ Geomorphology", "info": ""}, {"courseNum": "GEOL 634", "courseName": "Geophysics", "info": ""}, {"courseNum": "GEOL 638", "courseName": "Applied Environ Geomorphology", "info": ""}, {"courseNum": "GLBM 300", "courseName": "Global Manager as Diplomat", "info": "This course will examine the changing role of the manager in the global business environment."}, {"courseNum": "GLBM 302", "courseName": "The Global Flow of Capital", "info": "This course will explore the challenges of financial management in a global context. Prerequisite: MGMT 203 or ACFM 370 or permission of the instructor."}, {"courseNum": "GLBM 400", "courseName": "Global Manager Abroad", "info": "Students will undertake a collaboration project with students in other locales and with a faculty adviser. Prerequisites: GLBM 300 or permission of the instructor. Juniors only."}, {"courseNum": "GREK 102", "courseName": "Introductory Ancient Greek", "info": "An introduction to the classical and koine forms of the language.  Emphasis upon forms and grammar, and rapid development of facility in reading.  Selections chosen from a range of Greek periods."}, {"courseNum": "GREK 221", "courseName": "Studies in Greek Literature", "info": "Study of a topic or author focusing on original Greek texts (e.g., Herodotus, Homer, Sophocles, Plato, New Testament). Highly recommended for students anticipating application to graduate programs in classics or divinity."}, {"courseNum": "GRMN 102", "courseName": "Everyday Life Germany-Elem II", "info": "Continuation of language skills. Practice in listening, speaking, reading, and writing; grammar; reading in culture and literature."}, {"courseNum": "GRMN 104", "courseName": "Communicating in Context", "info": "Review of basic grammar, emphasizing all four language skills and culture."}, {"courseNum": "GRMN 202", "courseName": "Strategies in Speaking German", "info": "Concentration on development of speaking skills. Conducted in German by native speaker. Intended for students enrolled in 200-and 300-level courses."}, {"courseNum": "GRMN 272", "courseName": "Modern GRMN Culture 1945-1990", "info": "An overview of cultural, social, economic, and political issues in the two Germanys. In German. Prerequisite: GRMN 204 or equivalent."}, {"courseNum": "GRMN 329", "courseName": "GRMN Lit in the 20th & 21st C", "info": "Analysis and interpretation of major literary works. In German. Prerequisite: GRMN 204 or equivalent."}, {"courseNum": "HEBR 102", "courseName": "Beginning Modern Hebrew II", "info": "Continuation of Modern Hebrew language skills. Practice in listening, speaking, reading, and writing and introduction to Israeli culture. Prerequisite: HEBR 101 or equivalent. Not open to students who completed HEBR 101A."}, {"courseNum": "HIST 100", "courseName": "Thinking about History", "info": "Focus and content vary. An introductory history course for the development of informed historical analysis among its students. Primarily for first-year students."}, {"courseNum": "HIST 201", "courseName": "Introduction to Historical GIS", "info": "This course analyzes events of the historical past using geographic information systems (GIS) digital mapping software. Not open to first-year students."}, {"courseNum": "HIST 204", "courseName": "American Identities", "info": ""}, {"courseNum": "HIST 222", "courseName": "US History: 1940s to Present", "info": "Continuation of History 221."}, {"courseNum": "HIST 225", "courseName": "Amer Political Economic Hist", "info": "Intensive study of leading themes, in American history since 1600. Topics vary from year to year, but may include economic and political structures; intellectual movements, or social and cultural history."}, {"courseNum": "HIST 230", "courseName": "Europe from 11th to 17th Cen", "info": "Survey of early modern European history 1000-1648."}, {"courseNum": "HIST 241", "courseName": "Roman History", "info": "Roman history from Rome's foundations as a backwater village ca. 753 BCE, through its rise as a world-power to its fall in the fourth century CE, focusing on economic and political issues. Crosslisted as CLAS 218."}, {"courseNum": "HIST 265", "courseName": "20th Century World Wars", "info": "Topics will vary. A history of the intellectual foundations and expressions of modern political life, including conservativism, liberalism, socialism, and anarchism."}, {"courseNum": "HIST 274", "courseName": "Africa International Relations", "info": ""}, {"courseNum": "HIST 276", "courseName": "Popular Culture in Africa", "info": ""}, {"courseNum": "HIST 301", "courseName": "Environmental History", "info": ""}, {"courseNum": "HIST 311", "courseName": "U.S. History since 1865", "info": "Topics vary."}, {"courseNum": "HIST 319", "courseName": "African-American History", "info": "Focuses on recent developments in the field. Topics vary but may include slavery; African American intellectual history; black feminism; race, class and gender; social and political movements; and cultural criticism."}, {"courseNum": "HIST 330", "courseName": "European History", "info": "Intensive study of selected issues. Topics vary."}, {"courseNum": "HIST 350", "courseName": "Honors Thesis", "info": "Credit may be taken either in one semester of the senior year or throughout the senior year."}, {"courseNum": "HUMN 128", "courseName": "Myth, Reason, Faith", "info": "An introduction to the most significant works in the Western and Asian intellectual traditions, extending from ancient Mesopotamia through late medieval Europe and/or East Asia. Not open to students who have completed RESC 098 or a crosslisted equivalent. Seniors by permission only."}, {"courseNum": "HUMN 150", "courseName": "Enlightenments", "info": "An interdisciplinary study of selected works in art, music, literature, science and philosophy from European Renaissance through the early 20th century. Crosslisted as ENGL 150."}, {"courseNum": "HUMN 260", "courseName": "Intro to Translation Studies", "info": "An introduction to the history, theories, and development of the field of Translation Studies. Facility in one language other than English is strongly recommended. Crosslisted as EAST 205."}, {"courseNum": "HUMN 270", "courseName": "Data Visualization for DH", "info": "An introduction to the techniques and issues of interdisciplinary and comparative study, using both theoretical study and concrete examples. Prerequisite: permission of the instructor."}, {"courseNum": "HUMN 305", "courseName": "Utopias: Past, Present, Future", "info": ""}, {"courseNum": "HUMN 330", "courseName": "Studies in Autobiography", "info": "A critical, cross-cultural and transhistorical examination of the \"writing of the self\". Readings from Augustine, Descartes, Nietzsche, Derrida, among others."}, {"courseNum": "HUMN 351", "courseName": "Honors Tutorial/Senior Thesis", "info": "Independent study and research leading to the writing of a thesis as approved by the Honors Council."}, {"courseNum": "IREL 200", "courseName": "International Relations Topics", "info": "Selected topics in international relations. Prerequisite: POLS 170."}, {"courseNum": "IREL 204", "courseName": "Naming Violence", "info": ""}, {"courseNum": "IREL 214", "courseName": "Sex, Lies and Capitalism", "info": ""}, {"courseNum": "IREL 218", "courseName": "Internatl Relations of Europe", "info": "This course will examine the foreign policies of European countries, individually and collectively through the European Union, toward each other, regional and global intergovernmental organizations, and other regions/countries"}, {"courseNum": "IREL 226", "courseName": "East Asian Politics", "info": "This course surveys history, politics, economy, and society of countries in East Asia. It investigates the continuity and change in politics and policies of China, Japan, Korea, and selected countries in Southeast Asia."}, {"courseNum": "IREL 250", "courseName": "Theories of Intrnl Relations", "info": "Analysis and evaluation of main theories of international relations, including realist, neo-realist, liberal, neo-liberal, Gramscian, Marxist, feminist, and post-modernist approaches. Theories are related to the major dimensions of international relations."}, {"courseNum": "IREL 252", "courseName": "Pol Economy of Global Resource", "info": "A study of environmental and energy economics in the context of global resources and politics.  The theme of sustainable development will be linked to the new realities of international relations. Prerequisite: ECON 103. Crosslisted as UNIV 252."}, {"courseNum": "IREL 274", "courseName": "Africa International Relations", "info": ""}, {"courseNum": "IREL 275", "courseName": "Global Governance", "info": "This course explores the rationales, processes, and institutions of multilateral governance in a globalized world. We examine the U.N., nongovernmental organizations, conflict resolution, economic development, environment, human rights, and international law."}, {"courseNum": "IREL 350", "courseName": "Globalization", "info": "This course is designed to provide IREL majors with an opportunity to study global change. The course addresses contemporary issues in globalization. Specific topics may vary. Normally taken in Fall of junior or senior year for those studying abroad. Prerequisites: IREL majors, Students should preferably have both ECON 227 and IREL 250."}, {"courseNum": "IREL 418", "courseName": "Social Movements and Society", "info": "This seminar examines social movements in International Relations in multiple contexts across the globe, through a variety of scales."}, {"courseNum": "IREL 482", "courseName": "U.S.-China Relations", "info": "Through tracing the evolution of U.S.-China relations from the 19th century to the 21st century, this course discusses major issues and challenges between the two countries today. Future trends of the bilateral relationship will also be explored. Prerequisite: POLS 170. Preference given to EAST, IREL, and POLS seniors. May be crosslisted as EAST 382 and/or POLS 382. Not open to students who have taken EAST 380 or IREL 380 or IREL 382."}, {"courseNum": "ITAL 101", "courseName": "Elementary Italian I", "info": "Beginning language skills, practice listening, speaking, reading, and writing; elementary grammar; and introduction to Italian culture."}, {"courseNum": "ITAL 102", "courseName": "Elementary Italian II", "info": "Continuation of language skills. Practice in listening, speaking, reading and writing. Introduction to Italian culture."}, {"courseNum": "ITAL 103", "courseName": "Intermediate Italian I", "info": "Review and expansion of language skills and cultural knowledge of Italy."}, {"courseNum": "ITAL 104", "courseName": "Intermediate Italian II", "info": "Continuing review of grammar emphasizing all four skills. Focus on civilization."}, {"courseNum": "ITAL 202", "courseName": "Intrmd Italian Conversation II", "info": "Concentration on development of speaking skills. Conducted in Italian by native speaker."}, {"courseNum": "ITAL 206", "courseName": "Exploring Italian Studies", "info": ""}, {"courseNum": "ITAL 385", "courseName": "Corsets and Curses", "info": "This course aims at exploring the contributions of Italian women writers, musicians and filmmakers to Italian culture in different cities. It will take into account different time periods and will relate them to give a complete picture of Italian feminist thought. Prerequisite: ITAL 104."}, {"courseNum": "JAPN 102", "courseName": "Japanese I", "info": "Beginning language skills.  Training in speaking and comprehending the basic sentence patterns of modern Japanese.  Introduction to reading and writing."}, {"courseNum": "JAPN 104", "courseName": "Japanese II", "info": "Continued training in the four language skills.  Review of basic and introduction to complex sentence patterns. Reading of texts in basic Japanese."}, {"courseNum": "JAPN 202", "courseName": "Japanese III", "info": "Application of the four language skills.  Reading of texts written in standard Japanese and exercises in content- controlled conversation."}, {"courseNum": "LAMS 150", "courseName": "Latin America: An Introduction", "info": "Introduction to the history, cultures, and societies of Latin America."}, {"courseNum": "LAMS 155", "courseName": "Blacks in Latin America", "info": ""}, {"courseNum": "LAMS 250", "courseName": "Latin Amer.: Challenges 21st C", "info": "Perspectives on the challenges facing Latin American peoples and nations in the 21st Century."}, {"courseNum": "LAMS 288", "courseName": "Global Cuisines Local Contexts", "info": ""}, {"courseNum": "LAMS 292", "courseName": "Service-Learning in Nicaragua", "info": "This course focuses on the connections between Nicaraguan development processes and Brigade-based service-learning. Crosslisted as IREL 292 and GEOG 292."}, {"courseNum": "LATN 102", "courseName": "Introductory Latin", "info": "Continuing study of Latin grammar with review of basic material, including the introduction to Latin reading."}, {"courseNum": "LATN 221", "courseName": "Studies in Latin Literature", "info": "Advanced readings in Latin authors. Authors vary by semester; prose and poetry offered in alternate semesters. May be repeated as topic varies."}, {"courseNum": "LING 110", "courseName": "Ling Analysis:Sentence/Dialect", "info": "One semester of a two-semester introduction to linguistics. Topics include: syntax, semantics, language variation, language and society."}, {"courseNum": "LING 205", "courseName": "Phonetics and Phonology", "info": "An investigation into the articulatory and acoustic properties and patterns of speech sounds, with applications to speech pathology, processing, and phonological theory."}, {"courseNum": "LING 210", "courseName": "Language and Race", "info": "An introduction to \"non-standard\" dialects of English with a primary focus on African American Vernacular English (AAVE or Ebonics). This course explores the linguistic and non-linguistic factors that give rise to language variation."}, {"courseNum": "LING 230", "courseName": "Psycholinguistics", "info": "Analysis of psychological processes involved in language. Topics include language production and perception in children, adults, bilinguals, and exceptional populations."}, {"courseNum": "LING 315", "courseName": "Advanced Syntax", "info": "Topics in advanced generative syntax, emphasis on new developments in syntactic theory."}, {"courseNum": "LING 319", "courseName": "Undergraduate Research", "info": "Research in psycholinguistics. Research topics may be posed by students or faculty. Prerequisite: LING 230 and permission of the instructor."}, {"courseNum": "MATH 112", "courseName": "Intro to Mathematical Modeling", "info": "Introduction for the non-specialist to mathematical modeling of real-world phenomena such as voting and networks, using graph theory, probability, and other accessible tools."}, {"courseNum": "MATH 117", "courseName": "Intro to Mathematical Thought", "info": "An investigation of number, numeration, and operations from the perspective of elementary school teachers and pupils. Open only to B.S. in Education Early Childhood Pre-K to 4 students. Required fieldwork."}, {"courseNum": "MATH 192", "courseName": "Topics in Calculus", "info": "Elementary calculus and applications taken primarily from economics.  Topics include algebraic, exponential, and logarithmic functions, graphs, limits, derivatives and integration."}, {"courseNum": "MATH 201", "courseName": "Calculus I", "info": "An introduction to the calculus of algebraic, trigonometric and transcendental functions. Interpretation, significance and calculations of a derivative. Applications to geometry, biology, physics, economics, and other subjects. Introduction to the definite integral, including the Fundamental Theorem of Calculus."}, {"courseNum": "MATH 202", "courseName": "Calculus II", "info": "Methods of integration including substitution, integration by parts, numerical approximations, and improper integrals. Series, including Taylor series. Complex numbers, polar coordinates, differential equations, and applications."}, {"courseNum": "MATH 211", "courseName": "Calculus III", "info": "Calculus of vector-valued functions and functions of several variables. Multiple, line, and surface integrals; applications, and extrema. Green's, Stokes' and Divergence Theorems. Prerequisite: MATH 202."}, {"courseNum": "MATH 212", "courseName": "Differential Equations", "info": "Basic methods of solving ordinary differential equations. Systems of linear differential equations, Laplace transform, applications and selected topics. Not open to students who have taken MATH 222."}, {"courseNum": "MATH 216", "courseName": "Statistics I", "info": "Exploratory data analysis, sampling distributions, regression, sampling designs, confidence intervals, hypothesis testing, ANOVA. Statistical software is used and applications, including projects, are undertaken."}, {"courseNum": "MATH 219", "courseName": "Topics in Applied Mathematics", "info": ""}, {"courseNum": "MATH 222", "courseName": "Differential Equation for Engr", "info": "First order differential equations, second order linear equations, higher order linear equations, numerical approximations. Not open to students who have taken MATH 212."}, {"courseNum": "MATH 240", "courseName": "Combinatorics & Graph Theory", "info": "Counting techniques and traversal problems. Does not count toward the major. Students join MATH 241 mid-semester. Corequisite: MATH 280. Only for students seeking secondary certification."}, {"courseNum": "MATH 241", "courseName": "Discrete Structures", "info": "Logic, sets; mathematical induction; relations, functions; combinatorics and graph theory. Does not count toward the mathematics major. Prerequisite: MATH 202."}, {"courseNum": "MATH 245", "courseName": "Linear Algebra", "info": "Linear equations, matrices, vector spaces, linear transformations, determinants, eigenvalues. Prerequisite: MATH 202. Not open to students who have taken MATH 213."}, {"courseNum": "MATH 280", "courseName": "Logic, Sets, and Proofs", "info": "Logic, sets; proof techniques; relations, functions, sequences and convergence; cardinality. Skills and tools for independent reading, problem solving and exploration. Prerequisite: MATH 211 or MATH 245."}, {"courseNum": "MATH 303", "courseName": "Probability", "info": "Elementary probability, random variables, moments, central limit theorem, conditional expectation, statistical distributions derived from the normal distribution. Probability simulations and applications from various fields."}, {"courseNum": "MATH 304", "courseName": "Statistical Inference Theory", "info": "Point and interval estimation, hypothesis testing, Fisher's likelihood theory, frequentist versus Bayesian approach, computational statistics."}, {"courseNum": "MATH 308", "courseName": "Real Analysis I", "info": "Real numbers and elementary topology of Cartesian spaces, convergence, continuity, differentiation, and history of the development of analysis. Prerequisites: MATH 211, MATH 245, and MATH 280."}, {"courseNum": "MATH 320", "courseName": "Abstract Algebra I", "info": "Groups and rings; homomorphisms and isomorphism theorems; history of the development of algebra. Additional selected topics. Prerequisites: MATH 245 and MATH 280."}, {"courseNum": "MATH 350", "courseName": "Methods in Applied Mathematics", "info": "Techniques drawn from partial differential equations, transform methods, Fourier and complex analysis, and variational calculus."}, {"courseNum": "MATH 358", "courseName": "Topics in Operations Research", "info": "Mathematical and statistical techniques in operations research. Queuing theory. Additional topics may include simulation, forecasting, non-linear programming, inventory models. Methods and applications drawn from various fields."}, {"courseNum": "MATH 362", "courseName": "Complex Analysis", "info": "Limits, analytic functions, integrals including contour integrals. Cauchy's Integral Theorem, entire functions and singularities."}, {"courseNum": "MATH 407", "courseName": "Stat Design Scientific Studies", "info": ""}, {"courseNum": "MATH 446", "courseName": "Abstract Algebra II", "info": "Advanced topics in group theory including solvable groups, field theory and Galois theory. Prerequisite: MATH 320."}, {"courseNum": "MATH 604", "courseName": "Statistical Inference Theory", "info": "Continuation of MATH 303/603. The two courses together constitute an introduction to mathematical statistics. Point and interval estimation, hypothesis testing, theory of least squares and its relation to the design and analysis of experiments. Prerequisite: MATH 303/603."}, {"courseNum": "MATH 607", "courseName": "Stat Design Scientific Studies", "info": "Sampling, design of experiments and observational studies. Includes completely randomized block, factorial, and nested designs. Simple random stratified, systematic and cluster sampling. Estimation procedures and sample size calculations."}, {"courseNum": "MATH 646", "courseName": "Abstract Algebra II", "info": "Advanced topics in group theory including solvable groups, field theory and Galois theory."}, {"courseNum": "MATH 650", "courseName": "Methods in Applied Mathematics", "info": "Techniques drawn from partial differential equations, transform methods, Fourier and complex analysis, and variational calculus."}, {"courseNum": "MATH 658", "courseName": "Topics in Operations Research", "info": "Mathematical and statistical techniques in operations research. Queuing theory. Additional topics may include simulation, forecasting, non-linear programming, inventory models. Methods and applications drawn from various fields. Prerequisite: some knowledge of probability theory."}, {"courseNum": "MECH 202", "courseName": "Graphic for Design/Manufacture", "info": "Graphical representation techniques for visualization and communication of mechanical engineering designs and concepts. Creation, storage, and manipulation of production drawings and 3-D geometric representations using state-of- the-art software."}, {"courseNum": "MECH 216", "courseName": "Thermodynamics II", "info": "A continuation of MECH 213 with a focus on applications of thermodynamic principles including an extension of power and refrigeration cycles, psychometrics, reacting mixtures and combustion, and other selected topics. Prerequisites: MATH 211, MECH 213, MECH 222, or the permission of the department."}, {"courseNum": "MECH 220", "courseName": "Mechanics", "info": "Equilibrium of two- and three-dimensional force systems. Trusses and frames. Friction. Distributed force systems. Internal loads. One degree of freedom vibrations. Prerequisite: MATH 201 or MATH 205.  Not open to students who have taken ENGR 220 or ENGR 221."}, {"courseNum": "MECH 285", "courseName": "Independent Study for Soph.", "info": "Independent investigation under the direction of a faculty member for students who have completed their first year. Prerequisites: sophomore standing in mechanical engineering and permission of the instructor."}, {"courseNum": "MECH 302", "courseName": "Finite Element-Analysis/Design", "info": "Introduction to finite element method (FEM) and commercial FEM software for design and analysis of mechanical components. Applications in mechanical and thermal component/system design."}, {"courseNum": "MECH 312", "courseName": "Heat Transfer", "info": "Principles and engineering applications of heat transfer by conduction, convection, and radiation."}, {"courseNum": "MECH 353", "courseName": "Solid Mechanics", "info": "Analysis of the stress, strain, and failure of engineering components under axial, bending, and torsional loading conditions. Provide a bridge to more advanced material in the theory of elasticity and computational solid mechanics. Prerequisites: MECH 220 and concurrent prerequisite MATH 212 or permission of the department. Not open to students who have taken ENGR 208."}, {"courseNum": "MECH 385", "courseName": "Independent Study for Juniors", "info": "Independent investigation under the direction of a faculty member for students who have completed two years of study. junior standing in mechanical engineering and permission of the instructor."}, {"courseNum": "MECH 392", "courseName": "Mechanical Design", "info": "Principles and techniques for creative design of machines in relation to specifications and user requirements. Design using a solid modeling CAD package."}, {"courseNum": "MECH 402C", "courseName": "Common Hour-Senior Design II", "info": ""}, {"courseNum": "MECH 435", "courseName": "Aerodynamics", "info": "Two dimensional flow theory; vortex and momentum theories of finite wings; viscous flows, boundary layers and drag; high lift devices. Prerequisites: MECH 313 or equivalent and permission of the instructor."}, {"courseNum": "MECH 451", "courseName": "Vibration Analysis", "info": "Damped and undamped vibrations in free and forced systems. Resonance conditions. Vibration measuring equipment. Multi-degree of freedom discrete systems. Continuous systems."}, {"courseNum": "MECH 457", "courseName": "Accident Analysis", "info": "Vehicle crash dynamics and crashworthiness. Non motor- vehicle accidents. Mechanics of injuries. Evaluation of designs intended to reduce risk of injury. Prerequisite: permission of the instructor."}, {"courseNum": "MECH 471", "courseName": "Nonlinear Solid Mechanics", "info": ""}, {"courseNum": "MECH 485", "courseName": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course."}, {"courseNum": "MECH 635", "courseName": "Aerodynamics", "info": "Two dimensional flow theory; vortex and momentum theories of finite wings; viscous flows, boundary layers and drag, high lift devices."}, {"courseNum": "MECH 651", "courseName": "Vibration Analysis", "info": "Damped and undamped vibrations in free and forced systems. Resonance conditions. Vibration measuring equipment. Multi-degree of freedom discrete systems. Continuous systems. Prerequisite: permission of the instructor."}, {"courseNum": "MECH 657", "courseName": "Accident Analysis", "info": "Vehicle crash dynamics and crashworthiness. Non motor- vehicle accidents. Mechanics of injuries. Evaluation of designs intended to reduce risk of injury. Prerequisite: Permission of the instructor."}, {"courseNum": "MECH 671", "courseName": "Nonlinear Solid Mechanics", "info": ""}, {"courseNum": "MECH 685", "courseName": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course."}, {"courseNum": "MECH 699", "courseName": "Graduate Thesis", "info": "A professional-level investigation under the direction of a staff member. Prerequisite: permission of the instructor."}, {"courseNum": "MGMT 101", "courseName": "Intro to Organizatn/Management", "info": "Students apply management theory and concepts to creating and managing multi-project organizations.  Not open to first semester first-year students."}, {"courseNum": "MGMT 102", "courseName": "Quant Reasoning for Managers", "info": "This course serves as a student's introduction to quantitative modeling and basic statistical analysis, especially as they apply to managerial decision making."}, {"courseNum": "MGMT 200", "courseName": "Foundations Acct & Fin Mgmt I", "info": "Introduction to accounting and financial management including financial statement preparation and analysis, financial forecasting, cost relationships, time value of money and capital budgeting."}, {"courseNum": "MGMT 201", "courseName": "Marketing", "info": "Introduction to principles of marketing.  Examines how organizations facilitate exchange relationships by customers' needs and wants.  Explores the intricacies of identifying and establishing market positions and understanding consumer behavior.  Prerequisite: MGMT 101 or permission of the instructor."}, {"courseNum": "MGMT 203", "courseName": "Managerial Finance", "info": "Financial analysis, forecasting, and valuation of projects and companies incorporating risk-return tradeoffs and capital structure and dividend decisions.  Employs 10-K research and presentations.  Prerequisite: MGMT 200."}, {"courseNum": "MGMT 302", "courseName": "The Stakeholder Organization", "info": "Students explore the moral challenges associated with complex organizational decisions in a variety of contexts.  Prerequisite: MGMT 101. Juniors and seniors only."}, {"courseNum": "MGMT 303", "courseName": "The Technological Organization", "info": "Organizations solve a variety of problems by deploying information systems.  This course explores a range of technological impacts on organizations from their behavior to survival."}, {"courseNum": "MGMT 304", "courseName": "The Strategic Organization", "info": "Students learn strategic concepts and explore the challenges of formulation and implementing organizational strategies. Prerequisites: MGMT 101 or permission of the instructor. Seniors only."}, {"courseNum": "MGMT 310", "courseName": "Independent Study in MGMT", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "MGMT 315", "courseName": "Special Topics in Management", "info": "A seminar on selected topics in management. Prerequisite: permission of the instructor."}, {"courseNum": "MIDE 300", "courseName": "Markets, Innovation & Design", "info": "A survey of the relationships among marketing, innovation, and design. Students will practice various approaches to creative and innovation thinking. Prerequisite: MGMT 201 or permission of the instructor."}, {"courseNum": "MIDE 301", "courseName": "Understanding Consumers", "info": "A toolbox of qualitative and quantitative research methods for understanding consumer behavior with appropriate exposure to philosophical and theoretical underpinnings of various approaches. Prerequisite: MGMT 201 or permission of instructor."}, {"courseNum": "MIDE 304", "courseName": "Marketing Management", "info": "Students have the opportunity to become familiar with the field of marketing and practice decision making within the context of the marketing environment. Prerequisite: MGMT 201 or MGMT 380 or permission of the instructor."}, {"courseNum": "MIDE 315", "courseName": "Special Topics in MIDE", "info": "A seminar on selected topics in marketing, innovation, and design. Prerequisites: MGMT 201 and permission of the instructor."}, {"courseNum": "MILS 102", "courseName": "Basic Leadership", "info": "Further studies focusing on developing comprehension of Army leadership dimensions, attributes and core leader competencies within the U.S. Army, and the Army's role in American society and government."}, {"courseNum": "MILS 202", "courseName": "Leadership and Teamwork", "info": "Further studies the theoretical basis of Army leadership requirements model by exploring the dynamics of adaptive leadership in the context of military operations."}, {"courseNum": "MILS 302", "courseName": "Leadership Under Fire", "info": "Further studies in developing critical thinking skills through practical application of the fundamentals of Army leadership at the lowest organizational levels in the United States Army."}, {"courseNum": "MILS 402", "courseName": "Leadership in a Complex World", "info": "Explores the dynamics of leading soldiers in full spectrum operations in the contemporary operating environment. Course prepares them for their future role as an Army officer."}, {"courseNum": "MSUS 200", "courseName": "Managing for Sustainability I", "info": ""}, {"courseNum": "MSUS 301", "courseName": "Managing for Sustainability II", "info": "Advanced topic in sustainability, including triple-bottom line performance management and integrating other sustainability themes.  Prerequisites: MSUS 300 and MGMT 200. Juniors and seniors only."}, {"courseNum": "MSUS 330", "courseName": "Sustainable Human Res Mgmt", "info": "Focus is on how human resource management practices can contribute to organizations' economic sustainability while simultaneously enriching lives of employees and their communities.  Prerequisite: MGMT 101 or permission of the instructor."}, {"courseNum": "MSUS 400", "courseName": "Sustainability Action Learn.", "info": "In groups, students manage significant projects that further key sustainability goals and involve multiple stakeholder groups.  Prerequisites: MSUS 300, MSUS 301 or instructor permission. Seniors only."}, {"courseNum": "MUSC 122", "courseName": "Introduction to Music", "info": "An examination of various types of music in cultural and historical context; topics range from classical to jazz and the avant-garde. Not open to music majors."}, {"courseNum": "MUSC 152", "courseName": "Functional Keyboard", "info": "A requirement for all, and open only to Bachelor of Music majors. Functional keyboard skills including harmonization, transposition, and improvisation. Students will register for the course each semester until it is completed successfully. Failure to complete the requirement will prevent a student from continuing in the degree program."}, {"courseNum": "MUSC 170", "courseName": "Piano Lessons", "info": "Piano lessons."}, {"courseNum": "MUSC 171", "courseName": "Organ", "info": "Organ lessons."}, {"courseNum": "MUSC 172", "courseName": "Voice", "info": "Voice lessons."}, {"courseNum": "MUSC 174", "courseName": "Violin", "info": "Violin lessons."}, {"courseNum": "MUSC 175", "courseName": "Viola", "info": "Viola lessons."}, {"courseNum": "MUSC 176", "courseName": "Violoncello", "info": "Violoncello lessons."}, {"courseNum": "MUSC 178", "courseName": "String Bass", "info": "String bass lessons."}, {"courseNum": "MUSC 179", "courseName": "Flute", "info": "Flute lessons."}, {"courseNum": "MUSC 181", "courseName": "Clarinet", "info": "Clarinet lessons."}, {"courseNum": "MUSC 183", "courseName": "Oboe", "info": "Oboe lessons."}, {"courseNum": "MUSC 185", "courseName": "Bassoon", "info": "Bassoon lessons."}, {"courseNum": "MUSC 187", "courseName": "Saxophone", "info": "Saxophone lessons."}, {"courseNum": "MUSC 188", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 189", "courseName": "Trumpet", "info": "Cornet/trumpet lessons."}, {"courseNum": "MUSC 191", "courseName": "French Horn", "info": "French horn lessons."}, {"courseNum": "MUSC 192", "courseName": "Trombone", "info": "Trombone lessons."}, {"courseNum": "MUSC 193", "courseName": "Tuba", "info": "Tuba lessons."}, {"courseNum": "MUSC 194", "courseName": "Euphonium", "info": "Baritone horn lessons."}, {"courseNum": "MUSC 196", "courseName": "Guitar", "info": "Guitar lessons."}, {"courseNum": "MUSC 197", "courseName": "Percussion", "info": "Percussion lessons."}, {"courseNum": "MUSC 199", "courseName": "Improvisation I", "info": "Studio lessons in improvisation."}, {"courseNum": "MUSC 200", "courseName": "Diatonic Theory", "info": "The study of diatonic triads and dominant seventh chords (with inversions), labeling triads, harmonic progressions, cadences, secondary dominants, diatonic modulation, binary and ternary forms, strophic forms, rondo forms, sonata form, instruments of the orchestra (with ranges and transpositions), and how to read an orchestral score. Students lacking sufficient music theory background to begin theory sequence with MUSC 200 should enroll in MUSC 121 or pursue an individualized course of instruction on their own before enrolling in MUSC 200."}, {"courseNum": "MUSC 202", "courseName": "Advanced Theory", "info": "A thorough knowledge of major compositional techniques from approximately 1910 to the present.  Class requires advanced knowledge of the Sibelius notation program.  Prerequisite: MUSC 201."}, {"courseNum": "MUSC 213", "courseName": "Women in Music", "info": ""}, {"courseNum": "MUSC 253", "courseName": "Beethoven to Virtual Music", "info": "A survey of western European art music from the early nineteenth century to the present. When possible, MUSC 252 should be taken before enrolling in MUSC 253."}, {"courseNum": "MUSC 257", "courseName": "Jazz, Rock, and Race", "info": "A thorough examination of historically important musicians and movements within the context of race and culture."}, {"courseNum": "MUSC 258", "courseName": "Music in American Life", "info": "An examination of music and identity formation among various cultural and religious groups in selected periods of United States history."}, {"courseNum": "MUSC 260", "courseName": "Ensemble", "info": "Students that are not music majors may receive one-quarter credit for participation in each ensemble, with a maximum of one-half credit per semester and a limit of two full course credits in all. Note that music majors audit ensembles rather than take them for credit because the credits do not count toward fulfilling the minimum degree requirements. All ensembles require an audition or permission of the instructor for first-time members. Section 01-Symphonic Band 02-Orchestra, 03-Chorale, 04-Chapel Choir, 05-Opera Company, 06- Handbell Choir, 07-Jazz Band."}, {"courseNum": "MUSC 270", "courseName": "Piano", "info": "Piano lessons."}, {"courseNum": "MUSC 271", "courseName": "Organ", "info": "Organ lessons."}, {"courseNum": "MUSC 272", "courseName": "Voice", "info": "Voice lessons."}, {"courseNum": "MUSC 274", "courseName": "Violin", "info": "Violin lessons."}, {"courseNum": "MUSC 275", "courseName": "Viola", "info": "Viola lessons."}, {"courseNum": "MUSC 276", "courseName": "Violoncello", "info": "Violoncello lessons."}, {"courseNum": "MUSC 278", "courseName": "String Bass", "info": "String bass lessons."}, {"courseNum": "MUSC 279", "courseName": "Flute", "info": "Flute lessons."}, {"courseNum": "MUSC 281", "courseName": "Clarinet", "info": "Clarinet lessons."}, {"courseNum": "MUSC 283", "courseName": "Oboe", "info": "Oboe lessons."}, {"courseNum": "MUSC 285", "courseName": "Bassoon", "info": "Bassoon lessons."}, {"courseNum": "MUSC 287", "courseName": "Saxophone", "info": "Saxophone lessons."}, {"courseNum": "MUSC 288", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 289", "courseName": "Trumpet", "info": "Cornet/trumpet lessons."}, {"courseNum": "MUSC 291", "courseName": "French Horn", "info": "French horn lessons."}, {"courseNum": "MUSC 292", "courseName": "Trombone", "info": "Trombone lessons."}, {"courseNum": "MUSC 293", "courseName": "Tuba", "info": "Tuba lessons."}, {"courseNum": "MUSC 294", "courseName": "Euphonium", "info": "Baritone horn lessons."}, {"courseNum": "MUSC 296", "courseName": "Guitar", "info": "Guitar lessons."}, {"courseNum": "MUSC 297", "courseName": "Percussion", "info": "Percussion lessons."}, {"courseNum": "MUSC 299", "courseName": "Improvisation II", "info": "Studio lessons in improvisation."}, {"courseNum": "MUSC 322", "courseName": "Music and Social Justice", "info": ""}, {"courseNum": "MUSC 335", "courseName": "Student Teacher Seminar", "info": "This course provides student teachers in music with the opportunity to refine their teaching practices through guided reflection, discussion, reading, writing, and various other activities. Corequisite: EDUC 439. Prerequisite: MUSC 235."}, {"courseNum": "MUSC 362", "courseName": "Music Projects:Selected Topics", "info": "A W2 course designed to facilitate intensive research and writing on a music topic of the student's choice. Prerequisites: one MUSC course and topic for research project and permission of the instructor."}, {"courseNum": "MUSC 370", "courseName": "Piano", "info": "Piano lessons."}, {"courseNum": "MUSC 371", "courseName": "Organ", "info": "Organ lessons."}, {"courseNum": "MUSC 372", "courseName": "Voice", "info": "Voice lessons."}, {"courseNum": "MUSC 374", "courseName": "Violin", "info": "Violin lessons."}, {"courseNum": "MUSC 375", "courseName": "Viola", "info": "Viola lessons."}, {"courseNum": "MUSC 376", "courseName": "Violoncello", "info": "Violoncello lessons."}, {"courseNum": "MUSC 378", "courseName": "String Bass", "info": "String bass lessons."}, {"courseNum": "MUSC 379", "courseName": "Flute", "info": "Flute lessons."}, {"courseNum": "MUSC 381", "courseName": "Clarinet", "info": "Clarinet lessons."}, {"courseNum": "MUSC 383", "courseName": "Oboe", "info": "Oboe lessons."}, {"courseNum": "MUSC 385", "courseName": "Bassoon", "info": "Bassoon lessons."}, {"courseNum": "MUSC 387", "courseName": "Saxophone", "info": "Saxophone lessons."}, {"courseNum": "MUSC 388", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 389", "courseName": "Trumpet", "info": "Cornet/trumpet lessons."}, {"courseNum": "MUSC 391", "courseName": "French Horn", "info": "French horn lessons."}, {"courseNum": "MUSC 392", "courseName": "Trombone", "info": "Trombone lessons."}, {"courseNum": "MUSC 393", "courseName": "Tuba", "info": "Tuba lessons."}, {"courseNum": "MUSC 394", "courseName": "Euphonium", "info": "Baritone horn lessons."}, {"courseNum": "MUSC 396", "courseName": "Guitar", "info": "Guitar lessons."}, {"courseNum": "MUSC 397", "courseName": "Percussion", "info": "Percussion lessons."}, {"courseNum": "MUSC 399", "courseName": "Improvisation III", "info": "Studio lessons in improvisation."}, {"courseNum": "NEUR 250", "courseName": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as PSYC 250."}, {"courseNum": "NEUR 322", "courseName": "Clinical Neuroscience", "info": ""}, {"courseNum": "NEUR 348", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as PSYC 348."}, {"courseNum": "NEUR 360", "courseName": "Honors Thesis", "info": "Honors thesis"}, {"courseNum": "NEUR 399", "courseName": "Undergraduate Research", "info": "Research on any aspect of neuroscience. Research topics may be posed by students or faculty."}, {"courseNum": "NEUR 400", "courseName": "Sr. Seminar in Neuroscience", "info": "NEUR majors may elect to attend a lecture series in the spring semester to satisfy the culminating experience requirement. Students will prepare written reactions to each seminar, graded as pass/fail. Prerequisites: senior status and NEUR majors and permission of the instructor."}, {"courseNum": "PHIL 100", "courseName": "Introduction to Philosophy", "info": "Multiple sections of this course are offered every semester, under a variety of specific titles: e.g., \"Law, Morality and Society\" (ethics, socio-political philosophy and philosophy of law), \"Consciousness\" (philosophy of mind), \"Philosophy of Laughter\" (the ethics, aesthetics, and socio-political implications of comedy), \"World Philosophy\" (a comparative examination of Greek, Indian and Chinese philosophical traditions), \"Gods, Humans and Animals\" (philosophical anthropology and the ethical status of animals), and \"Philosophy and Film\" (fundamental philosophical questions regarding the nature of reality, freedom, knowledge, art and value explored through film)."}, {"courseNum": "PHIL 103", "courseName": "Logic", "info": "An introduction to informal and formal ways of reasoning. The structures and general forms of argument as well as the standards and criteria needed to evaluate arguments, and the historical development of logical reasoning, will be studied."}, {"courseNum": "PHIL 201", "courseName": "Symbolic Logic", "info": "This course will introduce the basic concepts and philosophical problems that arise in a study of 20th and 21st century symbolic logic. Careful work on the concepts and problems of modern logic will direct the course, with a concentration on the basic changes introduced to the discipline by the logical work of Frege and Russell. The course will investigate topics in propositional and quantificational logic and general logical theory (completeness, consistency, independence, rigor). It will conclude with a study of the system of Wittgenstein's Tractatus. Prerequisite: PHIL 103 or permission of the instructor."}, {"courseNum": "PHIL 207", "courseName": "History of Modern Philosophy", "info": "Philosophical thought in the classical modern age, including Continental Rationalism, British Empiricism, and Kant. Prerequisite: PHIL 100 or permission of the instructor."}, {"courseNum": "PHIL 213", "courseName": "Ethics", "info": "An attempt to formulate adequate criteria for the basic moral conceptions of good and bad, right and wrong, and duty, by a study of leading ethical view points from Plato to the present. Prerequisite: PHIL 100 or PHIL 103 or PHIL 201 or permission of the instructor."}, {"courseNum": "PHIL 215", "courseName": "Philosophy of Music", "info": "An exploration of the concepts and problems involved in a philosophical (self-reflective) investigation of music. Using two 20th century musicians (Bernstein and Cage) as a guide, questions about the being and characteristics of music will be pursued. Learning to talk and ask questions clearly about the nature of sound and silence is a goal of this course. (Philosophers such as Rousseau, Schopenhauer, Thoreau, Camus, and Wittgenstein will provide direction for class discussions and lectures."}, {"courseNum": "PHIL 224", "courseName": "Theory of Knowledge", "info": "Addresses topics related to the nature and acquisition of knowledge, such as belief, justification, evidence, perception, testimony, and skepticism. Readings may include both classic and contemporary authors, such as Plato, Descartes, Russell, Austin, Davidson, Goldman, McDowell, and Sosa. Prerequisite: PHIL 100 or permission of the instructor."}, {"courseNum": "PHIL 229", "courseName": "Philosophy and Race", "info": ""}, {"courseNum": "PHIL 246", "courseName": "Philosophy of Law", "info": "Examination of some central philosophical issues relating to law, including law's relation to economics, literature, democracy, rules, integrity, and interpretation. Prerequisite: PHIL 100 or PHIL 103 or PHIL 201 or permission of the instructor."}, {"courseNum": "PHIL 256", "courseName": "From Hegel to Nietzsche", "info": "The rise, fall, and reaction to German Idealism in 19th-century continental thought. Philosophers to be studied may include: Hegel, Schopenhauer, Marx, Kierkegaard, and Nietzsche. Prerequisite: PHIL 100 or permission of the instructor."}, {"courseNum": "PHIL 268", "courseName": "Topics in Metaphysics", "info": "Focused study of a specific topic in metaphysics, such as space and/or time, substance, possible worlds, the mind-body problem, truth, and abstract objects (propositions, universals, values, numbers, etc.). Prerequisite: PHIL 100 or permission of the instructor."}, {"courseNum": "PHIL 309", "courseName": "Seminar in Historical Studies", "info": "Intensive study of the works of a single philosopher chosen from the ancient, medieval, modern, or contemporary period of the history of philosophy. In recent years: Plato, Aristotle, Descartes, Kant, Nietzsche, Heidegger, Wittgenstein. Prerequisites: two courses in philosophy and permission of the instructor."}, {"courseNum": "PHIL 320", "courseName": "Individual Studies-Philosophy", "info": "Open to advanced students who wish to pursue individual programs of study under the supervision of a professor, or of a committee of professors if the subject falls within two or more departments. May be conducted as a seminar for three or more students pursuing similar programs. Subjects may be chosen from any field of philosophy in consultation with the members of the department of philosophy."}, {"courseNum": "PHIL 321", "courseName": "Honors Thesis", "info": "Substantial independent work on some problem or topic approved by the department of philosophy as honors work."}, {"courseNum": "PHIL 322", "courseName": "Honors Thesis", "info": "Substantial independent work on some problem or topic approved by the department of philosophy as honors work."}, {"courseNum": "PHIL 323", "courseName": "Senior Thesis", "info": "Independent research on a philosophical issue, in consultation with staff members. The thesis should show integrative and creative abilities. Prerequisite: major in philosophy."}, {"courseNum": "PHYS 140", "courseName": "Physics for Future Leaders", "info": ""}, {"courseNum": "PHYS 141", "courseName": "Secrets of the Universe", "info": "The great ideas of 20th-century physics (symmetry principles, relativity, and quantum mechanics) and their application to cosmology and the evolution of the universe. Also, historical development and philosophical implications of these ideas."}, {"courseNum": "PHYS 212", "courseName": "Classical and Modern PhysicsII", "info": "Newtonian mechanics, relativity, waves, thermodynamics, quantum mechanics, electricity and magnetism, and special topics in modern physics. PHYS 211 or permission of the instructor is prerequisite to PHYS 212. Corequisite: MATH 201 for PHYS 211; MATH 202 or another mathematics course numbered above 202 for PHYS 212."}, {"courseNum": "PHYS 222", "courseName": "Wave Mechanics & Quantum Phys", "info": "Physics of coupled oscillations and waves, including classical wave equation. Wave-particle duality; origin and elementary applications of quantum mechanics; the Schroedinger wave equation; atomic and nuclear physics."}, {"courseNum": "PHYS 235", "courseName": "Applied Electronics", "info": "Circuit fundamentals, linear and digital integrated circuits, transducers, analog to digital conversion, filtering, Fourier methods, microcomputers, and computer interfacing. Designed for science and computer science majors. Not open to electrical engineering majors without permission."}, {"courseNum": "PHYS 301", "courseName": "Astrophysics", "info": "An introduction to general astrophysics covering mechanics of orbiting bodies, radiation laws, stellar spectra, stellar atmospheres, the internal constitution of stars, stellar energy, galaxies, and cosmology. Crosslisted as ASTR 301."}, {"courseNum": "PHYS 310", "courseName": "Experimental Physics", "info": "Methods and techniques used in experimental and computational physics, including data analysis and numerical methods, use of standard research equipment, and documentation of laboratory work emphasizing written and oral communication of scientific results. Experiments include topics in astrophysics, atomic and nuclear physics, nonlinear dynamics, optics, and phase transitions."}, {"courseNum": "PHYS 334", "courseName": "Electromagnetic Theory II", "info": "Continuation of PHYS 333. Electromagnetic waves, radiation theory, theory of relativity, and elements of plasma physics."}, {"courseNum": "PHYS 340", "courseName": "Biophysics", "info": ""}, {"courseNum": "PHYS 350", "courseName": "Undergraduate Research", "info": "Undergraduate research."}, {"courseNum": "POLS 140", "courseName": "American Politics", "info": "A critical examination of the principles, structures, and processes that shape American politics. An emphasis on political behavior and institutions with applications to contemporary political issues."}, {"courseNum": "POLS 170", "courseName": "International Politics", "info": "Introduction to major dynamics of international politics; the international system, decision making, perceptions, cooperation, conflict, and policy instruments, such as diplomacy and war. Analysis is linked to specific international events and issues."}, {"courseNum": "POLS 205", "courseName": "Comparative Politics", "info": "Politics and policy outside the United States; concepts for the comparison of political systems. Democracy, Third World politics, revolution, political stability and change, international effects on political processes."}, {"courseNum": "POLS 210", "courseName": "Political Theory", "info": "Examination of the moral dimensions of politics. Authors include Plato, Aristotle, Milton, Hobbes, Locke, Rousseau, and Marx. Major concepts include justice, freedom, rights, and authority."}, {"courseNum": "POLS 223", "courseName": "European Politics", "info": "Comparative analysis of institutions and policy-making in European political systems, including the European Union."}, {"courseNum": "POLS 226", "courseName": "East Asian Politics", "info": "This course surveys political history, political institutions, economy, and society of major countries in East Asia, with focus on the continuity and changes in politics and policies of China, Japan, and Korea."}, {"courseNum": "POLS 231", "courseName": "American Public Policy", "info": "Course introduces students to theories of the policy-making process in America, and also provides an overview of the major policy areas in American politics."}, {"courseNum": "POLS 238", "courseName": "Women and Politics", "info": "An analysis of women and politics generally with specific focus on feminism and its relationship to political discourse and political action. Crosslisted as POLS 229 and WMST 238."}, {"courseNum": "POLS 247", "courseName": "Religion & Constitutional Law", "info": "This course explores the developing relationship between religion and American constitutional law, focusing on historic documents and Supreme Court decisions relating to the First Amendment."}, {"courseNum": "POLS 258", "courseName": "States of Nature", "info": "Study of the conceptual connections between understandings of nature, society, and the good in historical and contemporary contexts."}, {"courseNum": "POLS 259", "courseName": "Philosophy of Race", "info": ""}, {"courseNum": "POLS 275", "courseName": "Global Governance", "info": "This course explores the rationales, processes, and institutions of multilateral governance in a globalized world. We examine the U.N. nongovernmental organizations, conflict resolution, economic development, environment, human rights, and international law."}, {"courseNum": "POLS 281", "courseName": "Peace Studies: Conflict Res.", "info": "This course provides an introduction to the field of peace studies. A number of topics are examined including pacifism, conflict resolution techniques and approaches, and finally actual case studies to illustrate peacemaking in two contexts: interstate wars and internal or civil strife."}, {"courseNum": "POLS 284", "courseName": "Intl Relations of Europe", "info": "This course will examine the foreign policies of European countries, individually and collectively through the European Union, toward each other, regional and global intergovernmental organizations and other regions/countries."}, {"courseNum": "POLS 290", "courseName": "Topics in Politics", "info": "Attention will focus on specific thinkers, problems, concepts, or issues of recurring and continuing significance in political analysis. Topics will vary."}, {"courseNum": "POLS 296", "courseName": "Quantitative Methods", "info": ""}, {"courseNum": "POLS 351", "courseName": "Social Policies in Rich Democs", "info": "Application of comparative analysis to social policies and policymaking in established democracies, on such issues as income supports, health care, education, reproductive rights, etc. Prerequisite: successful completion of POLS 205."}, {"courseNum": "POLS 352", "courseName": "Politics of Econ. Development", "info": "This course critically engages the tools, concepts, and theories that are used to examine the politics of economic development in poorer countries. Prerequisite: POLS 205 or permission of the instructor."}, {"courseNum": "POLS 382", "courseName": "U.S.-China Relations", "info": "Through tracing the evolution of U.S.-China relations from the 19th century to the 21st century, this course discusses major issues and challenges between the two countries today. Future trends of the bilateral relationship will also be explored. Prerequisite: POLS 170. Preference given to POLS, IREL and EAST seniors. May be crosslisted as EAST 382 and/or IREL 482. Not open to students who have taken EAST 380, IREL 380 or IREL 382."}, {"courseNum": "POLS 397", "courseName": "Honor Thesis", "info": "Independent research on some topic approved as honors work by the department and Honors Council."}, {"courseNum": "PSYC 100", "courseName": "Introduction to Psychology", "info": "A survey of concepts, principles, and theories of an empirical science of behavior."}, {"courseNum": "PSYC 203", "courseName": "Learning", "info": "The study of basic mechanisms of associative learning in motivated behavior, especially Pavlovian and operant conditioning in the behaviors of various species."}, {"courseNum": "PSYC 204", "courseName": "Human Cognition", "info": "A survey of the theories and methods employed in studying human mental abilities. Issues include attention, memory, language, problem solving, and decision making."}, {"courseNum": "PSYC 207", "courseName": "Developmental Psychology", "info": "Study of stages, sequences, and processes in normal child development, prenatal through childhood. Emphasis on interaction of nature and nurture in cognitive, social, emotional development. Prerequisite: PSYC 100, EDUC 201 is accepted as an alternate prerequisite for students who are Education Bachelor of Science majors, or permission of the instructor."}, {"courseNum": "PSYC 209", "courseName": "Social Psychology", "info": "Theories of social influence and social interaction, their empirical foundations and implications for the individual and society."}, {"courseNum": "PSYC 212", "courseName": "Emotion", "info": "An introduction to theory and research in the psychology of emotion."}, {"courseNum": "PSYC 213", "courseName": "Abnormal & Clinical Psychology", "info": "A critical introduction to psychological disorders, theories of their causes, and approaches to their treatments. Includes an observational practicum in a psychiatric facility. Prerequisite: PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 215", "courseName": "Psychological Statistics", "info": "An introduction to basic statistical analyses in psychology."}, {"courseNum": "PSYC 216", "courseName": "Research Methods in Psychology", "info": ""}, {"courseNum": "PSYC 229", "courseName": "Directed Study", "info": ""}, {"courseNum": "PSYC 236", "courseName": "Drugs and Behavior", "info": "How drugs of abuse work in the brain and how they affect behavior. Theories of addiction and addiction treatment, and issues of how drug use impacts individuals, families, and societies will be discussed. Prerequisite: PSYC 100."}, {"courseNum": "PSYC 250", "courseName": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as NEUR 250."}, {"courseNum": "PSYC 252", "courseName": "Sensation and Perception", "info": "Anatomy and functions of the sensory systems: vision, audition, kinesthesis, vestibular sensation, taste and smell, with emphasis on theory and abnormalities of the human sensory systems."}, {"courseNum": "PSYC 266", "courseName": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior, emphasizing both proximate and ultimate explanations for behavior."}, {"courseNum": "PSYC 291", "courseName": "Research Methods in Abnormal", "info": "Laboratory and/or field research to accompany PSYC 210 Abnormal Psychology."}, {"courseNum": "PSYC 292", "courseName": "Research Methods in S&P;", "info": "Laboratory and/or field research to accompany PSYC 252 Sensation and Perception."}, {"courseNum": "PSYC 293", "courseName": "Research Methods in Learning", "info": "Laboratory and/or field research to accompany PSYC 203 Learning."}, {"courseNum": "PSYC 294", "courseName": "Research Methods in Cognitive", "info": "Laboratory to accompany PSYC 204 Human Cognition."}, {"courseNum": "PSYC 296", "courseName": "Research Methods Animal Behavr", "info": "Laboratory and/or field research to accompany PSYC 266 Animal Behavior."}, {"courseNum": "PSYC 306", "courseName": "Trauma Psychology", "info": "Analysis of specific topics in the fields of psychopathology and/or clinical psychology. Prerequisite: PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 307", "courseName": "Culture and Child Development", "info": "Study of culture-specific and universal processes in child development in diverse societies. Focus on cultural influences on social, emotional, and cognitive development, and on parenting, family, and education contexts and practices. Prerequisite: PSYC 207 or permission of the instructor."}, {"courseNum": "PSYC 319", "courseName": "Topics in Psychology", "info": "Occasional seminars on selected topics of current interest in psychology."}, {"courseNum": "PSYC 322", "courseName": "Clinical Neuroscience", "info": ""}, {"courseNum": "PSYC 323", "courseName": "Meeting of the Minds", "info": ""}, {"courseNum": "PSYC 329", "courseName": "Undergraduate Research", "info": "Research or other independent study on any aspect of psychology. Research topics may be posed by students or faculty."}, {"courseNum": "PSYC 348", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as NEUR 348."}, {"courseNum": "PSYC 349", "courseName": "Cognitive Neuroscience", "info": "Brain mechanisms of language, memory, and other processes as revealed by studies of human brain activity or pathology."}, {"courseNum": "PSYC 352", "courseName": "Face Perception", "info": "Advanced seminar in face perception, including issues of holism, uniqueness, language, emotion, and race. Prerequisite: PSYC 204, PSYC 250, or PSYC 252 and permission of the instructor."}, {"courseNum": "PSYC 360", "courseName": "Honors Thesis", "info": "Honors thesis."}, {"courseNum": "PSYC 369", "courseName": "Psych of Beauty and Attraction", "info": "Examination of research on beauty and attraction from an evolutionary perspective. Prerequisites: PSYC 209, a Cluster C course and permission of the instructor."}, {"courseNum": "PSYC 375", "courseName": "Child Health Psychology", "info": ""}, {"courseNum": "PSYC 606", "courseName": "Trauma Psychology", "info": "Analysis of specific topics in the fields of psychopathology and/or clinical psychology."}, {"courseNum": "PSYC 607", "courseName": "Culture and Child Development", "info": "Study of culture-specific and universal processes in child development in diverse societies. Focus on cultural influences on social, emotional, and cognitive development, and on parenting, family, and education contexts and practices."}, {"courseNum": "PSYC 619", "courseName": "Topics in Psychology", "info": "Occasional seminars on selected topics of current interest in psychology. Prerequisite: permission of the instructor."}, {"courseNum": "PSYC 622", "courseName": "Clinical Neuroscience", "info": ""}, {"courseNum": "PSYC 648", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor."}, {"courseNum": "PSYC 649", "courseName": "Cognitive Neuroscience", "info": "Brain mechanisms of language, memory, and other processes as revealed by studies of human brain activity or pathology. Prerequisite: permission of the instructor."}, {"courseNum": "PSYC 652", "courseName": "Face Perception", "info": "Advanced seminar in face perception, including holism, uniqueness, language, emotion, and race. Prerequisite: permission of the instructor."}, {"courseNum": "PSYC 669", "courseName": "Psychology-Beauty/ Attraction", "info": "Examination of research on beauty and attraction from a evolutionary perspective."}, {"courseNum": "PSYC 675", "courseName": "Child Health Psychology", "info": ""}, {"courseNum": "PSYC 680", "courseName": "Thesis", "info": "Thesis."}, {"courseNum": "RELI 100", "courseName": "Introduction to Religion", "info": "This course will introduce students to the academic study of religion, and will examine such basic religious categories as history, myth, ritual, and text."}, {"courseNum": "RELI 200", "courseName": "Buddhism", "info": "An interdisciplinary introduction to Buddhism, including basic teachings of liberation from suffering, impermanence, no-self, ethics, and meditation. Also explores the historical development of various streams of Buddhism in Asia and the West, with attention to the mutual influence between Buddhism and society, politics, and material culture."}, {"courseNum": "RELI 202", "courseName": "Hinduism", "info": "An historical survey of the family of Hindu religious traditions. This course traces the development of Hindu scriptures, rituals, philosophies, and ethics from the ancient to the contemporary world. Concepts such as karma, yoga, and reincarnation will be put in the broader contexts of Hindu dharma (religious law), theism, and ritual."}, {"courseNum": "RELI 207", "courseName": "Holocaust: Event & Reception", "info": "During the Holocaust more than six million Jews-one third of the Jewish population of the world-were systematically killed.  We study the event, reflections by major thinkers and scholars, and the aftermath of the Holocaust."}, {"courseNum": "RELI 234", "courseName": "Issues of Religion and Culture", "info": "Focus on interdependence of religion and cultural phenomena: ideology; alienation; formation of world view; understandings of time and space; relation between church and state; faith and science."}, {"courseNum": "RELI 235", "courseName": "Religion and Popular Culture", "info": "This course examines the relationship of religion to contemporary popular culture, both in how religion is portrayed (in music, movies, sports, and consumer culture) and how it is replicated (in ritual, myth, and morality)."}, {"courseNum": "RELI 239", "courseName": "Queering Christian Thought", "info": "This course explores the relationship between queer theories, sexuality studies, and Christian theology. In addition to the concepts of gender, race and sexuality, it offers a survey of major topics in Christian thought, including God, love, justice, sin, and salvation. Crosslisted as WMST 239."}, {"courseNum": "RELI 242", "courseName": "Religious Naturalism", "info": "This course will examine some of the diverse perspectives and ideas associated with religious naturalism. Students will explore the ways religious naturalists reconceptualize traditional concepts (God or supernatural theism), and examine their various approaches to understanding evil, morality, human nature, and humans' connectivity to nature."}, {"courseNum": "RELI 246", "courseName": "Religions of Japan", "info": "An introduction to the religious traditions of Japan through study of their origins, basic beliefs, practices and values, historical development, as well as their interaction and involvement with politics, culture, society, and each other. Focus on Shinto and the various forms of Japanese Buddhism."}, {"courseNum": "RELI 252", "courseName": "The New Testament", "info": ""}, {"courseNum": "RELI 254", "courseName": "Religious Radicalism", "info": ""}, {"courseNum": "RELI 276", "courseName": "Judaism and Masculinity", "info": ""}, {"courseNum": "RELI 280", "courseName": "Religion & Constitutional Law", "info": "This course explores the developing relationship between religion and American constitutional law, focusing on historic documents and Supreme Court decisions relating to the First Amendment."}, {"courseNum": "RELI 286", "courseName": "Imagining Sustainability", "info": ""}, {"courseNum": "RELI 316", "courseName": "Topics: Religion & Culture", "info": "This course will examine the interrelation between religion and cultural phenomena in diverse contexts of human experience. Prerequisite: junior or senior status only. Open to others by permission of the instructor."}, {"courseNum": "RELI 350", "courseName": "Honors Thesis", "info": "Honors thesis."}, {"courseNum": "RELI 400", "courseName": "Sr Sem. Culminating Experience", "info": "The Senior Seminar (a one-semester topical course) is required for all majors in Religion, and is designed to give majors an opportunity to integrate the knowledge and skills they have acquired, and to hone their research, writing, and oral skills, through the production of a significant research project. Prerequisites: open to seniors in Religion only."}, {"courseNum": "RESC 221", "courseName": "Res College Sophomore Program", "info": ""}, {"courseNum": "RUSS 101A", "courseName": "Intensive Elementary Russian", "info": "Intensive elementary Russian in speaking, reading, writing, and comprehending Russian. Fundamentals of grammar and popular culture."}, {"courseNum": "RUSS 102", "courseName": "Elementary Russian II", "info": "Intensive training in speaking, reading, writing, and comprehending Russian. Fundamentals of grammar and popular culture."}, {"courseNum": "RUSS 104", "courseName": "Intermediate Russian II", "info": "Advanced points of grammar and review of grammar. Training in all language skills combined with the study of cultural texts."}, {"courseNum": "RUSS 204", "courseName": "Russian Conversation", "info": "Concentrated development of speaking skill. Conducted entirely in Russian by a native speaker. Intended for students enrolled in 200- and 300-level courses. This course cannot be taken more than twice."}, {"courseNum": "RUSS 209", "courseName": "Russian Complementary Reading", "info": "Russian sources read in conjunction with English language courses. Independent course of study established by instructor and student. Prerequisite: the equivalent of four semesters of Russian. Students may take only one half course per semester."}, {"courseNum": "RUSS 222", "courseName": "Russian Through Theater", "info": "Advanced study of Russian language, particularly phonetics and intonation patterns through reading, discussing, and performing plays. In Russian."}, {"courseNum": "RUSS 340", "courseName": "Russian Through Film &Theater;", "info": "An advanced study of Russian through watching and analyzing films and taped theatrical productions. In Russian."}, {"courseNum": "RUSS 390", "courseName": "Independent Study", "info": "Advanced independent research under the supervision of an instructor. Subject to be selected by student in consultation with the instructor."}, {"courseNum": "RUSS 393", "courseName": "Honors in Russian", "info": "Independent study for RUSS 393 Honors in Russian."}, {"courseNum": "SIGN 102", "courseName": "Elementary Amer Sign Lang II", "info": "An introduction to American Sign Language. Training and practice in signing together with approaches to communicating with deaf people."}, {"courseNum": "SOCI 100", "courseName": "Introduction to Sociology", "info": "The concepts and methods sociologists use to investigate human groups. Focuses on the study of social organization, its variety and development."}, {"courseNum": "SOCI 130", "courseName": "Medicine and Society", "info": "Sociological analysis applied to health and medical care. Distribution of disease and services, behavior in response to illness, medical professions, hospital organization, national policy issues."}, {"courseNum": "SOCI 201", "courseName": "Field Research-Local Community", "info": "Participant observation, interviewing and other field research methods. Students will carry out exercises and/or projects in local communities. Crosslisted as ANTH 201."}, {"courseNum": "SOCI 209", "courseName": "Analyzing the Social World", "info": "A course in sociological data analysis, using the General Social Survey and other data sets, promoting student research."}, {"courseNum": "SOCI 212", "courseName": "Sociological Theory", "info": "A survey of major theorists and theoretical traditions in sociology from roughly 1960 to the present."}, {"courseNum": "SOCI 239", "courseName": "Deviance and Identity", "info": "Social organization and personal action; group dynamics, identity, commitment, and deviant behavior."}, {"courseNum": "SOCI 241", "courseName": "Marriages & Families in 21st C", "info": "Focusing on courtship, marriages, and families in the 21st century U.S., we explore how work and family life vary by gender, race, and social class."}, {"courseNum": "SOCI 247", "courseName": "Political Sociology", "info": ""}, {"courseNum": "SOCI 249", "courseName": "Doing Gender: Self & Society", "info": ""}, {"courseNum": "SOCI 251", "courseName": "Violence and Society", "info": "The study of violent social, political, and legal institutions: domestic violence, sexual coercion, vigilantism, political conflict; the production and control of criminal violence."}, {"courseNum": "SOCI 275", "courseName": "Sociology of Mass Media", "info": "Examination of mass media institutions/production and their effect on media consumers and the broader culture."}, {"courseNum": "SOCI 300", "courseName": "Evolution, Biology and Society", "info": ""}, {"courseNum": "SOCI 316", "courseName": "Globalization &Social; Conflict", "info": ""}, {"courseNum": "SOCI 325", "courseName": "Advanced Reading in Sociology", "info": "Readings developed around the interest of individual students."}, {"courseNum": "SOCI 329", "courseName": "Millennials in the Workplace", "info": ""}, {"courseNum": "SOCI 337", "courseName": "America in Black and White", "info": ""}, {"courseNum": "SPAN 102", "courseName": "Elementary Spanish II", "info": "Continues development of basic language skills, with practice of points of grammar, in the context of Hispanic culture."}, {"courseNum": "SPAN 103", "courseName": "Toward Intermediate Spanish", "info": "Through grammar review and the development of new linguistic skills, in the context of Hispanic cultures, students reach intermediate competency in Spanish."}, {"courseNum": "SPAN 105", "courseName": "Intermediate Spanish", "info": "Review of grammar and development of new linguistic skills and cultural competency to reach high-intermediate level in Spanish."}, {"courseNum": "SPAN 207", "courseName": "Toward Advanced Spanish", "info": "Students demonstrating high-intermediate skills progress toward advanced language proficiency. Reading, discussion and writing about brief literary or cultural texts advances cultural competency."}, {"courseNum": "SPAN 208", "courseName": "Advanced Conversation/Composit", "info": "Advanced study and practice to enhance oral and written proficiency. A variety of texts and media, including literature, film and internet sources provide a point of departure for class discussion and written assignments. Prerequisite: SPAN 207 or six years of Spanish."}, {"courseNum": "SPAN 220", "courseName": "Intro to Spanish Literature", "info": "Introduction to Spanish literature across major artistic and cultural periods: Middle Ages, Renaissance, Golden Age, Romanticism, Realism, and 20th century literature in its cultural context."}, {"courseNum": "SPAN 222", "courseName": "Intro to Latin American Lit", "info": "Introduction to the authors, topics and genres that constitute the literary tradition of Latin America. Literary works are studied in their historical and cultural context."}, {"courseNum": "SPAN 245", "courseName": "Topics in Spain", "info": "Guides students in their experience of life and culture in Spain, and fosters their reflection on the cross-cultural learning experience."}, {"courseNum": "SPAN 270", "courseName": "Spanish Cultural Tradition", "info": "An introduction to the cultural tradition of Spain through the study of art, history, literature, and film."}, {"courseNum": "SPAN 285", "courseName": "Latino Literature in the U.S.", "info": "This course focuses on issues of cultural identity within the literary and some film production of Hispanic peoples living in the U.S."}, {"courseNum": "SPAN 339", "courseName": "Topics in Hispanic Linguistics", "info": "Advanced study of topics or issues in Hispanic Linguistics. Prerequisite: two 200-level courses beyond SPAN 208."}, {"courseNum": "THEA 101", "courseName": "Technical Theatre Practicum", "info": "Quarter-course credit for supervised participation in any one of several aspects of theatrical production of the Department of Theatre and Dance's major productions."}, {"courseNum": "THEA 102", "courseName": "Theatrical Rehearsal/Perform", "info": "Quarter-course credit for substantial participation in a major theatrical production; for example, as actor, stage manager, vocal coach, choreographer."}, {"courseNum": "THEA 110", "courseName": "Acting I", "info": "Introduction to acting: a critical approach to drama and personal expression, including physical, vocal, and interpretive aspects of performance."}, {"courseNum": "THEA 207", "courseName": "Musical Theatre", "info": "An experiential study of musical theatre as an art form with unique conventions and aesthetics, focusing on the performance and production elements of the Broadway stage. Some experience suggested."}, {"courseNum": "THEA 220", "courseName": "Acting Methods", "info": "Application of technique and improvisation to the performance of scenes, with emphasis on characterization and textual analysis. Prerequisites: THEA 110 and permission of the instructor."}, {"courseNum": "THEA 248", "courseName": "Theatrical Lighting Design", "info": "An introduction to and practice in theatrical stage lighting. Primary emphasis in aesthetics and function of light in design. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 251", "courseName": "Costume Design", "info": "Introduction to design of clothing for the stage; emphasis on character analysis and design for plays in different styles and periods."}, {"courseNum": "THEA 254", "courseName": "Computer Aided Desgn for Stage", "info": "An introduction to CAD for use in theatre and other entertainment venues. Includes basic CAD training in technical drafting, scenic modeling and lighting design."}, {"courseNum": "THEA 260", "courseName": "Theatre and Revolution", "info": "Focuses on the relationship between ideology and media, specifically how theatre promotes, resists or escapes from the conflict between the status quo and revolutionary change."}, {"courseNum": "THEA 265", "courseName": "Special Studies in Theatre", "info": "In appropriate years, special topics such as stage combat, mime, or theatrical criticism will be studied."}, {"courseNum": "THEA 319", "courseName": "Individual Projects", "info": "Individual, special projects supervised by the instructor, honors thesis."}, {"courseNum": "THEA 365", "courseName": "Independent Studies in Theatre", "info": ""}, {"courseNum": "UNIV 199", "courseName": "Arts Entrepreneurship", "info": ""}, {"courseNum": "UNIV 200", "courseName": "Integrated Perspectives Course", "info": "Team-taught interdisciplinary course. Topics vary."}, {"courseNum": "UNIV 204", "courseName": "Naming violence", "info": ""}, {"courseNum": "UNIV 214", "courseName": "Fresh Water", "info": ""}, {"courseNum": "UNIV 234", "courseName": "Dialogue and Social Justice", "info": ""}, {"courseNum": "UNIV 239", "courseName": "Working with Writers", "info": "Theory and Practice. An exploration of the social and intellectual dynamics of the writing and tutoring process."}, {"courseNum": "UNIV 268", "courseName": "Jewish-American Lit. and Film", "info": "Examines the literary and cultural production of American Jews through the study of diverse series such as novels, short stories, plays and film. Crosslisted as ENGL 268."}, {"courseNum": "UNIV 286", "courseName": "Imagining Sustainability", "info": ""}, {"courseNum": "UNIV 288", "courseName": "Global Cuisines Local Contexts", "info": ""}, {"courseNum": "WMST 150", "courseName": "Intro Women's & Gender Studies", "info": "Interdisciplinary introduction to the major theories, themes, methodologies, and issues of women's studies. Emphasis in the social sciences."}, {"courseNum": "WMST 208", "courseName": "The Red Brush", "info": ""}, {"courseNum": "WMST 224", "courseName": "African Women & Social Action", "info": "Analysis of topics in films and novels by Ousmane Sembene: pre-colonial history, colonialism, post-colonial independence, racial and gender oppression, worker exploitation, religious conflict, and modernization."}, {"courseNum": "WMST 227", "courseName": "Race and Sexuality", "info": "This course explores the constructions of and intersections between race and sexuality. It also investigates the ways that these identities/locations have informed understanding of inequality in the U.S."}, {"courseNum": "WMST 234", "courseName": "Dialogue and Social Justice", "info": ""}, {"courseNum": "WMST 238", "courseName": "Women and Politics", "info": "An analysis of women and politics generally with specific focus on feminism and its relationship to political discourse and political action. Crosslisted as POLS 229 and POLS 238."}, {"courseNum": "WMST 239", "courseName": "Queering Christian Thought", "info": "This course explores the relationship between queer theories, sexuality studies, and Christian theology. In addition to the concepts of gender, race and sexuality, it offers a survey of major topics in Christian thought, including God, love, justice, sin, and salvation. Crosslisted as RELI 239."}, {"courseNum": "WMST 318", "courseName": "Econ History of Women in U.S.", "info": "Examination of the history of women in the U.S. economy, with particular attention to racial-ethnic and class differences among women. Both neoclassical economics and political economy are utilized to analyze the economic status of women. Crosslisted as ECON 319. Prerequisites: ECON 256 or 257 or 258 or 259 and permission of the instructor."}, {"courseNum": "WMST 320", "courseName": "Independent Study-Women Stdy", "info": "Independent study supervised by Women's Studies faculty member."}, {"courseNum": "WMST 334", "courseName": "Women in Antiquity", "info": "Seminar-style examination of the lives of women in antiquity both real and imagined, as attested in a variety of ancient media. Crosslisted as CLAS 334. Prerequisite: permission of the instructor."}, {"courseNum": "WMST 390", "courseName": "Honor Women's & Gender Studies", "info": "Individual, special projects supervised by instructor, culminating in honors thesis."}, {"courseNum": "WMST 400", "courseName": "Advanced Seminar WMST", "info": "The seminar will focus on the production of an independent research project by each student, with common readings on the practice of feminist scholarship. Students will develop and give formal presentations of their projects. Prerequisites: open to seniors, juniors by permission, WMST 150 and WMST 220 or WMST 230/PHIL 230."}]