[{"courseNum": "ACFM 220", "courseName": "Business Law I", "info": "Introduction to business law using lecture and case method. Topics include contracts, the Uniform Commercial Code, agency, and business structures. Not open to first-year students."}, {"courseNum": "ACFM 261", "courseName": "Foundations of Accounting and Financial Management II", "info": "Covers general purpose financial statements, the theoretical framework that underlies the measurement of income, and asset and liability valuation.  Prerequisite: permission of instructor."}, {"courseNum": "ACFM 310", "courseName": "Independent Study in Accounting and Financial Management", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "ACFM 315", "courseName": "Special Topics in Accounting and Financial Management", "info": "A seminar on selected topics in accounting and financial management.  Prerequisite: permission of the instructor."}, {"courseNum": "ACFM 340", "courseName": "Business Analytics and Financial Modeling", "info": "Decision making of individuals and groups in organizations, emphasizing the organization's financial dimension. Topics include linear and nonlinear optimization with applications in finance and accounting, fundamentals of portfolio and risk management, and the application of Monte Carlo methods to the pricing of financial derivatives."}, {"courseNum": "ACFM 351", "courseName": "Intermediate Accounting and Financial Management I", "info": "Accounting theory and practice applicable to income determination and asset valuation.  Develops students' understanding of the accounting and financial reporting environment. Prerequisite: ACFM 261."}, {"courseNum": "ACFM 352", "courseName": "Intermediate Accounting and Financial Management II", "info": "A continuation of ACFM 351.  Topics include: investments, debt, leases, pensions, deferred taxes, EPS, equity, and cash flows.  Prerequisite: permission of instructor."}, {"courseNum": "ACFM 353", "courseName": "Advanced Accounting", "info": "Accounting theory and practice applicable to business combinations and additional advanced topics related to financial reporting.  Prerequisite: ACFM 352 or permission of the instructor."}, {"courseNum": "ACFM 355", "courseName": "Tax Accounting II", "info": "Advanced topics in federal income, gift and estate taxation, with primary emphasis on corporate and pass-through entity tax law, practice, and planning.  Prerequisite: ACFM 354."}, {"courseNum": "ACFM 357", "courseName": "Auditing and Assurance", "info": "Most CPA track students head to entry level positions as auditors in public accounting firms.  ACFM 357 helps students develop a strong foundation for quality professional judgments to support their future practice of auditing by examining professional and ethical standards and the audit process."}, {"courseNum": "ACFM 358", "courseName": "Computer and Forensic Auditing", "info": "Introduction to forensic accounting and auditing. Topics include legal fundamentals; forensic tools and techniques; financial statement fraud; employee, vendor, and other fraud against the organization; tax fraud; bankruptcy, divorce, and identity theft; organized crime and terrorism investigations; business valuation."}, {"courseNum": "ACFM 370", "courseName": "Corporate Finance", "info": "Concepts, principles, and recent innovations in corporate finance: risk and return, valuation, capital budgeting and structure, dividend policy, financial planning, risk management. Crosslisted as MGMT 370. Prerequisite: MGMT 200. Not open to students who have taken MGMT 203."}, {"courseNum": "ACFM 372", "courseName": "Advanced Corporate Finance", "info": "Students integrate principles and strategies from accounting, statistics, finance, and economics to begin to understand complex financial topics including mergers and acquisitions, valuation, financing, risk management, and corporate governance. Students will also draw from psychology, history, economics, and other disciplines to understand and model the behavior of financial markets."}, {"courseNum": "ACFM 377", "courseName": "Investments", "info": "Principles of investment practice and theory.  Emphasis on the fundamentals of intangible investments (equities, debt and derivative instruments).  Prerequisites: MGMT 102 and ACFM 370 or permission of the instructor."}, {"courseNum": "ACFM 391", "courseName": "The Mass Investing Society", "info": "Traces how the United States has become an \"equity nation\" where most citizens own common stock.  Also explores pivotal moments in stock market history."}, {"courseNum": "ACFM 476", "courseName": "Student Managed Investment Fund II", "info": "The second course of a two semester portfolio management course in which students manage a real dollar investment portfolio.  Prerequisite: ACFM 375 and permission of the instructor."}, {"courseNum": "AFST 199", "courseName": "Introduction to Africana Studies", "info": "The course introduces students to concepts, theories, and debates of the vibrant discipline of Africana Studies. It surveys major themes, questions, concerns, and events of African, African American, and other African diasporic communities. The course examines the making of the modern world through the lens of black global experience."}, {"courseNum": "AFST 221", "courseName": "Introduction to African American Literature", "info": "Provides a selection from across the vast array of examples collected under the inadequate rubric “African American Literature.” We'll read poetry, fiction, non-fiction, and drama in order to understand how a group of people who have been written out of American history and culture write themselves back into these stories. Crosslisted as ENLS 221."}, {"courseNum": "AFST 223", "courseName": "Questioning the Post-Racial", "info": "The term “post-racial” has emerged within public discourse from time to time over the course of America’s existence. From Frederick Douglass to Barack Obama, this expression has described an American aspirational goal. Our class will take a contemporary and literary approach to understanding the limits of the term. Crosslisted as ENLS 223."}, {"courseNum": "AFST 229", "courseName": "Philosophy and Race", "info": "Critical examination of the nature and meaning of \"race\" in terms of conceptual analysis, experience, social constructionism, feminism, class, ethnicity, politics, colonialism, violence, and redress. Crosslisted as PHIL 229 and POLS 259."}, {"courseNum": "AFST 248", "courseName": "Music and Culture: History of Jazz", "info": "A critical examination of musicians, movements, and cultural intersections within the development of jazz. Crosslisted as MUSC 248."}, {"courseNum": "AFST 280", "courseName": "Race, Violence & Incarceration", "info": "This course explores the dynamic convergence of race, violence, and criminal justice. More specifically, it explores policing and punishment from Reconstruction to contemporary mass incarceration.  Police practices, political imprisonment, abolition, and more will also be examined."}, {"courseNum": "AFST 290", "courseName": "Topics in Africana Studies", "info": "A variable topics course in which students will take a critical and empowering look at various expressions of Africana culture, experience, and thought."}, {"courseNum": "ANBE 370", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor. Crosslisted as ANBE 670 and BIOL 370 and BIOL 670 and PSYC 370 and PSYC 670."}, {"courseNum": "ANBE 391", "courseName": "Research", "info": "Independent research, with faculty supervision, in the study of animal behavior.  Crosslisted as ANBE 691. Prerequisite: permission of the instructor."}, {"courseNum": "ANBE 399", "courseName": "Senior Thesis", "info": "Original research leading to a thesis presentation on a topic related to the study of animal behavior.  Prerequisite: permission of the instructor."}, {"courseNum": "ANBE 670", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and BIOL 370 and BIOL 670 and PSYC 370 and PSYC 670."}, {"courseNum": "ANBE 680", "courseName": "Thesis", "info": "Preparation of a thesis leading to the MA or MS degree. Prerequisite: permission of the instructor."}, {"courseNum": "ANTH 109", "courseName": "Introduction to Cultural Anthropology", "info": "Nature and scope of the field: method and theory, institutions of human beings in cross-cultural perspective, case studies."}, {"courseNum": "ANTH 201", "courseName": "Field Research in Local Communities", "info": "Participant-observation, interviewing, and other field research methods. Students will devise and conduct their own ethnographic research projects in a local community. Crosslisted as SOCI 201."}, {"courseNum": "ANTH 202", "courseName": "Rainforests and Ecopolitics in Latin America", "info": "Focusing on Amazonia as a key region in global environmental politics, the course examines climate policy debates and recent shifts in global environmentalism. Crosslisted as LAMS 202 and ENST 209."}, {"courseNum": "ANTH 203", "courseName": "Hazards, Risks, and Disasters: The Anthropology of a Dangerous World", "info": "This course examines environmental hazards and their implications across time and culture.  Questioning commonly held notions about danger, it focuses on how risk and disaster are understood, experienced, and analyzed."}, {"courseNum": "ANTH 204", "courseName": "Language and Culture: Introduction to Linguistic Anthropology", "info": "This course introduces the anthropological study of language and its importance to human behavior and social relations, covering key concepts, terms, and theories about how languages are structured, how people acquire language, and how language affects a number of important social and cultural domains, among other topics. Crosslisted as LING 204."}, {"courseNum": "ANTH 248", "courseName": "Latin America: Challenges for the 21st Century", "info": "Perspectives on the challenges facing Latin American peoples and nations in the 21st century. Crosslisted as LAMS 250."}, {"courseNum": "ANTH 256", "courseName": "Anthropology of Native North America", "info": "This course introduces students to the anthropology of contemporary Native North America. The goal is to teach students the theories, concepts, and methods used by anthropologists to investigate and explain the practices, beliefs, attitudes, and organization of Native peoples."}, {"courseNum": "ANTH 283", "courseName": "Theory in Anthropology", "info": "Explores the historical and contemporary theories in cultural anthropology; conceptualizations of culture, society, humankind; history and critical assessment of the concept of culture in anthropology."}, {"courseNum": "ANTH 317", "courseName": "Race and Culture", "info": "An investigation of the sociocultural workings of race from ethnographic perspectives. Comparative analyses and case studies with a focus on how race functions as marker of cultural difference, terrain of ethnic affiliation, and unruly “social fact.”"}, {"courseNum": "ANTH 330", "courseName": "Advanced Seminar in Anthropology", "info": "Focuses on selected topics of ethnographic and theoretical interest, varying from year to year according to the professor.  This Culminating Experience course is open only to senior anthropology majors, and junior anthropology majors by permission.  Prerequisite: ANTH 283 (may be taken concurrently) and permission of the instructor."}, {"courseNum": "ARBC 101A", "courseName": "Intensive Beginning Arabic", "info": "Intensive practice in beginning speaking, listening, reading, writing, and elementary Arabic grammar. Introduction to everyday Arabic culture. Successful completion meets the prerequisites for ARBC 103."}, {"courseNum": "ARBC 102", "courseName": "Beginning Arabic II", "info": "Continuation of Arabic language skills. Practice in listening, speaking, reading, and writing. Prerequisite: ARBC 101 or equivalent."}, {"courseNum": "ARBC 104", "courseName": "Intermediate Arabic II", "info": "Review of basic grammar with an emphasis on all four language skills and culture. Prerequisite: ARBC 103 or equivalent."}, {"courseNum": "ARBC 202", "courseName": "Intermediate Arabic Conversation II", "info": "Concentration on development of speaking skills. Conducted entirely in Arabic by native speaker. Prerequisite: ARBC 201."}, {"courseNum": "ARBC 203", "courseName": "Unveiling the Hijab's Culture", "info": "An introductory cultural course to various aspects of the Muslim and Arab world to get a deep look at the Middle Eastern culture and customs."}, {"courseNum": "ARST 112", "courseName": "Photography I", "info": "An introduction to the theory, practice, and criticism of fine art photography. Not open to seniors."}, {"courseNum": "ARST 131", "courseName": "Drawing I", "info": "The tradition of drawing, its practice and theory in various media. Not open to seniors."}, {"courseNum": "ARST 230", "courseName": "Printmaking II", "info": "Individual projects in intaglio and woodblock printing with an emphasis on concept and refinement of image. Prerequisite: permission of the instructor."}, {"courseNum": "ARST 234", "courseName": "Digital Photography", "info": "Individual projects in digital photography with an emphasis on concept and refinement of image. Prerequisites: ARST 112, ARST 131 and permission of the instructor."}, {"courseNum": "ARST 238", "courseName": "Painting II", "info": "An expanded introduction to painting practices. Emphasis on process, materials, content, and individual creativity within the context of structured assignments. Prerequisites: ARST 120 and permission of the instructor."}, {"courseNum": "ARST 245", "courseName": "Web Design Fundamentals", "info": "Web Design I is an introductory course to web design fundamentals and approaches. The course will explore proper practices in the design and development of websites, from wireframing and prototyping, to semantic HTML and CSS, to hosting and publishing."}, {"courseNum": "ARST 336", "courseName": "Advanced Work in the Studio", "info": "Advanced projects in each studio area: painting, printmaking, photography, sculpture, or graphics. This course may be repeated for additional credit. Prerequisite: permission of the instructor."}, {"courseNum": "ARST 346", "courseName": "Printmaking III", "info": "Advanced projects in printmaking to develop individual themes and concepts. Prerequisites: permission of the instructor and ARST 230."}, {"courseNum": "ARST 351", "courseName": "Honors Studio Art", "info": "Independent study or creative work leading either to the writing of a thesis or the completion of a significant studio project.  For courses in theatre production and design, see listings in Theatre and Dance."}, {"courseNum": "ARST 450", "courseName": "Senior Projects in Studio Art", "info": "Studio Art Culminating Experience: in the fall semester majors will take ARST 450 Senior Projects in Studio Art to work towards creating a portfolio of professional standards. In the spring semester, majors will install and exhibit the work created in ARST 450 in the Samek Art Gallery."}, {"courseNum": "ARTH 102", "courseName": "World Art II: Renaissance to Now", "info": "This course explores art and architecture from 1400 to the present. Focus on visual analysis and the development of European and American art from the Renaissance to Postmodernism."}, {"courseNum": "ARTH 208", "courseName": "Modern to Postmodern Art: 1915 to the Present", "info": "Examination of artists and movements after 1915, including Dadaism, Surrealism, Constructivism, Abstract Expressionism, Minimalism, Conceptual Art, and Performance Art. Issues of class, race and gender will be central."}, {"courseNum": "ARTH 275", "courseName": "Art and Architecture of the Islamic World", "info": "A survey of Islamic art and architecture from the inception of the faith in the 7th century through the 16th century."}, {"courseNum": "ARTH 320", "courseName": "Independent Study in Art History", "info": "Advanced problems in art history.  Prerequisite: permission of the instructor."}, {"courseNum": "ARTH 381", "courseName": "Honors Art History", "info": "Independent study leading to the writing of a thesis. Prerequisite: permission of the instructor."}, {"courseNum": "ASTR 102", "courseName": "Stars, Galaxies, and Beyond", "info": "An introduction to astronomy concentrating on the structure of our universe beyond the solar system. Designed for non-science majors. ASTR 101 is not a prerequisite for ASTR 102."}, {"courseNum": "BIOL 122", "courseName": "Biology for Non-majors", "info": "Introductory course primarily for the non-biology major. Topics covered include principles of ecology, evolution, animal diversity, behavior, and structure, and function. It is not necessary to take BIOL 121 prior to taking BIOL 122. This course is not appropriate preparation for the majority of pre-health graduate programs. Please consult with the Pre-health Adviser for more information."}, {"courseNum": "BIOL 130", "courseName": "Health and Disease", "info": "A biology course, for non-majors only, that explores the basic biological principles underlying normal health and the most common diseases of humans."}, {"courseNum": "BIOL 206", "courseName": "Organismal Biology", "info": "An introductory course for biology majors emphasizing organisms as dynamic systems by integrating structure with function. Laboratories introduce scientific method and collaborative learning. Second core course."}, {"courseNum": "BIOL 208", "courseName": "Principles of Ecology and Evolution", "info": "Introduction to systematic biology, evolutionary theory, physiological ecology, behavioral ecology, population and community ecology, and ecosystem structure and function. Fourth core course. BIOL 206 and BIOL 207 strongly recommended as prerequisites."}, {"courseNum": "BIOL 221", "courseName": "Human Physiology", "info": "A course that focuses on the functions of and interactions between human organ systems. Does not count toward the biology major.  Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 232", "courseName": "Phage Hunters", "info": "Continuation of BIOL 231. Students will learn the theory and application of bioinformatics and genomics to analyze the genome sequence of a bacteriophage isolated from soil samples. Prerequisites: BIOL 231 and permission of the instructor."}, {"courseNum": "BIOL 302", "courseName": "Microbiology", "info": "Ultra-structure, behavior, metabolism, molecular biology, and development of micro-organisms. Roles in disease and food production. Laboratory will emphasize cultivation and identification.  Prerequisites: BIOL 205 and BIOL 207, and permission of the instructor. Crosslisted as BIOL 602."}, {"courseNum": "BIOL 306", "courseName": "Biology of Host-Microbe Interactions", "info": "Through study of the primary literature, this course will investigate the relationship between animals and their microbes, including evolution of host-microbe relationships, the impact of microbes on human health, the techniques used to study the microbiota, the biology of the microbiome, and other recent advances in the field. Crosslisted as BIOL 606."}, {"courseNum": "BIOL 310", "courseName": "Neurobiology of Learning and Memory", "info": "Focus will be on the cellular mechanisms underlying synaptic plasticity, modification of synapses, signaling cascades, and consolidation of synaptic changes during learning and memory formation. Primary literature will be used extensively. Prerequisites: BIOL 205 and BIOL 206 and permission of the instructor."}, {"courseNum": "BIOL 320", "courseName": "Seminar", "info": "Topics vary. Crosslisted as BIOL 620."}, {"courseNum": "BIOL 326", "courseName": "Cytogenetics", "info": "Study of chromosome structure, organization, aberrations, and behavior. Multiple eukaryotic systems will be considered with links to human disease. Perquisites: BIOL 205 and BIOL 207 and permission of the instructor. Crosslisted as BIOL 626."}, {"courseNum": "BIOL 327", "courseName": "Molecular Biology", "info": "Synthesis of DNA, RNA, and protein, and the regulation of these processes in both prokaryotic and eukaryotic cells; laboratory experience in the manipulation and analysis of genes.  Prerequisites: BIOL 205 and BIOL 207 and permission of the instructor. Crosslisted as BIOL 627."}, {"courseNum": "BIOL 330", "courseName": "Plant Systematics", "info": "Exploration of the diversity of plant life on Earth through lectures, labs, and field trips; includes biogeography, natural history, evolutionary relationships, ethnobotanical uses, and identification. Prerequisite: BIOL 206 or permission of the instructor. Crosslisted as BIOL 630."}, {"courseNum": "BIOL 331", "courseName": "Genomics", "info": "A computer research-based course in which students study the structure, content, expression and evolution of genomes. Prerequisites: BIOL 207 and permission of the instructor. Crosslisted as BIOL 631."}, {"courseNum": "BIOL 332", "courseName": "Developmental Neurobiology", "info": "Primary literature-based senior seminar on topics in developmental neurobiology. Prerequisites: BIOL 205, BIOL 207, and either BIOL 206 or NEUR 100, junior or senior status, and permission of the instructor. Crosslisted as BIOL 632 and NEUR 332."}, {"courseNum": "BIOL 339", "courseName": "Developmental Biology", "info": "This course provides an introduction to early animal development with emphasis on the molecular, cellular and genetic mechanisms that drive the formation of the embryo.  Prerequisites: BIOL 205 and BIOL 206 and permission of the instructor. Crosslisted as BIOL 639."}, {"courseNum": "BIOL 340", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation and analysis of proteins and nucleic acids. Spectrophotometry, chromatography, centrifugation, electrophoresis, and methods of molecular cloning are emphasized.  Prerequisites: BIOL 205 and CHEM 351 and permission of the instructor.  Crosslisted as CHEM 358."}, {"courseNum": "BIOL 347", "courseName": "Virology", "info": "The study of virus structure, genome organization, replication and host-interactions. Emphasis will be on animal and bacterial viruses.  Prerequisites: BIOL 205, BIOL 207, and permission of the instructor. Crosslisted as BIOL 647."}, {"courseNum": "BIOL 353", "courseName": "Ecosystem Ecology", "info": "Interactions between organisms and the physical and chemical environment including nutrient cycling and energy flow, biogeochemistry, and temporal and spatial dynamics of ecosystems.  Prerequisites: BIOL 208, junior or senior status, and permission of the instructor. Crosslisted as BIOL 653 and ENST 353."}, {"courseNum": "BIOL 365", "courseName": "Introduction to Microscopy", "info": "This course is designed as an overview of light and electron microscopy, with emphasis placed on the use of instrumentation. Prerequisite: Permission of the instructor. Crosslisted as BIOL 665."}, {"courseNum": "BIOL 370", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 670 and PSYC 370 and PSYC 670."}, {"courseNum": "BIOL 399", "courseName": "Undergraduate Research", "info": "Undergraduate research.  Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 602", "courseName": "Microbiology", "info": "Ultra-structure, behavior, metabolism, molecular biology, and development of micro-organisms. Roles in disease and food production. Laboratory will emphasize cultivation and identification. Prerequisites: BIOL 202 and permission of the instructor. Crosslisted as BIOL 302."}, {"courseNum": "BIOL 606", "courseName": "Biology of Host-Microbe Interactions", "info": "Through study of the primary literature, this course will investigate the relationship between animals and their microbes, including evolution of host-microbe relationships, the impact of microbes on human health, the techniques used to study the microbiota, the biology of the microbiome, and other recent advances in the field. Crosslisted as BIOL 306."}, {"courseNum": "BIOL 620", "courseName": "Seminar", "info": "Topics vary. Crosslisted as BIOL 320."}, {"courseNum": "BIOL 626", "courseName": "Cytogenetics", "info": "Study of chromosome structure, organization, aberrations, and behavior. Multiple eukaryotic systems are considered, with links to human disease. Prerequisite: permission of the instructor. Crosslisted as BIOL 326."}, {"courseNum": "BIOL 627", "courseName": "Molecular Biology", "info": "Synthesis of DNA, RNA, and protein, genetic phenomena in both prokaryotic and eukaryotic cells; laboratory experience in the regulation and manipulation of genes. Prerequisite: permission of the instructor. Crosslisted as BIOL 327."}, {"courseNum": "BIOL 630", "courseName": "Plant Systematics", "info": "Exploration of the diversity of plant life on Earth through lectures, labs, and field trips; includes biogeography, natural history, evolutionary relationships, ethnobotanical uses, and identification. Prerequisite: permission of the instructor. Crosslisted as BIOL 330."}, {"courseNum": "BIOL 631", "courseName": "Genomics", "info": "The study of the structure, content, expression and evolution of genomes, emphasizing the impact of genomic information on our ability to answer biological questions. Crosslisted as BIOL 331."}, {"courseNum": "BIOL 632", "courseName": "Developmental Neurobiology", "info": "Primary literature-based senior seminar on topics in developmental neurobiology. Prerequisite: permission of the instructor. Crosslisted as BIOL 332 and NEUR 332."}, {"courseNum": "BIOL 639", "courseName": "Developmental Biology", "info": "This course provides an introduction to early animal development with emphasis on the molecular, cellular and genetic mechanisms that drive the formation of the embryo. Prerequisite: permission of the instructor. Crosslisted as BIOL 339."}, {"courseNum": "BIOL 640", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation and analysis of proteins and nucleic acids. Spectrophotometry, chromatography, centrifugation, electrophoresis, and methods of molecular cloning are emphasized. Prerequisite: permission of the instructor. Crosslisted as CHEM 358/658."}, {"courseNum": "BIOL 647", "courseName": "Virology", "info": "The study of virus structure, genome organization, replication and host-interactions. Emphasis will be on animal and bacterial viruses. Prerequisite: permission of the instructor. Crosslisted as BIOL 347."}, {"courseNum": "BIOL 653", "courseName": "Ecosystem Ecology", "info": "Interactions between organisms and the physical and chemical environment including nutrient cycling and energy flow, biogeochemistry, and temporal and spatial dynamics of ecosystems.  Prerequisites: BIOL 208, junior or senior status, and permission of the instructor. Crosslisted as BIOL 353 and ENST 353."}, {"courseNum": "BIOL 660", "courseName": "Graduate Research", "info": "Graduate research. Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 665", "courseName": "Introduction to Microscopy", "info": "This course is designed as an overview of light and electron microscopy, with emphasis placed on the use of instrumentation. Prerequisite: permission of the instructor. Crosslisted as BIOL 365."}, {"courseNum": "BIOL 670", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 370 and PSYC 370 and PSYC 670."}, {"courseNum": "BIOL 680", "courseName": "Thesis", "info": "Thesis. Prerequisite: permission of the instructor."}, {"courseNum": "BMEG 205", "courseName": "Bioinstrumentation I", "info": "Introduction to analog and digital circuits with applications to medicine and biology. Corequisite: MATH 212. Prerequisite: MATH 202. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 210", "courseName": "Fundamentals of Biomedical Engineering", "info": "Introduction to the application of fluid mechanics, mass transfer, instrumentation, mechanics, and societal issues to biomedical problems. Hands-on laboratory experiences integrated with lecture. Prerequisites: MATH 201 and PHYS 211. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 220", "courseName": "Introduction to Engineering Computing", "info": "Introduction to numerical methods and programming fundamentals. Problems drawn from mathematics, engineering, and biomedical engineering. Corequisite: MATH 212. Not open to students who have taken ENGR 211, ENGR 212, ENGR 214. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 226", "courseName": "Statistical Methods in Biomedical Engineering", "info": "Introduction to concepts in experimental design and data analysis with application to biomedical engineering, medicine, and biology. Prerequisite: MATH 201. Not open to students who have taken ENGR 215, MATH 216 or MATH 226. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 300", "courseName": "Biotransport I", "info": "First biotransport course. Fluid mechanics principles applied to biological systems and medical devices. Properties of biological fluids, energy and momentum balances, computational modeling. Prerequisite: MATH 212. Not open to students who have taken CHEG 300, ENGR 222, or ENGR 233. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 402", "courseName": "Biomedical Engineering Capstone II", "info": "Second semester of the biomedical engineering design sequence emphasizing fabrication, instrumentation, testing and evaluation, and final presentation of projects. Prerequisites: BMEG 401. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 408", "courseName": "Medical Device Assessment and Development", "info": "An examination of medical device design including benchmarking, intellectual property, regulatory pathways, industry standards, project planning, project management, and individual and team professionalism. Topics will be applied to currently marketed medical devices. Prerequisites: BMEG 205. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 451", "courseName": "Biomechanics and Injury Prevention", "info": "Survey course for field of biomechanics and research for injury prevention (lowering risk and/or severity). Mixture of lectures, labs, and projects. Prerequisite: permission of the instructor."}, {"courseNum": "BMEG 472", "courseName": "Advanced Topics in Biomedical Engineering", "info": "Advanced, in-depth course developed from areas of biomedical engineering. Topics will vary.  Prerequisite: permission of the instructor."}, {"courseNum": "BMEG 481", "courseName": "Biomedical Engineering Project", "info": "Individual work with a faculty adviser on development, design, or research project beginning with a written plan and culminating with a written or oral presentation.  Prerequisite: permission of the instructor."}, {"courseNum": "BMEG 491", "courseName": "Biomedical Engineering Research", "info": "Independent study with a faculty adviser on a research or design project. Submit a project proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group.  Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 330", "courseName": "Introduction to Transportation", "info": "Transportation systems, operations, planning, and design for highways and other modes; sustainability, safety, social, and economic issues; traffic studies in the local community."}, {"courseNum": "CEEG 405", "courseName": "Design of Steel Structures", "info": "Introduction to behavior and design of steel structures and elements, including tension members, compression members, beams, beam-columns and connections. Limit states design philosophy is emphasized through the use of AISC specifications. Design loads according to contemporary standards, and international building codes.  Prerequisite: CEEG 300 or permission of the instructor."}, {"courseNum": "CEEG 409", "courseName": "Earthquake Engineering", "info": "Analysis and design of structures subjected to earthquakes. Single and multi degree-of-freedom systems, response spectra, seismology, soil dynamics. Seismic design methods in building codes. Isolation and energy dissipation systems. Laboratory to include experiments with shake table. Prerequisite: CEEG 300 or permission of the instructor."}, {"courseNum": "CEEG 440", "courseName": "Physical and Chemical Treatment Processes", "info": "Fundamentals of physical and chemical treatment processes used to remove pollutants from water, air, and soil such as ion-exchange, coagulation, sedimentation, filtration, air stripping, disinfection, adsorption, and membrane processes. Laboratory experiments reinforce theory and are help develop design criteria for full-scale treatment processes. Prerequisites: CEEG 340 or instructor permission. Crosslisted as CEEG 640."}, {"courseNum": "CEEG 442", "courseName": "Sustainability Principles for Engineers", "info": "An introduction to concepts for the application of sustainable engineering principles. Topics include life-cycle assessment, biogeochemical cycles, climate change, fossil fuels and renewable energy, embedded water, global and cultural context, market externalities, sustainability metrics, and carbon footprint. Prerequisite: CEEG 340 or third- or fourth-year engineers with permission of the instructor. Crosslisted as CEEG 642."}, {"courseNum": "CEEG 443", "courseName": "Systems and Life Cycle Assessment", "info": "Systems topics include definitions, causal loops, systems dynamics, emergence, self-organization, and complexity. Life cycle assessment (LCA) includes standardized methodologies, LCA projects, and sensitivity analyses. Reading, discussion, and computational tools are central to the course. Prerequisite: CEEG 442 or instructor permission."}, {"courseNum": "CEEG 444", "courseName": "Hazardous Waste Management", "info": "Identification of common hazardous chemicals and related industrial activities, determination of risk-based clean up levels for hazardous waste sites, toxicology, pump-and-treat ground water remediation, in situ bioremediation, legal and liability issues, and remedial action. Prerequisites: CEEG 340 and permission of the instructor. Crosslisted as CEEG 644."}, {"courseNum": "CEEG 451", "courseName": "Environmental Geotechnology", "info": "Interaction between hazardous and toxic wastes and geotechnical properties of soils. Remediation of the subsurface environment.  Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 452", "courseName": "Ground Improvement Engineering", "info": "Application of soil mechanics principles to improving the engineering characteristics of soils. Includes mechanisms of soil stabilization, grouting, deep dynamic compaction, reinforced earth, sand drains, and preconsolidation.  Prerequisites: CEEG 350 and permission of the instructor."}, {"courseNum": "CEEG 480", "courseName": "Special Topics in Civil Engineering", "info": "Individual projects in laboratory work, design, or library studies, depending upon the nature of the problem selected.  Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 481", "courseName": "Undergraduate Research", "info": "Original investigations in structural engineering, transportation engineering, environmental engineering, geotechnical engineering, or water resource engineering."}, {"courseNum": "CEEG 491", "courseName": "Civil Engineering Design", "info": "A comprehensive design of a civil engineering project that integrates at least two subdisciplines of civil engineering. Projects are designed by teams of two to four students and must involve analysis and synthesis to produce design solutions that achieve the desired \"client\" needs within specified constraints. A weekly seminar series by practicing engineers and others focuses on ethics, professionalism, global issues, and engineering careers. Prerequisite: CEEG 490."}, {"courseNum": "CEEG 609", "courseName": "Earthquake Engineering", "info": "Analysis and design of structures subjected to earthquakes. Single and multi degree-of-freedom systems, response spectra, seismology, soil dynamics. Seismic design methods in building codes. Isolation and energy dissipation systems. Laboratory to include experiments with shake table. Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 640", "courseName": "Physical and Chemical Treatment Processes", "info": "Fundamentals of physical and chemical treatment processes used to remove pollutants from water, air and soil such as ion-exchange, coagulation, sedimentation, filtration, air stripping, disinfection, adsorption, and membrane processes. Laboratory experiments are used to reinforce theory and to develop design criteria for full- scale treatment processes. Prerequisite: permission of instructor Crosslisted as CEEG 440."}, {"courseNum": "CEEG 642", "courseName": "Sustainability Principles for Engineers", "info": "An introduction to concepts for the application of sustainable engineering principles. Topics include life-cycle assessment, biogeochemical cycles, climate change, fossil fuels and renewable energy, embedded water, global and cultural context, market externalities, sustainability metrics, and carbon footprint. Prerequisite: CEEG 340 or 3rd and 4th-year engineers with permission of the instructor."}, {"courseNum": "CEEG 643", "courseName": "Systems and Life Cycle Assessment", "info": "Systems topics include definitions, causal loops, systems dynamics, emergence, self-organization, and complexity. Life cycle assessment (LCA) includes standardized methodologies, LCA projects, and sensitivity analyses. Reading, discussion, and computational tools are central to the course."}, {"courseNum": "CEEG 644", "courseName": "Hazardous Waste Management", "info": "Identification of common hazardous chemicals and related industrial activities, determination of risk-based clean up levels for hazardous waste sites, toxicology, pump-and-treat ground water remediation, in situ bioremediation, legal and liability issues, and remedial action. Prerequisite: permission of the instructor. Crosslisted as CEEG 444."}, {"courseNum": "CEEG 651", "courseName": "Environmental Geotechnology", "info": "Interaction between hazardous and toxic wastes and geotechnical properties of soils. Remediation of the subsurface environment. Prerequisite: CEEG 350 or equivalent or permission of the instructor."}, {"courseNum": "CEEG 652", "courseName": "Ground Improvement Engineering", "info": "Application of soil mechanics principles to improving the engineering characteristics of soils. Includes mechanisms of soil stabilization, grouting, deep dynamic compaction, reinforced earth, sand drains, and preconsolidation. Prerequisites: CEEG 350 and permission of the instructor."}, {"courseNum": "CEEG 699", "courseName": "Thesis", "info": "Research on the graduate level under the direction of a faculty member."}, {"courseNum": "CHEG 101", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 102", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 103", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 104", "courseName": "Chemical Engineering Seminar", "info": "A joint seminar for all chemical engineering students and faculty. Variety of engineering-related topics presented by industrial, academic, alumni, and student speakers. Presentations and discussions on professional development and interpersonal skills in the work place, ethics, and societal issues, professional society activities, and other topics relevant to the profession."}, {"courseNum": "CHEG 200", "courseName": "Chemical Engineering Principles", "info": "Introduction to the concepts of material and energy balances and phase equilibria for chemical engineering processes. Introduction to problem solving methodologies and computer simulation. With experimental laboratory. Prerequisite: MATH 201."}, {"courseNum": "CHEG 210", "courseName": "Applied Mathematics for Chemical Engineering", "info": "Mathematical modeling and methods. Topics include ordinary and partial differential equations, Laplace transforms, and matrices with analytical and computer solutions. With computational laboratory. Prerequisite: MATH 211 or equivalent."}, {"courseNum": "CHEG 310", "courseName": "Chemical Engineering Thermodynamics", "info": "Laws of thermodynamics, thermodynamic properties of materials, equations of state, refrigeration and engine cycles, physical and chemical reaction equilibrium, and solution thermodynamics. With computational laboratory. Prerequisites: CHEG 302 and CHEM 341 or CHEM 343."}, {"courseNum": "CHEG 315", "courseName": "Unit Operations Laboratory", "info": "A laboratory course in pilot-scale processes involving momentum, heat and mass transfer. Project definition, experimental operation, analytical procedures, data analysis, technical reports and oral presentations. Prerequisite: CHEG 302. Corequisite: CHEG 310."}, {"courseNum": "CHEG 330", "courseName": "Process Control", "info": "Dynamics of open and closed-loop processes. Design, analysis and tuning of PID feedback control based on transient, Laplace domain, and frequency response methods. Instrumentation and computer-based data acquisition and control for chemical processes. With experimental laboratory. Introduction to feedforward, cascade and advanced control strategies. Prerequisites: CHEG 300 and CHEG 302."}, {"courseNum": "CHEG 410", "courseName": "Project Engineering", "info": "Second of two capstone experiences. Students refine a general problem statement in order to plan, execute and assess a project that achieves specific goals. Design, construction, and testing of an apparatus, system, or simulation. Problem-solving, teamwork, communication, professional development, and laboratory work are emphasized. With design laboratory. Prerequisite: CHEG 400. Crosslisted as CHEG 610."}, {"courseNum": "CHEG 431", "courseName": "Chemical Engineering Project", "info": "Individual work with a faculty adviser on a development or design project beginning with a written plan and culminating with a deliverable product and a written report. Problem analysis involving information synthesis, experimentation, mathematical modeling, or software development.  Prerequisite: permission of the instructor."}, {"courseNum": "CHEG 441", "courseName": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written and an oral presentation before a faculty group.  Prerequisite: permission of the instructor. Crosslisted as CHEG 440 and CHEG 640 and CHEG 641."}, {"courseNum": "CHEG 445", "courseName": "Experiments in Polymer Science and Technology", "info": "Laboratory investigation into problems involving the synthesis, characterization, and processing of polymeric materials. Prerequisite: ENGR 240 or ENGR 242."}, {"courseNum": "CHEG 450", "courseName": "Polymer Science", "info": "Structure, characterization and properties of polymeric materials. Chemistry and kinetics of polymerization. Processing and application of polymers. Prerequisite: CHEM 341 or CHEM 343. Crosslisted as CHEG 650."}, {"courseNum": "CHEG 460", "courseName": "Biomaterials: Materials in Medicine", "info": "Classes of biomaterials, their applications, and current trends in biomaterials research and technology. Medical/ethical implications of biomaterials development and research. Open to seniors in chemical engineering, others by permission of the instructor. Crosslisted as CHEG 660."}, {"courseNum": "CHEG 472", "courseName": "Special Topics in Chemical Engineering", "info": "Advanced, in-depth courses developed from areas of chemical engineering science or technology. Prerequisite: junior or senior status. Crosslisted as CHEG 672."}, {"courseNum": "CHEG 485", "courseName": "Topics in Transport Theory", "info": "Mass, energy, and momentum transfer in continuous media. General equations of transfer developed and used to  analyze physical systems. Development and application of mathematical techniques appropriate to the topic.  Prerequisite: CHEG 300. Open to juniors and seniors. Crosslisted as CHEG 685."}, {"courseNum": "CHEG 610", "courseName": "Project Engineering", "info": "Second of two capstone experiences. Students refine a general problem statement in order to plan, execute and assess a project that achieves specific goals. Design, construction, and testing of an apparatus, system, or simulation. Problem-solving, teamwork, communication, professional development, and laboratory work are emphasized. With design laboratory. Crosslisted as CHEG 410."}, {"courseNum": "CHEG 641", "courseName": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written and an oral presentation before a faculty group. Prerequisite: permission of the instructor. Crosslisted as CHEG 440 and CHEG 441 and CHEG 640."}, {"courseNum": "CHEG 645", "courseName": "Experiments-Polymer Sci & Tech", "info": "Laboratory investigation into problems involving the synthesis, characterization, and processing of polymeric materials. Crosslisted as CHEG 445."}, {"courseNum": "CHEG 650", "courseName": "Polymer Science", "info": "The chemistry and kinetics of polymerization. Polymerization processes and polymer processing. Properties and application of polymers. Prerequisites: CHEM 212 and CHEM 341. Crosslisted as CHEG 450."}, {"courseNum": "CHEG 660", "courseName": "Biomaterial-Materl in Medicine", "info": "Classes of biomaterials, their applications, and current trends in biomaterials research and technology. Medical/ ethical implications of biomaterials development and research. Prerequisite: permission of the instructor. Crosslisted as CHEG 460."}, {"courseNum": "CHEG 672", "courseName": "Special Topics in Chem Engr", "info": "Advanced, in-depth courses developed from areas of chemical engineering science or technology. Prerequisite: permission of the instructor. Crosslisted as CHEG 472."}, {"courseNum": "CHEG 680", "courseName": "Graduate Research and Thesis", "info": "Individual graduate-level investigations culminating in a thesis. Required for the master of science in chemical engineering degree."}, {"courseNum": "CHEG 685", "courseName": "Topics in Transport Theory", "info": "Mass, energy, and momentum transfer in continuous media. General equations of transfer developed and used to analyze physical systems. Development and application of mathematical techniques appropriate to the topic. Crosslisted as CHEG 485."}, {"courseNum": "CHEM 160", "courseName": "Introduction to Environmental Chemistry", "info": "One semester terminal course in chemistry. Introduction to the basic chemistry principles that govern natural processes and anthropogenic effects on the environment. Satisfies laboratory science requirement for Bachelor of Arts students not majoring in science or engineering. Crosslisted as ENST 160."}, {"courseNum": "CHEM 202", "courseName": "General Chemistry II", "info": "A continuation of CHEM 201 with a focus on equilibrium, thermodynamics, kinetics, and acid-base chemistry. Laboratory experiments emphasize quantitative procedures.  CHEM 201 is a prerequisite for CHEM 202. Credit not given for CHEM 202 and CHEM 221 or CHEM 231."}, {"courseNum": "CHEM 212", "courseName": "Organic Chemistry II", "info": "A continuation of CHEM 211 with focus on properties and reactions of functional groups, synthesis, and spectroscopic analysis. Prerequisite: CHEM 211."}, {"courseNum": "CHEM 222", "courseName": "Accelerated General Chemistry: Inorganic", "info": "Atomic structure and introductory quantum mechanics. Molecular structure and theories of bonding. Introductory thermodynamics and kinetics. Introduction to coordination chemistry. Laboratory: introduction to quantitative techniques. Prerequisite: Chemical Engineering students. All others by permission of the instructor."}, {"courseNum": "CHEM 231", "courseName": "Analytical Chemistry", "info": "Chemical equilibrium and modern analysis with an emphasis on acid-base systems, solubility, metal ion determinations, electroanalytical chemistry, spectrophotometry, and separation methods. Prerequisite: CHEM 221 or CHEM 222."}, {"courseNum": "CHEM 314", "courseName": "Mechanistic Organic Chemistry", "info": "Thermal and kinetic aspects of organic reactions are discussed along with the effect of substituents, solvents, and stereochemistry on reaction pathways. Qualitative molecular orbital theory of organic compounds is covered in depth. Weekly problem sessions are held. Prerequisites: CHEM 211 and CHEM 212. Crosslisted as CHEM 614."}, {"courseNum": "CHEM 322", "courseName": "Inorganic Chemistry II", "info": "Survey course in modern inorganic chemistry covering transition metal, coordination, organometallic, and bioinorganic chemistry. Laboratory will consist of synthetic and physical measurements as well as the manipulation of air sensitive materials. Prerequisite: CHEM 231. Crosslisted as CHEM 622."}, {"courseNum": "CHEM 340", "courseName": "Biological Physical Chemistry", "info": "Introduction to physical chemistry for life science students, with emphasis on thermodynamics, hydrodynamics and spectroscopy. Not open to B.S. chemistry majors. Prerequisites: CHEM 231, MATH 201, and PHYS 211. MATH 202 and PHYS 212 are recommended. Crosslisted as CHEM 640."}, {"courseNum": "CHEM 342", "courseName": "Physical Chemistry II", "info": "Introductory physical chemistry with emphasis on quantum mechanics, structure and bonding, molecular spectroscopy and statistical mechanics. The customized laboratory experience will emphasize applications of spectroscopy and computational methods. Prerequisite: CHEM 341. Crosslisted as CHEM 642."}, {"courseNum": "CHEM 352", "courseName": "Biochemistry II", "info": "Advanced topics in protein structure and function, protein folding, enzyme mechanisms, electron transport and free-energy coupling mechanisms, biosynthesis, metabolic regulation, and supramolecular assemblies. Prerequisite: CHEM 351 or permission of the instructor. Crosslisted as CHEM 652."}, {"courseNum": "CHEM 358", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation, protein, and nucleic acid analysis. Spectrophotometry, chromatography, centrifugation, electrophoresis, and mass spectrometry are emphasized. Prerequisites: BIOL 205 and CHEM 351 and permission of the instructor. Crosslisted as BIOL 340."}, {"courseNum": "CHEM 371", "courseName": "Chemistry Lecture Series", "info": "Formal oral presentations on current research will be given by students, faculty and visiting scientists. Prerequisites: participation in an approved research project or independent study for seniors or second term juniors only."}, {"courseNum": "CHEM 376", "courseName": "Undergraduate Research", "info": "Original investigations in analytical, biological, organic, physical, environmental or inorganic chemistry."}, {"courseNum": "CHEM 386", "courseName": "Seminar", "info": "Topics vary. Crosslisted as CHEM 686."}, {"courseNum": "CHEM 614", "courseName": "Mechanistic Organic Chemistry", "info": "Discussions of the reaction mechanisms of substitution, elimination, cycloaddition, and acylation reactions are presented. Class topics include the influence of solvent on mechanism, and steric, sterochemical, and kinetic aspects of reactions. Prerequisite: permission of the instructor. Crosslisted as CHEM 314."}, {"courseNum": "CHEM 622", "courseName": "Inorganic Chemistry II", "info": "Descriptive chemistry of inorganic compounds and topics in coordination chemistry. Prerequisite: CHEM 231. Crosslisted as CHEM 322."}, {"courseNum": "CHEM 640", "courseName": "Biological Physical Chemistry", "info": "Introduction to physical chemistry for life science students, with emphasis on thermodynamics, hydrodynamics and spectroscopy. Crosslisted as CHEM 340."}, {"courseNum": "CHEM 642", "courseName": "Physical Chemistry II", "info": "Introductory physical chemistry with emphasis on quantum mechanics, molecular spectroscopy and statistical mechanics. The customized laboratory experience will emphasize applications of spectroscopy and computational methods. Crosslisted as CHEM 342."}, {"courseNum": "CHEM 652", "courseName": "Biochemistry II", "info": "Advanced topics in protein structure and function protein folding, enzyme mechanisms, electron transport and free- energy coupling mechanisms, biosynthesis, metabolic regulation, and supramolecular assemblies. Prerequisite: permission of the instructor. Crosslisted as CHEM 352."}, {"courseNum": "CHEM 658", "courseName": "Biochemical Methods", "info": "A course in laboratory techniques including cell fractionation, protein, and nucleic acid analysis. Spectrophotometry, chromatography, centrifugation, and electrophoresis are emphasized. Prerequisite: permission of the instructor. Crosslisted as BIOL 340/640."}, {"courseNum": "CHEM 676", "courseName": "Graduate Research", "info": "Graduate research."}, {"courseNum": "CHEM 686", "courseName": "Seminar", "info": "Topics vary. Crosslisted as CHEM 386."}, {"courseNum": "CHIN 102", "courseName": "Chinese I", "info": "Intensive introduction to spoken and written \"Mandarin\" Chinese, the puutonghuah (common language) of modern China. Prerequisite: CHIN 101."}, {"courseNum": "CHIN 104", "courseName": "Chinese II", "info": "Continued rigorous study of spoken and written \"Mandarin\" Chinese now called puutonghuah (the common language). Prerequisite: CHIN 103 or equivalent."}, {"courseNum": "CHIN 202", "courseName": "Chinese III", "info": "Continued study of modern \"Mandarin.\" Contemporary essays, movie scripts, short stories and newspaper articles. Equal emphasis on reading and speaking. Conducted in Chinese. Prerequisite: CHIN 201 or equivalent."}, {"courseNum": "CHIN 204", "courseName": "Chinese IV", "info": "Reading and discussion of selected modern Chinese texts: newspaper and magazine articles, essays, short stories, and film scripts.  Conducted in Chinese. Prerequisite: CHIN 203 or equivalent."}, {"courseNum": "CLAS 131", "courseName": "Greek Civilization", "info": "Introduction to the study of ancient Greek civilization through its art, literature, history, religion, etc. Emphasis on the classical period."}, {"courseNum": "CLAS 215", "courseName": "Classical Myth", "info": "Study of the traditional tales of Greece and, to a lesser extent, the Near East and Rome; consideration and application of myth theory."}, {"courseNum": "CLAS 218", "courseName": "Roman History", "info": "Roman history from Rome's foundations as a backwater village ca. 753 BCE, through its rise as a world-power to its fall in the fourth century CE, focusing on economic and political issues. Crosslisted as HIST 241."}, {"courseNum": "CLAS 224", "courseName": "Poetry of Passion in Greece and Rome", "info": "Interpretative study of Greek and Latin poetic genres (such as lyric, epigram, elegy, pastoral, and satire), with an emphasis on the representation of love and sexuality. May include discussion of post-classical traditions of erotic poetry."}, {"courseNum": "CLAS 233", "courseName": "The Age of Alexander the Great", "info": "Study of the transformation of classical Greek culture into a civilization dominating the Mediterranean world and its Eastern neighbors.  Topics may include art, urban culture, politics, intellectual expressions, and religious innovation."}, {"courseNum": "CLAS 235", "courseName": "Dying For God: Martyrs and Monks", "info": "Early Christians were attracted to dramatic narratives of suffering--whether about spectacular deaths in the arena or extreme self-denial in the desert. This course explores the world of martyrs and monks and considers how ancient ideals about pain, gender, and sexuality continue to influence Christian thinking about holiness and sainthood. Crosslisted as RELI 253 and WMST 245."}, {"courseNum": "CLAS 250", "courseName": "Topic in Classics", "info": "Study of a topic relating to the classical world and its tradition.  Examples, slavery, women, religions, a historical period.  May be repeated for credit when topic varies."}, {"courseNum": "CLAS 311", "courseName": "Independent Study in Classics", "info": "Topics in classical civilization, to be chosen by the student.  Prerequisite: permission of the instructor."}, {"courseNum": "CLAS 322", "courseName": "Honors Tutorial and Thesis", "info": "Independent study and research leading to the writing of a thesis.  Prerequisite: permission of the instructor."}, {"courseNum": "CLAS 350", "courseName": "Seminar on a Classical Topic", "info": "Study of a topic of importance in classics.  Examples: a current problem, an important figure, a historical period. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 187", "courseName": "Creative Computing and Society: Computing, Creativity, and the Social Good", "info": "Introduces computing in the context of creativity and examining problems of social good. Students will create visual artifacts that will empower them to investigate, and draw novel insights from, data that may be social, historical, or textual in nature. Supplemented with discussions on computing's impact on society."}, {"courseNum": "CSCI 203", "courseName": "Introduction to Computer Science I", "info": "Overview of computing that explores relationships between computer organization, various programming approaches, limits to computing, and computing in society. Students solve computational problems using Python."}, {"courseNum": "CSCI 204", "courseName": "Introduction to Computer Science II", "info": "Introduction to data structures and algorithms using an object-oriented approach. Topics include software-engineering principles, object-oriented programming, recursion, basic data structures, algorithm analysis, and team programming. Prerequisite: CSCI 203 or permission of the instructor. Corequisite: MATH 201 or equivalent."}, {"courseNum": "CSCI 205", "courseName": "Software Engineering and Design", "info": "Fundamentals of software design and software engineering. Students will participate in large-scale, team-based software development project. Prerequisite: CSCI 204 or permission of the instructor."}, {"courseNum": "CSCI 206", "courseName": "Computer Organization and Programming", "info": "Concepts of software and hardware. Software: instruction set design, assembly language and assemblers. Hardware: processor organization, memory hierarchy, interfacing processors and I/O devices. Prerequisite: CSCI 204 or permission of the instructor."}, {"courseNum": "CSCI 240", "courseName": "Computers and Society", "info": "The place of computers in society. In-depth study of societal, ethical, and legal issues related to computing. Historical and futurists' views of computing and technology. Public perceptions of computing and the role of computer scientists as professionals. Course work includes oral and written presentations. Prerequisite: junior or senior standing."}, {"courseNum": "CSCI 245", "courseName": "Life, Computers, and Everything", "info": "This course explores how computing technologies fit into modern life and provides opportunities for critical analysis of their societal impacts. Past, current, and future developments in computing are studied from ethical and legal perspectives.  Course activities includes discussions, oral presentations, and written work. Fulfills CSCI 240 requirement for CS majors."}, {"courseNum": "CSCI 311", "courseName": "Algorithms and Data Structures", "info": "Introduction to the algorithms and data structures used in implementing abstract data types including priority queues, dictionaries, and graphs. Includes complexity analysis of various implementations. Prerequisites: MATH 241 and CSCI 205 or permission of the instructor."}, {"courseNum": "CSCI 331", "courseName": "Compiler Optimization", "info": "Project based introduction to compiler optimization for theoretical and practical issues such as run-time, memory usage, code robustness, and security. Prerequisite: CSCI 208."}, {"courseNum": "CSCI 376", "courseName": "Computer Science Honors Thesis", "info": "Independent work on computer science honors thesis. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 378", "courseName": "Individual Study in Computer Science", "info": "Independent study in computer science. Recent areas include graph algorithms, computer security, distributed computing, graphics, programming languages, software engineering, web retrieval. Prerequisites: junior standing and permission of the instructor."}, {"courseNum": "CSCI 379", "courseName": "Topics in Computer Science", "info": "Current topics of interest. Course may/may not require laboratory depending upon the topic. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 476", "courseName": "Senior Design II", "info": "Students undertake several cycles of delivery, each including a design document, product implementation, testing, and feedback. Students produce technical and user’s manuals for the final version. Class presentations of designs and implementations. Includes public presentation of the final product and design process. Prerequisites: CSCI 475 and permission of the instructor."}, {"courseNum": "DANC 120", "courseName": "Modern Dance Technique I", "info": "Beginning level technique emphasizing the basic principles of different modern dance styles, dynamics and alignment through floorwork, locomotor patterns, improvisation and movement combinations."}, {"courseNum": "DANC 200", "courseName": "Art of Chinese Watersleeve", "info": "Studio training in the classical and folk dance forms of China, including Chinese traditional dance and specialized props, such as watersleeves, fans, ribbons, etc. Dance experience required."}, {"courseNum": "DANC 220", "courseName": "Modern Dance Technique II", "info": "Intermediate level technique exploring the basic principles of different modern dance styles, alignment, dynamics, and musicality through floorwork, locomotor patterns and movement combinations. Prerequisite: DANC 120."}, {"courseNum": "DANC 240", "courseName": "Ballet Technique II", "info": "Intermediate level ballet course emphasizing the development of technique and performance aesthetics."}, {"courseNum": "DANC 262", "courseName": "Dance Composition", "info": "Introduction to the fundamental elements and underlying principles of the craft and art of dance composition emphasizing practical experience in structuring solo and group choreography. Prerequisite: permission of the instructor."}, {"courseNum": "DANC 263", "courseName": "World Dance and Culture", "info": "Study of specific dance technique, performance theory, repertory section, and/or methodology emphasizing an experiential understanding of the specific genre. Prerequisite: permission of the instructor."}, {"courseNum": "DANC 355", "courseName": "Pointe and Variations", "info": "Applied pointe technique emphasizing individual artistic development using classical or contemporary variations appropriate for each student's skill level and interest. Previous pointe experience required."}, {"courseNum": "DANC 360", "courseName": "Rehearsal and Performance", "info": "Quarter-course credit for substantial participation in dance production. Prerequisite: permission of the instructor."}, {"courseNum": "EAST 203", "courseName": "Digital Methods in Chinese Studies", "info": "This course introduces students to digital tools and resources in Chinese studies. Topics include data mining, database design, and data visualization. It combines discussion of digitally-empowered scholarship in Chinese studies and training in the technical know-how. Knowledge of Chinese language, Chinese history, or programming is not required. Crosslisted as HIST 203."}, {"courseNum": "EAST 208", "courseName": "The Red Brush: Women Writers in Imperial China", "info": "In this course we explore the writings of Chinese women from the 1st to the early 20th centuries, and discuss the changing social and historical contexts within which these women wrote, and the obstacles these women writers had to overcome in order to ensure that their voices were heard. Crosslisted as WMST 208."}, {"courseNum": "EAST 226", "courseName": "East Asian Politics", "info": "This course surveys political history, political institutions, economy, and society of major countries in East Asia, with focus on the continuity and changes in politics and policies of China, Japan, and Korea. Crosslisted as IREL 226 and POLS 226."}, {"courseNum": "EAST 229", "courseName": "Late Imperial Chinese Fiction; the Short Stories", "info": "This seminar explores “huaben”, a maturing vernacular fiction genre starting early 17th century in China. We will discuss the social and cultural context that gave rise to this genre, the intersections between this genre and other literary, performative, and artistic genres, as well as its modern implications."}, {"courseNum": "EAST 267", "courseName": "The People's Republic of China", "info": "A historical look at life in China under the rule of the Communist Party.  Unprecedented triumphs and tribulations. Crosslisted as HIST 297."}, {"courseNum": "EAST 322", "courseName": "Independent Study", "info": "Individual programs of reading, research, or writing.  Prerequisite: permission of the instructor."}, {"courseNum": "EAST 382", "courseName": "U.S.-China Relations", "info": "Through tracing the evolution of U.S.-China relations from the 18th century to the present, this course discusses major issues and challenges between the two countries today. Future trends of the bilateral relationship will also be explored. Prerequisite: POLS 170. Preference given to POLS/IREL/EAST majors. Crosslisted as IREL 482 and POLS 382."}, {"courseNum": "EAST 395", "courseName": "East Asian Studies Honors Thesis", "info": "Focused research relevant to department Culminating Experience.  Prerequisite: permission of the instructor. Seniors only."}, {"courseNum": "ECEG 120", "courseName": "Introduction to Electrical and Computer Engineering", "info": "Introduction to the fundamental concepts of electrical and computer engineering. Voltage, current, signals, electrical elements and their laws. Kirchhoff's laws and basic circuit analysis. Digital systems. Electrical measurements. Computational tools and circuit modeling software. Corequisite: MATH 202."}, {"courseNum": "ECEG 226", "courseName": "Circuit Theory II", "info": "Transformers, complex power, three-phase circuits, transients, filters, Fourier series, and Laplace transforms. Corequisite: MATH 212. Prerequisite: ECEG 225 or permission of the instructor."}, {"courseNum": "ECEG 240", "courseName": "Digital System Design", "info": "Comprehensive introduction to modern digital design techniques. Combinational and sequential logic, finite state machines, CAD tools and algorithms, and programmable logic devices. Prerequisite: ECEG 120, or CSCI 206, or permission of the instructor."}, {"courseNum": "ECEG 301", "courseName": "Praxis of Engineering Design", "info": "Project-oriented course that focuses on electrical and computer engineering design as distinct from analysis with the goal of developing skills in prototyping, professional communication, and test and measurement. Prerequisite: junior standing in ECE or permission of the instructor."}, {"courseNum": "ECEG 347", "courseName": "Embedded and Cyber-Physical Systems", "info": "Concepts, principles, tools, and techniques for the design, analysis, and implementation of embedded and cyber-physical systems. Integrative course that draws on topics from across the electrical and computer engineering curriculum. Prerequisites: ECEG 240 and CSCI 203, or permission of the instructor."}, {"courseNum": "ECEG 351", "courseName": "Electronics II", "info": "Basic amplifier circuits, differential amplifiers, frequency response, and feedback concepts. Prerequisite: ECEG 350 or permission of the instructor."}, {"courseNum": "ECEG 390", "courseName": "Theory and Applications of Electromagnetics", "info": "Applications of Maxwell's equations to the solution of problems involving static electric and magnetic fields and transverse electromagnetic waves. Transmission line parameters, wave propagation, reflection from planar surfaces, boundary conditions, polarization, and electromagnetic properties of matter. Prerequisites: ECEG 226 and MATH 212."}, {"courseNum": "ECEG 401", "courseName": "Electrical and Computer Engineering Senior Design", "info": "This project-oriented course is the continuation of capstone design for electrical and computer engineering majors. Students work in teams to develop, implement, and evaluate an effective solution to an open-ended problem. Prerequisite: ECEG 400 or permission of the instructor."}, {"courseNum": "ECEG 473", "courseName": "Digital Speech and Audio Processing", "info": "Theory and application of digital speech and audio processing. Topics include speech and audio (MP3) coding, artificial speech synthesis, automatic speech recognition, and audio effects. Prerequisite: ECEG 320 or permission of the instructor."}, {"courseNum": "ECEG 491", "courseName": "Electrical Energy Conversion", "info": "Three phase power circuits, transformer circuits, rotating machines and equivalent circuits, power electronic switches, machine dynamics, motor generator control. Corequisite: ECEG 390. Prerequisite: ECEG 350 or permission of the instructor."}, {"courseNum": "ECEG 673", "courseName": "Digital Speech/Audio Process.", "info": "Theory and application of digital speech and audio processing. Topics include speech and audio (MP3) coding, artificial speech synthesis, automatic speech recognition, and audio effects."}, {"courseNum": "ECON 103", "courseName": "Economic Principles and Problems", "info": "General introduction to both macroeconomics and microeconomics, along with an introduction to economic history, international economics, and political economy. The course also examines the origin of economic ideas in the works of Adam Smith, John Maynard Keynes, Karl Marx, and others."}, {"courseNum": "ECON 227", "courseName": "International Economics", "info": "An examination of international economic relations today and of the theory used to analyze trade and financial relations.  Attention is given to the problems of government policy with respect to international issues.  Prerequisite: ECON 103 or permission of the instructor."}, {"courseNum": "ECON 235", "courseName": "African Economic Development", "info": "A historical, institutional analysis of Sub-Saharan African economic, social, and political development. Primary emphasis will be on the analysis of the economic crisis facing the subcontinent since the late '70s and the structural adjustment programs that have been instituted to deal with the crisis. Prerequisite: ECON 103."}, {"courseNum": "ECON 238", "courseName": "Urban Economics", "info": "Study of household and business location decisions, and public policies aimed at congestion, pollution, and crime. Prerequisite: ECON 103. First- and second-year standing, others by permission."}, {"courseNum": "ECON 256", "courseName": "Intermediate  Microeconomic", "info": "Intermediate economic theory of the consumer, the firm, market structures, and resource allocation. Not open to students who have completed ECON 259. Prerequisite: ECON 103 and ACFM majors or permission of the instructor."}, {"courseNum": "ECON 257", "courseName": "Intermediate Macroeconomic", "info": "The study of national income, employment, inflation, interest rates, and the impact of monetary and fiscal policy on the economy. Prerequisite: ECON 103 and MATH 192 or MATH 201."}, {"courseNum": "ECON 258", "courseName": "Intermediate Political Economy", "info": "Intermediate study of Marxist and institutionalist political economy. The ideas of Marx and Veblen applied to such matters as the distribution of income and power, the environment, working conditions, consumerism, and race and gender issues. Prerequisite: ECON 103."}, {"courseNum": "ECON 259", "courseName": "Intermediate Mathematical Microeconomics", "info": "Intermediate microeconomic theory of the consumer, the firm, market structures, and resource allocation. Topics are introduced using differential calculus. Not open to students who have completed ECON 256. Prerequisites: ECON 103 and MATH 192 or MATH 201."}, {"courseNum": "ECON 280", "courseName": "Political Economy of Media and Advertising", "info": "Examines the interrelationship of cultural, political, and economic aspects of media content and advertising from the perspective of Institutional and Marxian political economy.  Prerequisite: ECON 103 or permission of the instructor."}, {"courseNum": "ECON 311", "courseName": "Labor Economics", "info": "An examination of economic models related to labor markets, current labor market trends, and the influence of related government policies. Prerequisites: ECON 256 or ECON 259 and one semester of statistics. Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 327", "courseName": "International Economic Theory", "info": "Covers trade theory, tariffs and non-tariff barriers, economic integration, balance of payments, fixed and flexible exchange rates. Prerequisites: ECON 256 or ECON 259 and ECON 257."}, {"courseNum": "ECON 328", "courseName": "Money and Financial Institutions", "info": "An analysis of the role of the financial system in the U.S. economy. Topics include determinants of asset prices, risk management, and financial regulations. Prerequisites: ECON 256 or ECON 259 and ECON 257 and MATH 216 or MATH 226 or MGMT 102 . Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 333", "courseName": "Seminar in Economic Topics", "info": "Guided discussion of economic issues.  Topics to be announced at time of preregistration.  Prerequisite: permission of the instructor. Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 339", "courseName": "China and East Asian Economics", "info": "An analysis of economic transition and development in China, with emphasis on its role in the Asia-Pacific and world economies."}, {"courseNum": "ECON 341", "courseName": "Econometrics", "info": "The application of statistical methods to quantify and test economic theories, analyze government policies, and forecast economic variables."}, {"courseNum": "ECON 405", "courseName": "Comparative Economic Systems", "info": "A critical analysis of the organization of economic systems. The characteristics of selected capitalist and socialist economics studied and assessed from both mainstream and Marxian analytical perspectives. Prerequisite: ECON 258 or permission of the instructor. Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 410", "courseName": "Risk Management in Financial Markets", "info": "The course is focused on the applications of finance theory in asset pricing and risk management. The topical coverage will extend to fixed income, equity securities, European options, derivatives, risk analysis, and hedging strategies. Statistics and Econometrics skills are often used in the course assignments."}, {"courseNum": "ECON 429", "courseName": "Political Economy of Financial Crises", "info": "This course will explore the causes and consequences of financial crises from macroeconomic perspectives, with most of the attention given to the recent financial crisis in the United States. Prerequisite: ECON 258 or permission of the instructor. Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 441", "courseName": "Advanced Econometrics", "info": "Advanced panel data methods, instrumental variables and two stage least squares, simultaneous equations, limited dependent variables, sample selection bias, advanced time series, and writing and presenting an empirical research project. Prerequisite: ECON 341."}, {"courseNum": "ECON 444", "courseName": "Senior Seminar in Economic Topics", "info": "Topics to be announced at the time of preregistration."}, {"courseNum": "EDUC 101", "courseName": "Social Foundation of Education", "info": "Historical, economic, philosophical, and social foundations of education, and their implications for present-day education in America. Provides a background of information for the prospective teacher and citizen. Not open to seniors."}, {"courseNum": "EDUC 201", "courseName": "Educational Psychology", "info": "Role of psychological concepts in educational practices. Nature, sources of individual differences in development and readiness. Learning theory, motivation, and emotion in learning.  Issues in identifying and supporting the learning of all students. Measurement and evaluation of learning."}, {"courseNum": "EDUC 227", "courseName": "Immigrant Youth in U.S. Society", "info": "This course examines the varied trajectories in contemporary immigrant youth adaptations across social contexts, including schools, families, peer groups and work. Crosslisted as EDUC 627."}, {"courseNum": "EDUC 230", "courseName": "Foundations of Classroom Assessment", "info": "Use of observation, documentation, and assessment to develop instructional practices that support learning of all children. Includes assessment across environments and for different purposes. Prerequisite: EDUC 201 and junior status or permission of the instructor."}, {"courseNum": "EDUC 240", "courseName": "Literacy and Learning in the Diverse Classroom", "info": "This course examines how diverse adolescents engage in literacy across content areas, developing abilities to decode, interpret, and use sign systems to gain access to secondary school content knowledge. Other topics include classroom management, curriculum integration and curriculum planning. Required fieldwork. Prerequisites: EDUC 101 and EDUC 201. Crosslisted as EDUC 640."}, {"courseNum": "EDUC 290", "courseName": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Prerequisite: EDUC 201 or permission of the instructor. Crosslisted as WMST 290 and EDUC 690."}, {"courseNum": "EDUC 305", "courseName": "Advanced Educational Psychology", "info": "Both the theories and practical applications of cognitive psychology and development are emphasized. How theories connect to the field of cognitive neuroscience also is addressed.  Prerequisites: EDUC 201 and permission of the instructor. Crosslisted as EDUC 605."}, {"courseNum": "EDUC 317", "courseName": "Problems in Education", "info": "Research on a problem not involved in a student thesis. Upperclass students. Prerequisite: permission of the instructor. Crosslisted as EDUC 617."}, {"courseNum": "EDUC 318", "courseName": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education. Crosslisted as EDUC 618."}, {"courseNum": "EDUC 319", "courseName": "Group Processes", "info": "This course presents basic dynamics, theoretical components, and developmental aspects of group processes with clients. Students will participate in a group exercises as members and leaders. Crosslisted as EDUC 619."}, {"courseNum": "EDUC 334", "courseName": "Later Childhood and Adolescence", "info": "Uses theory, case studies, and field experience to illustrate early and later adolescent development. Required field work. Not open to students who have taken EDUC 335 or EDUC 635. Crosslisted as EDUC 634."}, {"courseNum": "EDUC 341", "courseName": "Early Literacy", "info": "A study of the strategies and techniques involved in teaching children to read and to write  (Pre-K-4 level). Contemporary theories of reading behavior. Required field work. Prerequisites: EDUC 101 and EDUC 201. Crosslisted as EDUC 641."}, {"courseNum": "EDUC 343", "courseName": "Culture and Community", "info": "Consideration of special problems arising in teaching social studies in elementary and secondary schools. Influences determining course content, including state and national standards. Prerequisite: junior status or permission of the instructor. Crosslisted as EDUC 643."}, {"courseNum": "EDUC 346", "courseName": "Literacy Across Contexts", "info": "This course will explore principles of creating a developmentally appropriate elementary learning environment. Emphasis is placed on writing as process, designing literacy instruction and using approaches to management appropriate to learners of various levels of cognitive, emotional, and social development. Prerequisite: Junior status or permission of instructor. Crosslisted as EDUC 646."}, {"courseNum": "EDUC 347", "courseName": "Family, School, and Community Partnerships", "info": "Students will explore important factors and effective strategies in creating and sustaining respectful, reciprocal, supportive and empowering relationships with families to enhance children's development and learning. Prerequisite: junior or senior status or permission of the instructor. Field experience and clearances are required."}, {"courseNum": "EDUC 359", "courseName": "Student Teaching: Secondary", "info": "Supervised practice in the design and implementation of instruction in secondary school classrooms. Emphasis on professional conduct and use of theory to inform practice.  Corequisite: EDUC 459. Crosslisted as EDUC 659."}, {"courseNum": "EDUC 362", "courseName": "Quantitative Research Methods", "info": "This course emphasizes the design of quantitative research and the development of skills in analyzing and interpreting data. Quantitative research in education and psychology is critiqued in terms of theory, past research, hypothesis generation, and research design. Data input and analysis involves the use of the statistical software package SPSS. Crosslisted as EDUC 662."}, {"courseNum": "EDUC 375", "courseName": "Methods of Teaching English as a Second Language", "info": "This course focuses on preparing students to teach students for whom English is their second language (ESL). It focuses on three primary areas: instructional materials development for ESL; assessment and support of ESL students; and cultural awareness and sensitivity. Crosslisted as EDUC 675."}, {"courseNum": "EDUC 376", "courseName": "English as a Second Language Internship / Professional Seminar", "info": "Internship (60 hours) at varying grade levels under the supervision of certified ESL teachers in local schools with weekly professional seminar. ESL Program Specialists only. Prerequisite: permission of the instructor."}, {"courseNum": "EDUC 425", "courseName": "Internship in Education", "info": "Supervised practice in an educational setting including a structured reflection component. This course may be used to fulfill the Culminating Experience course requirement for the B.A. in education."}, {"courseNum": "EDUC 439", "courseName": "Student Teaching in Music", "info": "Student teaching in music.  Corequisite: MUSC 335.  Prerequisite: permission of the instructor."}, {"courseNum": "EDUC 459", "courseName": "Professional Seminar in Secondary Education", "info": "Systematic approach to the observation, interpretation, verification, and remediation of problems affecting student learning. Psychological and sociological theory informing teaching practice. Implications of student diversity for adaptation of instruction.  Prerequisite: permission of the instructor.  Corequisite: EDUC 359."}, {"courseNum": "EDUC 605", "courseName": "Advanced Educational Psych", "info": "Both the theories and practical applications of cognitive psychology and development are emphasized. How theories connect to the field of cognitive neuroscience also is addressed. Prerequisite: permission of the instructor. Crosslisted as EDUC 305."}, {"courseNum": "EDUC 617", "courseName": "Problems in Education", "info": "Research on a problem not involved in a student thesis. Prerequisite: permission of the instructor. Crosslisted as EDUC 317."}, {"courseNum": "EDUC 618", "courseName": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education. Crosslisted as EDUC 318."}, {"courseNum": "EDUC 619", "courseName": "Group Processes", "info": "This course presents basic dynamics, theoretical components, and developmental aspects of group processes with clients. Students will participate in a group exercises as members and leaders. Crosslisted as EDUC 319."}, {"courseNum": "EDUC 634", "courseName": "Later Childhood & Adolescence", "info": "Uses theory, case studies, and field experience to illustrate early and later adolescent development. Required field work. Not open to students who have taken EDUC 335 or EDUC 635. Crosslisted as EDUC 334."}, {"courseNum": "EDUC 662", "courseName": "Quantitative Research Methods", "info": "This course emphasizes the design of quantitative research and the development of skills in analyzing and interpreting data. Quantitative research in education and psychology is critiqued in terms of theory, past research, hypothesis generation, and research design. Data input and analysis involves the use of the statistical software package SPSS. Crosslisted as EDUC 362."}, {"courseNum": "EDUC 681", "courseName": "Master's Treatise", "info": "Master's Treatise. Prerequisite: permission of the instructor."}, {"courseNum": "EDUC 690", "courseName": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Prerequisite: permission of the instructor. Crosslisted as EDUC 290 and WMST 290."}, {"courseNum": "EDUC 697", "courseName": "College Stdnt Personnel Intern", "info": "Supervised practice in student affairs, together with group reflection. May be repeated for up to two credits. Prerequisite: permission of the instructor."}, {"courseNum": "ENCW 101", "courseName": "Creative Writing", "info": "Introduction to creative writing through the reading and writing of poetry and prose (fiction or creative nonfiction). Does not count toward the creative writing concentration or minor. Prerequisite: seniors by permission of the instructor."}, {"courseNum": "ENCW 102", "courseName": "Writing Fiction", "info": "In this introductory fiction workshop, students will read and discuss contemporary and classic texts with a writer’s eye. Completing fiction exercises and revisions as well as responding to one another’s work, they will use the techniques and habits of successful writers to enhance their own writing and creativity."}, {"courseNum": "ENCW 202", "courseName": "Fiction Workshop", "info": "Principles of writing fiction, with constant practice. Designed for students planning to concentrate or minor in creative writing. Preference given to juniors, sophomores, and first-year students. Restrictions: seniors by permission of the instructor."}, {"courseNum": "ENCW 204", "courseName": "Poetry Workshop", "info": "Principles of writing poetry, with constant practice. Designed for students planning to concentrate or minor in creative writing. Preference given to juniors, sophomores, and first-year students. Prerequisite: seniors by permission of the instructor."}, {"courseNum": "ENCW 210", "courseName": "Special Topic in Creative Writing", "info": "Studies in such topics as prosody, stylistics, characterization, or narrative theory. Course emphasizes formal or structural elements within particular genres and an appreciation of craft from a writer's perspective. Prerequisite: permission of the instructor."}, {"courseNum": "ENCW 211", "courseName": "Topics: Writing Foreign Places", "info": "This course in the reading and writing of personal narrative essays and short fiction about foreign places is designed for students interested in writing out of experiences of travel and/or other kinds of cultural displacement. Each student will define \"foreign\" in relation to him or herself."}, {"courseNum": "ENCW 221", "courseName": "Topics: Short Short Fiction", "info": "Developing a sense of the foundational elements of short form fiction through reading and discussion of a variety of American and international writers, students will challenge conventions as they draft their own short form fiction and respond to one another’s work."}, {"courseNum": "ENCW 230", "courseName": "Topics: Writing Nature", "info": "This creative writing “form and theory” course explores writing about nature in several traditions with attention to the ways in which nature is inscribed in language and expressed by literary forms. It examines critical moments in the evolution of cultural awareness of nature in the West. Prerequisite: permission of instructor."}, {"courseNum": "ENCW 237", "courseName": "Internship", "info": "Two competitive internships are offered: Stadler Center Internship provides practical experience in and insight into arts management; West Branch Internship provides practical experience in and insight into literary publishing. Prerequisite: permission of the instructor."}, {"courseNum": "ENCW 241", "courseName": "Topics: Poetry, Mind, Nature", "info": "In the reading and writing of poetry that observes the natural world explores the relationship between such poetry and the human imagination. The course involves workshops as well as fieldwork, which provides material for poems and increases students' ability to identify local flora and fauna. Prerequisite: permission of the instructor."}, {"courseNum": "ENCW 302", "courseName": "Advanced Fiction Workshop", "info": "Advanced workshop in the writing of fiction. Prerequisites: Any 200-level Creative Writing (ENCW) course in creative nonfiction or fiction and permission of the instructor. Crosslisted as ENCW 602."}, {"courseNum": "ENCW 303", "courseName": "Advanced  Creative Nonfiction Workshop", "info": "Advanced workshop in the writing of creative nonfiction. Prerequisites: Any 200-level Creative Writing (ENCW) course in creative nonfiction  or fiction  and permission of the instructor. Crosslisted as ENCW 603."}, {"courseNum": "ENCW 304", "courseName": "Advanced Poetry Workshop", "info": "Advanced workshop in the writing of poetry. Prerequisites: Any 200-level Creative Writing (ENCW) course in poetry  and permission of the instructor. Crosslisted as ENCW 608."}, {"courseNum": "ENFS 130", "courseName": "Introduction to Film/Media Studies", "info": "Introduction to film grammar, history, genres, and movements using theoretical text and primary source films. Emphasis on critical thinking skills through video essay projects."}, {"courseNum": "ENFS 238", "courseName": "Special Topics in Film Studies", "info": "Examination of a specialized topic in film studies. Weekly screenings."}, {"courseNum": "ENFS 245", "courseName": "Televisual Culture", "info": "This course focuses on non-cinematic moving image culture including the television industry, video art, and new media technologies. The course examines the subject from a variety of theoretical viewpoints—industrial practices, stylistic modes, and audience reception."}, {"courseNum": "ENFS 248", "courseName": "Intermediality: Italy, Film, and the Arts", "info": "This IP course will focus on intermediality, film, and Italy. It seeks to examine the relationships of cinema with the other arts, in particular the arts of Italy. Crosslisted as ITAL 248 and UNIV 248."}, {"courseNum": "ENFS 335", "courseName": "Special Topics in Film/Media Production", "info": "This advanced seminar focuses on specific production (lighting, cinematography) and post-production (sound design, color grading) areas to provide students with an in-depth knowledge of specialized production skills. Prerequisites: ENFS 238 or ENFS 253 or ENFS 254."}, {"courseNum": "ENFS 337", "courseName": "Seminar in Film Theory", "info": "Survey of approaches to film analysis and critique, ranging from realist/formalist debates to psychoanalytic, feminist, and semiotics approaches. Weekly screenings. Prerequisite: ENFS 130 and permission of the instructor."}, {"courseNum": "ENFS 340", "courseName": "Film/Media Production Practicum", "info": "The Film/Media Production Practicum provides students with advanced and specialized study in a particular area of Film/Media production. Possible practicum topics might include advanced sound design, color grading, visual effects works, or specialized cinematography techniques."}, {"courseNum": "ENGR 101", "courseName": "Engineering Graphics", "info": "Introduction to engineering graphics including drawing with drafting instruments, computer-aided drafting and surveying."}, {"courseNum": "ENGR 200", "courseName": "Thermodynamics", "info": "Properties, first law, second law, entropy, availability, efficiency, pure substances, real gases. Introduction to heat transfer. Prerequisite: MATH 201."}, {"courseNum": "ENGR 212", "courseName": "Engineering Computation", "info": "An in-depth introduction to using computers as a fundamental tool for solving civil engineering problems. Course will include: structured programming, and numerical methods. Prerequisite: MATH 222 or equivalent. Not open to students who have taken ENGR 211."}, {"courseNum": "ENGR 214", "courseName": "Computational Analysis", "info": "Introduction to a modern computer language. Structured programming and algorithm design for engineering problems involving linear algebra, statistical analysis of data, and elementary numerical analysis. Introduction and use of a scientific application package as a tool. Not open to students who have taken ENGR 211 or ENGR 212. Open to mechanical engineering students only."}, {"courseNum": "ENGR 215", "courseName": "Experimental Design and Data Analysis", "info": "Introduction to the analysis of experimental and industrial data. Topics include statistical inference, analysis of variance, regression analysis, experimental design and computational methods. With computational laboratory. Not open to students who have taken BMEG 226, MATH 216, or MATH 226."}, {"courseNum": "ENGR 221", "courseName": "Mechanics", "info": "Equilibrium of two- and three-dimensional force systems. Friction. Kinematics and kinetics of particles and rigid bodies. Corequisite: MATH 212 or MATH 222. Not open to civil and environmental engineering and mechanical engineering students. Not open to students who have taken ENGR 229 or MECH 220."}, {"courseNum": "ENGR 222", "courseName": "Civil Engineering Fluid Mechanics", "info": "Fluid properties and hydrostatics. Flow concepts and basic equations. Viscous flow in pipes and channels. Steady pipe flow. Potential flow. Introduction to open channels or hydraulic machinery. Prerequisite: ENGR 229."}, {"courseNum": "ENGR 229", "courseName": "Solid Mechanics I", "info": "Equilibrium of rigid body systems, including analysis of trusses, beams, and frames for internal forces and moments. Introduction to stress and strain, including their relationship and stress transformations. Prerequisite: MATH 201."}, {"courseNum": "ENGR 233", "courseName": "Chemical Engineering Fluid Mechanics", "info": "Fluid statics, laminar and turbulent flow of incompressible fluids; introduction to compressible and non-Newtonian fluids; nature of forces, momentum transfer, shell balances; dimensional analysis; applications to pipe flow, drag, fluid measurement and pump design. With experimental laboratory. Corequisite: CHEG 210 or MATH 212."}, {"courseNum": "ENGR 240", "courseName": "Science of Materials", "info": "Study of the relationships between atomic structure and observable properties of materials. Properties of metallic, ceramic, and polymeric materials. Selection of materials for engineering applications. Measurement and modification of material properties. With experimental laboratory. Pre/Corequisite: one of the following: CHEM 201, 211, 221, 222, or equivalent, or instructor permission."}, {"courseNum": "ENGR 242", "courseName": "Materials Engineering", "info": "Elements of science of materials. Evaluation and control of properties of common civil engineering materials, including steel, concrete, wood and polymers. Laboratory tests of materials. Visitation trips to see fabrication and quality management procedures of selected materials. Prerequisite: ENGR 229."}, {"courseNum": "ENGR 453", "courseName": "Interdisciplinary Senior Design II", "info": "Second semester of the interdisciplinary engineering design sequence emphasizing fabrication, instrumentation, testing and evaluation, development and roll-out, and final presentation of projects."}, {"courseNum": "ENLS 101", "courseName": "Literature and Composition", "info": "Introduction to the critical study of literature and instruction in composition. First-year students only; others by permission of the instructor."}, {"courseNum": "ENLS 109", "courseName": "Public Speaking in the 21st Century", "info": "Introduction to public speaking with a focus on historical speeches. Study and practice of speech writing and organization, verbal and nonverbal communication."}, {"courseNum": "ENLS 199", "courseName": "Survey: English and American Literature", "info": "A survey of major authors, texts, concepts, and developments in English and American literature with participation of weekly guest lecturers from the English department."}, {"courseNum": "ENLS 200", "courseName": "Ways of Reading", "info": "Introduction to literary creation, criticism, and theory, with emphasis on reader/writer; text; context; and identity."}, {"courseNum": "ENLS 203", "courseName": "Introductory Topics in Race and Literature", "info": "Intro to Literary Race Studies will examine the social phenomenon of race as it is expressed, queried, and subverted in literature. It will focus on minority and ethnic literatures of North America but extend to global literatures and theoretical models involving issues of race."}, {"courseNum": "ENLS 207", "courseName": "American Romanticism 1800-1865", "info": "Examination of selected texts in various genres, read in their cultural contexts."}, {"courseNum": "ENLS 214", "courseName": "US Latino/a Literature", "info": "Introduction to literature written in English by Latinos/as in the United States. The course readings will include creative writing by various Latino/a groups, for example, Mexican-Americans, Puerto Ricans, Cuban-Americans, and Dominican-Americans. Additionally, the class will expose students to a variety of interpretive frameworks via secondary sources in US Latino/a Studies."}, {"courseNum": "ENLS 216", "courseName": "Studies in American Literary Genres", "info": "Study of a selected genre of texts in American Literature."}, {"courseNum": "ENLS 218", "courseName": "Studies in Children's Literature", "info": "Fairy tales, fantasy, animal fables, and tales of adventure from 19th - 20th centuries, with a sampling of contemporary films, primarily American."}, {"courseNum": "ENLS 221", "courseName": "Introduction to African American Literature", "info": "Provides a selection from across the vast array of examples collected under the inadequate rubric “African American Literature.” We'll read poetry, fiction, non-fiction, and drama in order to understand how a group of people who have been written out of American history and culture write themselves back into these stories. Crosslisted as AFST 221."}, {"courseNum": "ENLS 222", "courseName": "Ethnic Comedy in the United States", "info": "History, theory, and practice of comedy in the United States, focused on works by comedians of many ethnicities. The course explores how comedy contributes to the national conversation on race, sometimes soothing social tensions with laughter and at other times sparking ethnic conflict."}, {"courseNum": "ENLS 223", "courseName": "Questioning the Post-Racial", "info": "The term “post-racial” has emerged within public discourse from time to time over the course of America’s existence. From Frederick Douglass to Barack Obama, this expression has described an American aspirational goal. Our class will take a contemporary and literary approach to understanding the limits of the term. Crosslisted as AFST 223."}, {"courseNum": "ENLS 228", "courseName": "Gender and Sexuality in America", "info": "Literature and popular culture exploring such topics as construction of gender identities, sexualities, GLBT cultures and gender-based violence."}, {"courseNum": "ENLS 245", "courseName": "Terror with a Human Face: Literary Resistance to Revolutionary Violence", "info": "Examines how writers--in fiction, satire, and literary journalism--have resisted official justification of mass violence and cultural genocide in the name of social revolution. Explores works such as Orwell's 1984, Koestler's Darkness at Noon, Zamyatin's We, Solzhenitsyn's The Gulag Archipelago, and Arendt's The Origins of Totalitarianism."}, {"courseNum": "ENLS 251", "courseName": "Studies in Renaissance Literature", "info": "Selected major prose and poetry."}, {"courseNum": "ENLS 257", "courseName": "Shakespeare", "info": "Selected plays."}, {"courseNum": "ENLS 286", "courseName": "The Modern Novel", "info": "Selected major novelists (English, Irish, continental, American)."}, {"courseNum": "ENLS 288", "courseName": "Studies in Contemporary Literature", "info": "An intensive study of selected British and American authors of the past 40 years."}, {"courseNum": "ENLS 290", "courseName": "Special Topics", "info": "Flexible in subject matter and in method. Topics such as Literature and Psychology, Literature and Myth, Science Fiction."}, {"courseNum": "ENLS 321", "courseName": "Seminar in African-American Literature", "info": "Study of selected thematic, aesthetic and ideological issues in Black American writing. Crosslisted as ENLS 621."}, {"courseNum": "ENLS 341", "courseName": "The Hidden God of Nature: Christian Ecopoetics from Chaucer to Dostoevsky", "info": "Explores how great works  of European literature  related nature and culture in Christian traditions from  the 14th to the 19th century.  Analyzes their legacy for environmental ethics and cultural creativity as a part of sustainability. Includes non-Christian and secular critiques in considering poetic, rhetorical, symbolic, and spiritual approaches to ecology. Crosslisted as ENST 341 and ENLS 641."}, {"courseNum": "ENLS 350", "courseName": "Seminar in Renaissance Literature", "info": "Special topics. Student reports, oral and written. Crosslisted as ENLS 650."}, {"courseNum": "ENLS 370", "courseName": "Seminar in 19th-century English Literature", "info": "Examination of a wide range of poetry and prose by selected authors with emphasis given to the literature's historical and cultural groundings. Prerequisite: permission of the instructor. Crosslisted as ENLS 670."}, {"courseNum": "ENLS 379", "courseName": "Senior Thesis", "info": "The writing of a scholarly or creative departmental senior thesis. Students must confer with and submit a proposal to an adviser prior to registering for the thesis."}, {"courseNum": "ENLS 621", "courseName": "Seminar in African American Literature", "info": "Study of selected thematic, aesthetic, and ideological issues in Black American writing. Prerequisite: permission of the instructor. Crosslisted as ENLS 321."}, {"courseNum": "ENLS 641", "courseName": "The Hidden God of Nature: Christian Ecopoetics from Chaucer to Dostoevsky", "info": "Explores how great works of European literature related nature and culture in Christian traditions from the 14th to the 19th century. Analyzes their legacy for environmental ethics and cultural creativity as a part of sustainability. Includes non-Christian  and secular critiques in considering poetic, rhetorical, symbolic,  and spiritual  approaches to ecology. Crosslisted as ENLS 341 and ENST 341."}, {"courseNum": "ENLS 650", "courseName": "Seminar in Renaissance Literature", "info": "Specialized studies in the contexts and controversies of the poetry and prose of the 16th and early 17th centuries. Prerequisite: permission of the instructor. Crosslisted as ENLS 350."}, {"courseNum": "ENLS 670", "courseName": "Seminar in 19th-Century English Literature", "info": "Examination of a wide range of poetry and prose by selected authors with emphasis given to the literature's historical and cultural groundings. Prerequisite: permission of the instructor. Crosslisted as ENLS 370."}, {"courseNum": "ENST 100", "courseName": "Introduction to Environmental Studies", "info": "A survey of environmental issues intended for non-majors. Students will understand the cultural, political, historical, economic and ethical complexities of environmental problems and their responses. Intended for first-year students and sophomores. Does not count toward either the Environmental Studies or Environmental Science major."}, {"courseNum": "ENST 201", "courseName": "Environmental Problems-Sustainable Futures", "info": "Develops a working understanding of the core concepts linked to environmental studies and introduces skills such as posing researchable questions, gathering data, presenting oral arguments, and applying these skills in group projects. Intended only for students majoring or intending to major in Environmental Studies or Environmental Science."}, {"courseNum": "ENST 205", "courseName": "Green Utopias", "info": "Introduction to literary utopias and to the cultural writings of various ecological movements offering alternative concepts to the increasing destruction of nature."}, {"courseNum": "ENST 208", "courseName": "Principles of Ecology and Evolution", "info": "Introduction to ecology and evolutionary biology, organism interactions with environment, biodiversity, energy flow, and nutrient cycling, with emphasis on human influences on living systems and applications of evolutionary biology and ecology to solving environmental problems. This course is intended primarily for students majoring in environmental studies. Crosslisted as BIOL 208E."}, {"courseNum": "ENST 209", "courseName": "Rainforests and Ecopolitics in Latin America", "info": "Focusing on Amazonia as a key region in global environmental politics, the course examines climate policy debates and recent shifts in global environmentalism. Crosslisted as ANTH 202 and LAMS 202."}, {"courseNum": "ENST 211", "courseName": "Environmental Pollution and Control", "info": "Introduction for non-engineering students to the major areas of environmental engineering. Topics include environmental chemistry, biology and ecology, water and air pollution and treatment, solid and hazardous wastes, sustainability, and global climate issues. Not open to students who have taken CEEG 340."}, {"courseNum": "ENST 234", "courseName": "Human Ecology", "info": "A general science course in human ecology, to demonstrate the ways humans continue to adapt to their environment through biological, cultural, scientific, symbolic, political, and technical means. Crosslisted as GEOG 234."}, {"courseNum": "ENST 236", "courseName": "Environmental Ethics", "info": "A survey of the major theories of environmental ethics, with particular attention to the challenge of developing an ethic commensurate with increasing human power. Crosslisted as RELI 226."}, {"courseNum": "ENST 240", "courseName": "Sustainable Resource Management", "info": "Focuses on problem-oriented policy analysis of domestic and international environmental issues including ecosystem management, endangered species, protected areas, and community-based conservation."}, {"courseNum": "ENST 295", "courseName": "Topics in Environmental Studies", "info": "Selected issues in environmental studies."}, {"courseNum": "ENST 315", "courseName": "Cold Places", "info": "A seminar exploring the nature and culture of cold places -- glaciers, mountain tops, Antarctica, and the Arctic -- through art, film, literature, science, and popular media."}, {"courseNum": "ENST 341", "courseName": "The Hidden God of Nature: Christian Ecopoetics from Chaucer to Dostoevsky", "info": "Explores how great works of European literature related nature and culture in Christian traditions from the 14th to the 19th century. Analyzes their legacy for environmental ethics and cultural creativity as part of sustainability today. Includes non-Christian  and secular critiques in considering poetic, rhetorical, symbolic,  and spiritual  approaches to ecology. Crosslisted as ENLS 341 and ENLS 641."}, {"courseNum": "ENST 350", "courseName": "Senior Thesis", "info": "Independent thesis work under adviser's supervision.  Prerequisite: permission of the instructor."}, {"courseNum": "ENST 353", "courseName": "Ecosystem Ecology", "info": "Interactions between organisms and the physical and chemical environment including nutrient cycling and energy flow, biogeochemistry, and temporal and spatial dynamics of ecosystems.  Prerequisites: BIOL 208, junior or senior status, and permission of the instructor. Crosslisted as BIOL 353 and BIOL 653."}, {"courseNum": "ENST 411", "courseName": "Environmental Community Projects", "info": "Community-based \"clinic\" course on environmental problems or projects for local stakeholders, based on integrative, interdisciplinary research and design. Preference to senior ENST, ENSC, and GEOG majors. Crosslisted as GEOG 420."}, {"courseNum": "FOUN 098", "courseName": "Foundation Seminar", "info": "A small writing-intensive first-year seminar. Also see RESC 098."}, {"courseNum": "FREN 101", "courseName": "Discovering French", "info": "Beginning language skills. Practice in listening, speaking, reading, and writing; elementary grammar; and introduction to French civilization. Prerequisite: no more than two years of secondary school French or permission of the instructor."}, {"courseNum": "FREN 102", "courseName": "Exploring French", "info": "Continuation of language skills. Practice in listening, speaking, reading, and writing; grammar; readings in literature and civilization. Prerequisite: FREN 101 or one year of secondary school French."}, {"courseNum": "FREN 103", "courseName": "Building Proficiency in French", "info": "A review of basic grammar emphasizing all four language skills and culture. Prerequisite: FREN 102 or equivalent (three years of secondary school French)."}, {"courseNum": "FREN 104", "courseName": "Communicating in Context", "info": "Continuing review of basic grammar emphasizing all four language skills and culture. Prerequisite: FREN 103 or four years of secondary school French."}, {"courseNum": "FREN 202", "courseName": "Intermediate French Conversation II", "info": "Concentration on development of speaking skill. Conducted entirely in French by native speaker. Not open to students who have studied in France or other French-speaking countries. Intended for students enrolled in 200-level courses. Prerequisite: FREN 104 or FREN 150 or equivalent. (Cannot be applied toward the French major or minor)"}, {"courseNum": "FREN 236", "courseName": "Topics in Francophone Literature and Culture", "info": "Study of the literature, language, geography, history, music, and film of a particular Francophone region (French Caribbean, Quebec, West Africa, Maghreb, etc.). Prerequisite: FREN 104."}, {"courseNum": "FREN 295", "courseName": "Topics in French Studies", "info": "Topics vary but permit study of one or several subjects in French or Francophone literature, culture and civilization.  Prerequisites: FREN 104 and permission of the instructor."}, {"courseNum": "FREN 302", "courseName": "Advanced French Conversation II", "info": "Advanced conversation for students who have studied in France or other French-speaking countries. Conducted entirely in French by native speaker. May not be taken by native speakers of French. (Cannot be applied toward the French major or minor)"}, {"courseNum": "FREN 370", "courseName": "Topics in Civilization", "info": "Advanced study in themes, topics, or periods in French or Francophone history or civilization. Prerequisite: a minimum of two courses at the 200-level or permission of instructor."}, {"courseNum": "FREN 395", "courseName": "Seminar in French Studies", "info": "Topics vary, but permit detailed study of any one of innumerable subjects in French literature and civilization.  Prerequisite: a minimum of two courses at the 200-level or permission of instructor."}, {"courseNum": "GEOG 101", "courseName": "Globalization, People, and Place", "info": "Investigates the world from a spatial perspective to understand the complexity of places and the dynamic relationship between peoples and the world they inhabit. Open to first-years and sophomores."}, {"courseNum": "GEOG 200", "courseName": "Independent Study", "info": "Supervised independent study, readings, and preparation of a paper in conjunction with the Bucknell in Nicaragua summer program. Prerequisite: permission of the instructor."}, {"courseNum": "GEOG 202", "courseName": "Solving Problems With Maps", "info": "Maps are powerful tools for solving social, technical, and individual problems. This examines the principles of map-making and map use."}, {"courseNum": "GEOG 204", "courseName": "Applied G.I.S.", "info": "Introduction to the use of Geographical Information Systems to collect, structure, and display large or complex spatial data sets, using examples from human and physical geography. Prerequisite: permission of the instructor."}, {"courseNum": "GEOG 209", "courseName": "Economic Geography", "info": "Inquiry into local and global changes in economic activity, location and spatial organization, especially focusing on implications for the well-being of people in particular places."}, {"courseNum": "GEOG 214", "courseName": "Europe in an Age of Globalization", "info": "Examines the European Union -a unique project that is neither federation nor intergovernmental organization -amidst increasing discord and disunion. Considers common issues such as nationalism, immigration, democracy and the economy from a geographical perspective; ie. their manifestation in different places, and the role that different places play in their manifestation."}, {"courseNum": "GEOG 216", "courseName": "Borders and Politics of Mobility", "info": "Explores the politics of contemporary nation state borders, issues of territory, sovereignty, mobility, migration, identity, citizenship, statelessness, and focuses on borders at other scales. Crosslisted as IREL 216."}, {"courseNum": "GEOG 234", "courseName": "Human Ecology", "info": "A general science course in human ecology, to demonstrate the ways humans continue to adapt to their environment through biological, cultural, scientific, symbolic, political, and technical means. Crosslisted as ENST 234."}, {"courseNum": "GEOG 236", "courseName": "Third World Development", "info": "Socio-cultural, economic, and environmental problems confronting developing countries. Includes such topics as political-economic change in a global and local context, transnational corporations, gender relations, food production/consumption, urbanization, and sustainable development."}, {"courseNum": "GEOG 265", "courseName": "Geography of Pennsylvania", "info": "Exploring the landscape, industry, culture, and history of Pennsylvania; using this example to understand the broad themes of human geography."}, {"courseNum": "GEOG 326", "courseName": "Thinking Space: Critical Reflections on Research", "info": "With an eye toward research design, proposal and grant writing, students will critically engage the role of the University in imagining, creating and understanding place. Students will think about space, how to study it, and, in turn, how studying space produces it."}, {"courseNum": "GEOG 420", "courseName": "Environmental Community Projects", "info": "Community-based \"clinic\" course on environmental problems or projects for local stakeholders, based on integrative, interdisciplinary research and design. Preference to senior ENST, ENSC, and GEOG majors. Crosslisted as ENST 411."}, {"courseNum": "GEOL 203", "courseName": "Physical/Environmental Geology", "info": "Introduction to Earth's dynamic systems, plate tectonic processes that make Earth a unique planet, and human interaction with Earth. Geologic factors and limitations that affect use or management of the environment. Not open to students who have taken GEOL 250. Prerequisite: first- or second-year status, others by permission."}, {"courseNum": "GEOL 204", "courseName": "Evolution of the Earth", "info": "Introduction to the evolution of life, climate, plate tectonics, and catastrophes through time provides perspective for making decisions about ongoing and future environmental change. Preference given to first-years and sophomores."}, {"courseNum": "GEOL 250", "courseName": "Geology for Engineers", "info": "Basic principles, including properties of rocks and soils, hydrology, surface processes, rock mechanics, environmental parameters, geological hazards, and engineering case histories. Not open to students who have taken GEOL 203. GEOL 250 is restricted to first- and second-year civil and environmental engineering students and others by permission."}, {"courseNum": "GEOL 304", "courseName": "Crystallography-Mineralogy", "info": "Principles of crystallography and mineralogy; crystal morphology, structure, chemistry, physical properties, genesis, occurrence, and identification of important minerals by various techniques including chemical analysis. Prerequisite: GEOL 203 or GEOL 250 or permission of the instructor."}, {"courseNum": "GEOL 305", "courseName": "Introduction to Geochemistry", "info": "Element distribution, basic thermodynamics and kinetics, mineral and gas solubility, phase diagrams, stable and radioactive isotopes, oxidation-reduction processes, surface geochemistry, composition of natural water. Prerequisites: MATH 201, CHEM 201 - CHEM 202, and permission of the instructor."}, {"courseNum": "GEOL 320", "courseName": "Undergraduate Research", "info": "Research course for qualified students in any branch of geology.  Prerequisite: permission of the instructor."}, {"courseNum": "GEOL 322", "courseName": "Special Topics in Geology", "info": "Investigation, report, or discussion on currently significant topics in geology.  Prerequisite: permission of the instructor."}, {"courseNum": "GEOL 334", "courseName": "Geophysics", "info": "Introduction to geophysical principles and methods (seismic, gravity, magnetic, electrical, electromagnetic and GPR) applied to both near-surface and solid earth studies. Emphasis placed on active learning by hands-on geophysical data collection focused on environmental and engineering applications. Prerequisites: (One 200-level geology course and MATH 201) or PHYS 211. Crosslisted as GEOL 634."}, {"courseNum": "GEOL 634", "courseName": "Geophysics", "info": "Introduction to geophysical principles and methods applied to both near-surface and solid earth studies. Emphasis placed on active learning by hands-on geophysical data collection focused on environmental and engineering applications. Graduate project required. Prerequisites: Permission of the instructor.Crosslisted as GEOL 334."}, {"courseNum": "GLBM 300", "courseName": "Global Manager as Diplomat", "info": "This course will examine the changing role of the manager in the global business environment."}, {"courseNum": "GLBM 301", "courseName": "Global Supply Chain Management", "info": "In this course students will learn the concepts and tools to model, analyze and improve global supply chain operations under a variety of contexts. Prerequisite: MGMT 102 or MATH 216 or permission of the instructor."}, {"courseNum": "GLBM 302", "courseName": "The Global Flow of Capital", "info": "This course will explore the challenges of financial management in a global context. Prerequisite: MGMT 203 or ACFM 370 or permission of the instructor."}, {"courseNum": "GLBM 400", "courseName": "Global Manager Abroad", "info": "Students conduct independent studies analyzing a foreign venture of interest. Students interact with persons, foreign and/or domestic, who have experience with the venture. Students must demonstrate their understanding of: organizations as a global phenomenon, the global system, a specific region or country, and their emerging skill as a global manager."}, {"courseNum": "GREK 102", "courseName": "Introductory Ancient Greek", "info": "An introduction to the classical and koine forms of the language.  Emphasis upon forms and grammar, and rapid development of facility in reading.  Selections chosen from a range of Greek periods. Prerequisite: GREK 101 or equivalent."}, {"courseNum": "GREK 221", "courseName": "Studies in Greek Literature", "info": "Study of a topic or author focusing on original Greek texts (e.g., Herodotus, Homer, Sophocles, Plato, New Testament). Highly recommended for students anticipating application to graduate programs in classics or divinity. Prerequisite: GREK 151 or equivalent."}, {"courseNum": "GRMN 102", "courseName": "Everyday Life in Germany", "info": "Continuation of language skills. Practice in listening, speaking, reading, and writing; grammar; reading in culture and literature. Prerequisite: GRMN 101 or equivalent."}, {"courseNum": "GRMN 104", "courseName": "Communicating in Context", "info": "Review of basic grammar, emphasizing all four language skills and culture. Prerequisite: GRMN 103 or equivalent."}, {"courseNum": "GRMN 202", "courseName": "Strategies in Speaking German", "info": "Concentration on development of speaking skills. Conducted in German by native speaker. Intended for students enrolled in 200 and 300-level courses. Prerequisite: GRMN 103 or equivalent."}, {"courseNum": "GRMN 261", "courseName": "Nazi Culture", "info": "A study of Nazi attitudes towards the arts, science, education, mass media, work, morality, sex, war, and religion. In English. Crosslisted as UNIV 261."}, {"courseNum": "GRMN 391", "courseName": "Culture of the Weimar Republic", "info": "A study of the history, economy, politics, and culture of the Weimar Republic. In German. Prerequisite: GRMN 270 or GRMN 272 or GRMN 273 or equivalent."}, {"courseNum": "HEBR 102", "courseName": "Beginning Modern Hebrew II", "info": "Continuation of Modern Hebrew language skills. Practice in listening, speaking, reading, and writing and introduction to Israeli culture. Prerequisite: HEBR 101 or equivalent. Not open to students who completed HEBR 101A."}, {"courseNum": "HEBR 252", "courseName": " The Modern Jewish Experience in Lit&Film;", "info": "The course explores modern Jewish life around the world through a variety of perspectives, including literature, film, history, and memoir. Emphasis is placed on Jews in Israel and the U.S., as well as on immigration and the Holocaust. Crosslisted as UNIV 262."}, {"courseNum": "HIST 100", "courseName": "Thinking about History", "info": "Focus and content vary. An introductory history course for the development of informed historical analysis among its students. Primarily for first-year students."}, {"courseNum": "HIST 200", "courseName": "The Historians' Craft", "info": "Introduction to the discipline of history and to the methods and approaches used by historians. The course also considers history and the wider public."}, {"courseNum": "HIST 226", "courseName": "American Capitalism", "info": "This course explores the origins and development of capitalism in the United States. Property rights, how notions of time and space changed markets, prolitarianization, alienation, commodification, and the role the government played (or not) in shaping the economy are some of the topics that we will cover."}, {"courseNum": "HIST 241", "courseName": "Roman History", "info": "Roman history from Rome's foundations as a backwater village ca. 753 BCE, through its rise as a world-power to its fall in the fourth century CE, focusing on economic and political issues. Crosslisted as CLAS 218."}, {"courseNum": "HIST 247", "courseName": "Topics in European History", "info": "Intensive study of leading themes in European history since 1400. Topics will vary but may include economic and political structures, intellectual movements, or social and cultural history."}, {"courseNum": "HIST 288", "courseName": "The History of Vietnam", "info": "Intensive study of the history of Vietnam from the era of Chinese occupation in the second century BC to the present."}, {"courseNum": "HIST 297", "courseName": "The People's Republic of China", "info": "A historical look at life in China under the rule of the Communist Party. Unprecedented triumphs and tribulations. Crosslisted as EAST 267."}, {"courseNum": "HIST 299", "courseName": "Topics in Non-western History", "info": "Selected major issues in the study of imperialism and colonialism."}, {"courseNum": "HIST 311", "courseName": "U.S. History since 1865", "info": "Topics vary."}, {"courseNum": "HIST 312", "courseName": "American Social History", "info": "Everyday life, the family, pre-industrial society and industrial society, social organizations and social conflict, material culture, poverty and punishment."}, {"courseNum": "HIST 330", "courseName": "European History", "info": "Intensive study of selected issues. Topics vary."}, {"courseNum": "HIST 350", "courseName": "Honors Thesis", "info": "Credit may be taken either in one semester of the senior year or throughout the senior year."}, {"courseNum": "HUMN 100", "courseName": "The Humanities Now!", "info": "A multi-section course in the humanities that introduces students to the humanities world through use of latest tools and methods of analysis. Open to first-years and sophomores only."}, {"courseNum": "HUMN 128", "courseName": "Myth, Reason, Faith", "info": "An introduction to the most significant works in the Western and Asian intellectual traditions, extending from ancient Mesopotamia through late medieval Europe and/or East Asia. Not open to students who have completed RESC 098 \"Myth, Reason, Faith\" or a crosslisted equivalent. Seniors by permission only."}, {"courseNum": "HUMN 150", "courseName": "Enlightenments", "info": "An interdisciplinary study of selected works in art, music, literature, science and philosophy from European Renaissance through the early 20th century. Crosslisted as ENGL 150."}, {"courseNum": "HUMN 280", "courseName": "Buddhist Philosophy in Comparative Perspective", "info": "An introduction to Buddhist thought in comparative perspective, through a close reading and discussion of primary texts of the classical, medieval, modern and contemporary traditions. Prerequisite: PHIL 100. Crosslisted as PHIL 280."}, {"courseNum": "HUMN 333", "courseName": "Modernity, Metropolis, Machine", "info": "Surveys a wide range of cultural production in the US, Europe and the Soviet Union from the mid-19th century to the 1930s, providing a balance of close textual analysis with “distant” reading. Examines types of cultural appropriation and transmission, evolution and revolution, continuity and change, tradition and innovation."}, {"courseNum": "HUMN 351", "courseName": "Honors Tutorial and Senior Thesis", "info": "Independent study and research leading to the writing of a thesis as approved by the Honors Council.  Prerequisite: permission of the instructor."}, {"courseNum": "IREL 200", "courseName": "International Relations: Topics/Issues", "info": "Selected topics in international relations."}, {"courseNum": "IREL 216", "courseName": "Borders and Politics of Mobility", "info": "Explores the politics of contemporary nation state borders, issues of territory, sovereignty, mobility, migration, identity, citizenship, statelessness, and focuses on borders at other scales. Crosslisted as GEOG 216."}, {"courseNum": "IREL 218", "courseName": "International Relations of Europe", "info": "This course will examine the foreign policies of European countries, individually and collectively through the European Union, toward each other, regional and global intergovernmental organizations, and other regions/countries. Crosslisted as POLS 284."}, {"courseNum": "IREL 226", "courseName": "East Asian Politics", "info": "This course surveys history, politics, economy, and society of countries in East Asia. It investigates the continuity and change in politics and policies of China, Japan, Korea, and selected countries in Southeast Asia. Crosslisted as EAST 226 and POLS 226."}, {"courseNum": "IREL 234", "courseName": "Environment & Development", "info": "What is the relationship between development and the environment? This course lays out frameworks for understanding the engagement of development with the environment. This includes exploring circuits through which processes (economic, environmental, and social) and goods circulate, including cases from “sustainable” forestry, carbon economies, and the global trade in waste."}, {"courseNum": "IREL 244", "courseName": "Global Feminisms", "info": "The course investigates the often conflicting meanings for the term “feminism” that cut across international feminist politics, academic debates and the local/global politics of place and identity. Crosslisted as WMST 244."}, {"courseNum": "IREL 250", "courseName": "Theories of International Relations", "info": "Analysis and evaluation of main theories of international relations, including realist, neo-realist, liberal, neo-liberal, Gramscian, Marxist, feminist, and post-modernist approaches. Theories are related to the major dimensions of international relations. Prerequisites: POLS 170. Preference given to second semester sophomores and junior IREL majors."}, {"courseNum": "IREL 252", "courseName": "Political Economy of Global Resources", "info": "A study of environmental and energy economics in the context of global resources and politics.  The theme of sustainable development will be linked to the new realities of international relations. Prerequisite: ECON 103."}, {"courseNum": "IREL 272", "courseName": "Poverty Amid Plenty: Development in India and South Asia", "info": "This course explores ideas and practices of development in India and South Asia: the promise, politics, results, and potential lessons for development."}, {"courseNum": "IREL 275", "courseName": "Global Governance", "info": "This course explores the rationales, processes, and institutions of multilateral governance in a globalized world. We examine the U.N., nongovernmental organizations, conflict resolution, economic development, environment, human rights, and international law. Not open to first-year students. Crosslisted as POLS 275."}, {"courseNum": "IREL 350", "courseName": "Globalization", "info": "This course is designed to provide IREL majors with an opportunity to study global change. The course addresses contemporary issues in globalization. Specific topics may vary. Normally taken in fall of junior or senior year. Prerequisites: IREL majors; Students should preferably have both ECON 227 and IREL 250."}, {"courseNum": "IREL 381", "courseName": "Arab-Israeli Conflict, Peace Process", "info": "This course examines the failures and successes of the peace process among Israel, Arab States, and Palestinians. Special focus is on Oslo peace process, outstanding issues, and the involvement of outside actors, particularly the role of the US. Prerequisite: POLS 170 or permission from instructor. Crosslisted as POLS 381."}, {"courseNum": "IREL 430", "courseName": "Global Poverty: Politics and Practices", "info": "This course engages debates about the politics and practice of addressing poverty in a global context. We examine how schemes are conceptualized, come to be taken up, and circulate globally -- from micro-finance, to food supplements, and cash-transfers for the poor. Alongside this, we examine the business of “ending poverty.”"}, {"courseNum": "IREL 482", "courseName": "U.S.-China Relations", "info": "Through tracing the evolution of U.S.-China relations from the 18th century to the 21st century, this course discusses major issues and challenges between the two countries today. Future trends of the bilateral relationship will also be explored. Prerequisite: POLS 170. Preference given to EAST, IREL, and POLS seniors. Crosslisted as EAST 382 and POLS 382."}, {"courseNum": "ITAL 101", "courseName": "Elementary Italian I", "info": "Beginning language skills, practice listening, speaking, reading, and writing; elementary grammar; and introduction to Italian culture."}, {"courseNum": "ITAL 102", "courseName": "Elementary Italian II", "info": "Continuation of language skills. Practice in listening, speaking, reading and writing. Introduction to Italian culture. Prerequisite: ITAL 101 or equivalent."}, {"courseNum": "ITAL 103", "courseName": "Intermediate Italian I", "info": "Review and expansion of language skills and cultural knowledge of Italy. Prerequisite: ITAL 102 or equivalent."}, {"courseNum": "ITAL 104", "courseName": "Intermediate Italian II: Italian Civilization", "info": "Continuing review of grammar emphasizing all four skills. Focus on civilization. Prerequisite: ITAL 103 or equivalent."}, {"courseNum": "ITAL 202", "courseName": "Intermediate Italian Conversation II", "info": "Concentration on development of speaking skills. Conducted in Italian by native speaker. This course can be counted only once toward the minor. Prerequisite or corequisite: ITAL 104 or equivalent."}, {"courseNum": "ITAL 240", "courseName": "Love and Politics (in English)", "info": "Survey of major Italian writers from Middle Ages and Renaissance with reference to contemporary visual arts and music."}, {"courseNum": "ITAL 248", "courseName": "Intermediality: Italy, Film, and the Arts", "info": "This IP course will focus on intermediality, film, and Italy. It seeks to examine the relationships of cinema with the other arts, in particular the arts of Italy. Crosslisted as ENFS 248 and UNIV 248."}, {"courseNum": "JAPN 102", "courseName": "Japanese I", "info": "Beginning language skills.  Training in speaking and comprehending the basic sentence patterns of modern Japanese.  Introduction to reading and writing. Prerequisite: JAPN 101 or the equivalent."}, {"courseNum": "JAPN 104", "courseName": "Japanese II", "info": "Continued training in the four language skills.  Review of basic and introduction to complex sentence patterns. Reading of texts in basic Japanese. Prerequisite: JAPN 103 or the equivalent."}, {"courseNum": "JAPN 202", "courseName": "Japanese III", "info": "Application of the four language skills.  Reading of texts written in standard Japanese and exercises in content-controlled conversation. Prerequisite: JAPN 201 or equivalent."}, {"courseNum": "JAPN 204", "courseName": "Japanese IV", "info": "Continued application of the four language skills.  Reading and guided discussion of texts related to a variety of topics. Prerequisite: JAPN 203 or the equivalent."}, {"courseNum": "LAMS 150", "courseName": "Latin America: An Introduction", "info": "Introduction to the history, cultures, and societies of Latin America."}, {"courseNum": "LAMS 202", "courseName": "Rainforests and Ecopolitics in Latin America", "info": "Focusing on Amazonia as a key region in global environmental politics, the course examines climate policy debates and recent shifts in global environmentalism. Crosslisted as ENST 209 and ANTH 202."}, {"courseNum": "LAMS 250", "courseName": "Latin America: Challenges for the 21st Century", "info": "Perspectives on the challenges facing Latin American peoples and nations in the 21st century. Crosslisted as ANTH 248."}, {"courseNum": "LATN 102", "courseName": "Introductory Latin", "info": "Continuing study of Latin grammar with review of basic material, including the introduction to Latin reading. Prerequisite: LATN 101 or equivalent."}, {"courseNum": "LATN 221", "courseName": "Studies in Latin Literature", "info": "Advanced readings in Latin authors. Authors vary by semester; prose and poetry offered in alternate semesters. May be repeated as topic varies. Prerequisite: LATN 151 or equivalent."}, {"courseNum": "LING 105", "courseName": "Linguistic Analysis: Sounds and Words", "info": "One semester of a two-semester introduction to linguistics. Topics include: phonetics, phonology, word forms, language change, language acquisition."}, {"courseNum": "LING 203", "courseName": "A History of English", "info": "A historical overview of the English language from its origins to the present, focusing on principles of language change, sociolinguistics, and language contact."}, {"courseNum": "LING 204", "courseName": "Language and Culture: Introduction to Linguistic Anthropology", "info": "This course introduces the anthropological study of language and its importance to human behavior and social relations, covering key concepts, terms, and theories about how languages are structured, how people acquire language, and how language affects a number of important social and cultural domains, among other topics. Crosslisted as ANTH 204."}, {"courseNum": "LING 206", "courseName": "Morphology", "info": "Explores the mental lexicon, the internal structure of words, and the processes by which words are formed in a wide variety of languages. Prerequisite: LING 105 or LING 110."}, {"courseNum": "LING 319", "courseName": "Undergraduate Research", "info": "Research in psycholinguistics. Research topics may be posed by students or faculty. Prerequisite: LING 230 and permission of the instructor."}, {"courseNum": "LING 330", "courseName": "Advanced Topics in Psycholinguistics", "info": "Advanced study in psycholinguistics. Includes topics such as language production, language comprehension, and bilingualism. Prerequisite: LING 230 or permission of the instructor."}, {"courseNum": "MATH 112", "courseName": "Introduction to Mathematical Modeling", "info": "Introduction for the non-specialist to mathematical modeling of real-world phenomena such as voting and networks, using graph theory, probability, and other accessible tools."}, {"courseNum": "MATH 117", "courseName": "Introduction to Mathematical Thought", "info": "An investigation of number, numeration, and operations from the perspective of elementary school teachers and pupils. Open only to B.S. in Education Early Childhood Pre-K to 4 students. Required fieldwork."}, {"courseNum": "MATH 192", "courseName": "Topics in Calculus", "info": "Elementary calculus and applications taken primarily from economics.  Topics include algebraic, exponential, and logarithmic functions, graphs, limits, derivatives and integration. Not open to students who have taken MATH 201."}, {"courseNum": "MATH 201", "courseName": "Calculus I", "info": "An introduction to the calculus of algebraic, trigonometric and transcendental functions. Interpretation, significance and calculations of a derivative. Applications to geometry, biology, physics, economics, and other subjects. Introduction to the definite integral, including the Fundamental Theorem of Calculus. Not open to students who have taken MATH 192."}, {"courseNum": "MATH 202", "courseName": "Calculus II", "info": "Methods of integration including substitution, integration by parts, numerical approximations, and improper integrals. Series, including Taylor series. Complex numbers, polar coordinates, differential equations, and applications. Prerequisite: MATH 201."}, {"courseNum": "MATH 211", "courseName": "Calculus III", "info": "Calculus of vector-valued functions and functions of several variables. Multiple, line, and surface integrals; applications, and extrema. Green's, Stokes' and Divergence Theorems. Prerequisite: MATH 202."}, {"courseNum": "MATH 212", "courseName": "Differential Equations", "info": "Basic methods of solving ordinary differential equations. Systems of linear differential equations, Laplace transform, applications and selected topics. Prerequisite: MATH 211. Not open to students who have taken MATH 222."}, {"courseNum": "MATH 216", "courseName": "Statistics I", "info": "Exploratory data analysis, sampling distributions, regression, sampling designs, confidence intervals, hypothesis testing, ANOVA. Statistical software is used and applications, including projects, are undertaken. Not open to students who have taken MATH 226 or PSYC 215."}, {"courseNum": "MATH 219", "courseName": "Topics in Applied Mathematics", "info": "Topics such as financial mathematics, mathematical biology, cryptography, social networks, etc. Topic varies by semester. Prerequisite: varies by topic."}, {"courseNum": "MATH 222", "courseName": "Differential Equations for Engineers", "info": "First order differential equations, second order linear equations, higher order linear equations, numerical approximations. Prerequisite: MATH 211. Open only to civil engineering and computer science engineering students. Not open to students who have taken MATH 212."}, {"courseNum": "MATH 240", "courseName": "Combinatorics and Graph Theory", "info": "Counting techniques and traversal problems. Does not count toward the major. Students join MATH 241 mid-semester. Corequisite: MATH 280. Only for computer science students or students seeking secondary certification."}, {"courseNum": "MATH 241", "courseName": "Discrete Structures", "info": "Logic, sets; mathematical induction; relations, functions; combinatorics and graph theory. Does not count toward the mathematics major. Prerequisite: MATH 202."}, {"courseNum": "MATH 245", "courseName": "Linear Algebra", "info": "Linear equations, matrices, vector spaces, linear transformations, determinants, eigenvalues. Prerequisite: MATH 202."}, {"courseNum": "MATH 280", "courseName": "Logic, Sets, and Proofs", "info": "Logic, sets; proof techniques; relations, functions, sequences and convergence; cardinality. Skills and tools for independent reading, problem solving and exploration. Prerequisite: MATH 211 or MATH 245."}, {"courseNum": "MATH 303", "courseName": "Probability", "info": "Elementary probability, random variables, moments, central limit theorem, conditional expectation, statistical distributions derived from the normal distribution. Probability simulations and applications from various fields. Prerequisite: MATH 211. Crosslisted as MATH 603."}, {"courseNum": "MATH 304", "courseName": "Statistical Inference Theory", "info": "Point and interval estimation, hypothesis testing, Fisher's likelihood theory, frequentist versus Bayesian approach, computational statistics. Prerequisites: MATH 216 and MATH 303, or permission of the instructor. Crosslisted as MATH 604."}, {"courseNum": "MATH 308", "courseName": "Real Analysis I", "info": "Real numbers and elementary topology of Cartesian spaces, convergence, continuity, differentiation, and history of the development of analysis. Prerequisites: MATH 211, MATH 245, and MATH 280."}, {"courseNum": "MATH 319", "courseName": "Topics in Advanced Mathematics", "info": "Special topics, to be selected from algebra, analysis, geometry, statistics, applied mathematics, etc. Crosslisted as MATH 619."}, {"courseNum": "MATH 320", "courseName": "Abstract Algebra I", "info": "Groups and rings; homomorphisms and isomorphism theorems; history of the development of algebra. Additional selected topics. Prerequisites: MATH 245 and MATH 280."}, {"courseNum": "MATH 345", "courseName": "Advanced Linear Algebra", "info": "Systems of linear equations, vector spaces, canonical forms for linear transformations and matrices, bilinear forms, inner product spaces, applications to such other areas as geometry, differential equations, linear programming. Prerequisites: MATH 245 and either MATH 280 or permission of the instructor. Crosslisted as MATH 645."}, {"courseNum": "MATH 358", "courseName": "Topics in Operations Research", "info": "Mathematical and statistical techniques in operations research. Queueing theory. Additional topics may include simulation, forecasting, non-linear programming, inventory models. Methods and applications drawn from various fields. Prerequisite: MATH 303 or permission of the instructor. Crosslisted as MATH 658."}, {"courseNum": "MATH 407", "courseName": "Statistical Design of Scientific Studies", "info": "Experiments, observational studies. Completely randomized, block, mixed models, crossed, nested design. Simple random, stratified, cluster sampling. Estimation procedures, sample size calculations. Uses R or SAS. Prerequisite: MATH 304"}, {"courseNum": "MATH 409", "courseName": "Real Analysis II", "info": "Continuation of MATH 308. Integration theory and advanced topics in analysis. Prerequisite: MATH 308. Crosslisted as MATH 609."}, {"courseNum": "MATH 607", "courseName": "Stat Design Scientific Studies", "info": "Sampling, design of experiments and observational studies. Includes completely randomized block, factorial, and nested designs. Simple random stratified, systematic and cluster sampling. Estimation procedures and sample size calculations. Crosslisted as MATH 307."}, {"courseNum": "MATH 609", "courseName": "Real Analysis II", "info": "Continuation of Real Analysis I. Integration theory and advanced topics in analysis. Prerequisite: permission of the instructor. Crosslisted as MATH 409."}, {"courseNum": "MATH 658", "courseName": "Topics in Operations Research", "info": "Mathematical and statistical techniques in operations research. Queuing theory. Additional topics may include simulation, forecasting, non-linear programming, inventory models. Methods and applications drawn from various fields. Prerequisite: permission of the instructor. Crosslisted as MATH 358."}, {"courseNum": "MECH 202", "courseName": "Graphics for Design and Manufacture", "info": "Graphical representation techniques for visualization and communication of mechanical engineering designs and concepts. Creation, storage, and manipulation of production drawings and 3-D geometric representations using state-of-the-art software."}, {"courseNum": "MECH 216", "courseName": "Thermodynamics II", "info": "A continuation of MECH 213 with a focus on applications of thermodynamic principles including an extension of power and refrigeration cycles, psychometrics, reacting mixtures and combustion, and other selected topics. Prerequisites: MATH 211, MECH 213, MECH 222, or the permission of the department."}, {"courseNum": "MECH 220", "courseName": "Mechanics", "info": "Equilibrium of two- and three-dimensional force systems. Trusses and frames. Friction. Distributed force systems. Internal loads. One degree of freedom vibrations. Prerequisite: MATH 201. Not open to students who have taken ENGR 221 or ENGR 229."}, {"courseNum": "MECH 285", "courseName": "Independent Study for Sophomores", "info": "Independent investigation under the direction of a faculty member for students who have completed their first year. Sophomore standing in mechanical engineering and permission of the instructor."}, {"courseNum": "MECH 302", "courseName": "Finite Elements in Analysis and Design", "info": "Introduction to finite element method (FEM) and commercial FEM software for design and analysis of mechanical components and thermal problems. Applications in mechanical and thermal component/system design. Co-Requisites: MECH 302L. Prerequisites: MECH 202 and MECH 353."}, {"courseNum": "MECH 312", "courseName": "Heat Transfer", "info": "Principles and engineering applications of heat transfer by conduction, convection, and radiation. Co-Requisites: MECH 312L. Prerequisite: MECH 313 or permission of the instructor."}, {"courseNum": "MECH 353", "courseName": "Solid Mechanics", "info": "Analysis of the stress, strain, and failure of engineering components under axial, bending, and torsional loading conditions. Provide a bridge to more advanced material in the theory of elasticity and computational solid mechanics. Co-Requisites: MECH 353L. Prerequisites: MECH 220 and concurrent prerequisite MATH 212 or permission of the department."}, {"courseNum": "MECH 385", "courseName": "Independent Study for Juniors", "info": "Independent investigation under the direction of a faculty member for students who have completed two years of study. Junior standing in mechanical engineering and permission of the instructor."}, {"courseNum": "MECH 392", "courseName": "Mechanical Design", "info": "Principles and techniques for creative design of machines in relation to specifications and user requirements. Design using a solid modeling CAD package. Co-Requisites: MECH 392L. Prerequisites: MECH 252 and MECH 353 or permission of the instructor."}, {"courseNum": "MECH 402", "courseName": "Senior Design II", "info": "Emphasis on fabrication, instrumentation, testing and presentation of mechanical or thermofluid components designed in MECH 401. Student teams will participate in presentation of their results. Co-Requisites: MECH 402L. Prerequisite: MECH 401 or permission of the instructor."}, {"courseNum": "MECH 420", "courseName": "Solar Energy Conversion", "info": "Fundamental aspects of the design and operation of solar energy conversion systems including photovoltaics, solar thermal power, solar heating and chemical fuel production. Prerequisite: MECH 312 or permission of the instructor. Seniors only. Crosslisted as MECH 620."}, {"courseNum": "MECH 452", "courseName": "Advanced Dynamics", "info": "Kinematics and dynamics of particles and rigid bodies. Degrees of freedom. Partial velocities. Generalized active and inertia forces. Kane's equation. Lagrange's equation. Numerical simulation of motion. Prerequisites: MECH 252 or permission of the instructor. Crosslisted as MECH 652."}, {"courseNum": "MECH 453", "courseName": "Robotics", "info": "History, evolution, capabilities and applications of robotic devices. Introduction to robot kinematics, dynamics, and control. Research into current topics in robotics. Development and implementation of robotic operations using model and industrial robots. Prerequisites: MECH 252 or permission of the instructor. Crosslisted as MECH 653."}, {"courseNum": "MECH 477", "courseName": "Design Thinking for Social Impact", "info": "Framework and techniques in design thinking. Project-based with strong emphasis on interaction with community partner to facilitate social impact. Not open to first-years or sophomores. Open to the  College of Engineering only. Prerequisite: Permission of the Instructor. Crosslisted as MECH 677."}, {"courseNum": "MECH 485", "courseName": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course. Prerequisite: permission of the instructor. Crosslisted as MECH 685."}, {"courseNum": "MECH 620", "courseName": "Solar Energy Conversion", "info": "Fundamental aspects of the design and operation of solar energy conversion systems including photovoltaics, solar thermal power, solar heating and chemical fuel production. Prerequisite: MECH 312 or permission of Instructor. Crosslisted as MECH 420."}, {"courseNum": "MECH 652", "courseName": "Advanced Dynamics", "info": "Kinematics and dynamics of particles and rigid bodies. Degrees of freedom. Partial velocities. Generalized active and inertia forces. Kane's equation. Lagrande's equation. Numerical simulation of motion. Prerequisite: MECH 252 or permission of the instructor. Crosslisted as MECH 452."}, {"courseNum": "MECH 677", "courseName": "Design thinking for Social Impact", "info": "Framework and techniques in design thinking. Project-based with strong emphasis on interaction with community partner to facilitate social impact. Not open to first-years or sophomores. Open to the College of Engineering only. Crosslisted as MECH 477."}, {"courseNum": "MECH 685", "courseName": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course. Prerequisite: permission of the instructor. Crosslisted as MECH 485."}, {"courseNum": "MGMT 100", "courseName": "Management Past, Present and Future", "info": "Explores the historical context from which complex organizations have arisen, their evolution, and the emerging areas of inquiry necessary to understanding the future of organizations, management, and business."}, {"courseNum": "MGMT 101", "courseName": "Introduction to Organization and Management", "info": "Each section of 28 students learns management theories, concepts, and models, putting them into practice by designing and managing their own multi-divisional hybrid organizations that conduct major service projects funded by selling business products they created. Storytelling and writing are key pedagogies. Not open to first semester first-year students."}, {"courseNum": "MGMT 102", "courseName": "Quantitative Reasoning for Managers", "info": "This course serves as a student's introduction to quantitative modeling and basic statistical analysis in a spreadsheet-based environment, especially as they apply to managerial decision making."}, {"courseNum": "MGMT 200", "courseName": "Foundations Accounting and Financial Management I", "info": "Introduction to accounting and financial management including financial statement preparation and analysis, financial forecasting, cost relationships, time value of money and capital budgeting."}, {"courseNum": "MGMT 201", "courseName": "Marketing", "info": "Introduction to principles of marketing.  Examines how organizations facilitate exchange relationships by customers' needs and wants.  Explores the intricacies of identifying and establishing market positions and understanding consumer behavior.  Prerequisite: MGMT 101 or permission of the instructor."}, {"courseNum": "MGMT 203", "courseName": "Managerial Finance", "info": "Financial analysis, forecasting, and valuation of projects and companies incorporating risk-return tradeoffs and capital structure and dividend decisions.  Employs 10-K research and presentations.  Prerequisite: MGMT 200. Intended ACFM majors must take ACFM 370 instead of MGMT 203."}, {"courseNum": "MGMT 302", "courseName": "The Stakeholder Organization", "info": "Students explore the moral and ethical challenges associated with complex organizational decisions in a variety of contexts.  Prerequisite: MGMT 101. Juniors and seniors only."}, {"courseNum": "MGMT 303", "courseName": "The Technological Organization", "info": "Organizations solve a variety of problems by deploying information systems.  This course explores a range of technological impacts on organizations from their behavior to survival."}, {"courseNum": "MGMT 304", "courseName": "The Strategic Organization", "info": "Students learn strategic concepts and explore the challenges of formulating and implementing organizational strategies. Prerequisite: MGMT 101. Senior BSBA and MGEG seniors only.  MGEG sub-seniors and others by permission."}, {"courseNum": "MGMT 310", "courseName": "Independent Study in Management", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "MGMT 315", "courseName": "Special Topics in Management", "info": "A seminar on selected topics in management. Prerequisite: permission of the instructor. Crosslisted as MGMT 615."}, {"courseNum": "MIDE 300", "courseName": "Markets, Innovation, and Design", "info": "A survey of the relationships among marketing, innovation, and design. Students will practice various approaches to creative and innovative thinking. Prerequisite: MGMT 201 or permission of the instructor."}, {"courseNum": "MIDE 301", "courseName": "Understanding Consumers", "info": "A toolbox of research methods for understanding consumer behavior with appropriate exposure to philosophical and theoretical underpinnings of various approaches. Prerequisite: MGMT 201 or permission of instructor."}, {"courseNum": "MIDE 302", "courseName": "Design Realization", "info": "Implementation of creative techniques for exploring ideas and transforming ideas into appropriate mediums for communication. Includes creative ideation, sketching, digital and physical modeling. Prerequisites: MGMT 201 and MIDE 300."}, {"courseNum": "MIDE 304", "courseName": "Marketing Management", "info": "Integrating learned knowledge, students practice making marketing-related decisions through case analysis of various business scenarios. The predominant emphasis is on drawing together disciplinary experiences and providing a more coherent appreciation of the major's academic discipline. The educational goals of the class focus on critical, analytical, and synthetic thinking."}, {"courseNum": "MILS 102", "courseName": "Basic Leadership", "info": "Further studies focusing on developing comprehension of Army leadership dimensions, attributes and core leader competencies within the U.S. Army, and the Army's role in American society and government."}, {"courseNum": "MILS 202", "courseName": "Leadership and Teamwork", "info": "Further studies the theoretical basis of Army leadership requirements model by exploring the dynamics of adaptive leadership in the context of military operations."}, {"courseNum": "MILS 302", "courseName": "Leadership Under Fire", "info": "Further studies in developing critical thinking skills through practical application of the fundamentals of Army leadership at the lowest organizational levels in the United States Army."}, {"courseNum": "MILS 402", "courseName": "Leadership in a Complex World", "info": "Explores the dynamics of leading soldiers in full spectrum operations in the contemporary operating environment. Course prepares them for their future role as an Army officer."}, {"courseNum": "MSUS 200", "courseName": "Managing for Sustainability I", "info": "This course explores how organizations manage toward social, environmental, and economic sustainability goals. Prerequisites: sophomores, juniors, or seniors only."}, {"courseNum": "MSUS 315", "courseName": "Special Topics in Managing for Sustainability", "info": "A seminar on selected topics in managing for sustainability. Prerequisite: permission of the instructor."}, {"courseNum": "MSUS 400", "courseName": "Sustainability Action Learning Project", "info": "Action research course exposing students to principles of organization development and change.  Requires students to draw on and integrate knowledge, skills, and experiences gained from core, major, and relevant CCC courses.  In teams, students develop, organize, and manage significant projects that further key sustainability goals and involve multiple stakeholder groups."}, {"courseNum": "MUSC 122", "courseName": "Introduction to Music", "info": "An examination of various types of music in cultural and historical context; topics range from classical to jazz and the avant-garde. Not open to music majors. Students may not take both MUSC 122 and MUSC 123."}, {"courseNum": "MUSC 152", "courseName": "Functional Keyboard", "info": "A requirement for all, and open only to Bachelor of Music majors. Functional keyboard skills including harmonization, transposition, and improvisation. Students will register for the course each semester until it is completed successfully. Failure to complete the requirement will prevent a student from continuing in the degree program."}, {"courseNum": "MUSC 170", "courseName": "Piano Lessons", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 171", "courseName": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 172", "courseName": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 174", "courseName": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 175", "courseName": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 176", "courseName": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 178", "courseName": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 179", "courseName": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 181", "courseName": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 183", "courseName": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 185", "courseName": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 187", "courseName": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 188", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 189", "courseName": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 191", "courseName": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 192", "courseName": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 193", "courseName": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 194", "courseName": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 196", "courseName": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 197", "courseName": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 199", "courseName": "Improvisation I", "info": "Studio lessons in improvisation. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 200", "courseName": "Diatonic Theory", "info": "Study of diatonic triads and dominant seventh chords, progressions, cadences, secondary dominants, diatonic modulation, musical forms, orchestration, and score reading. Students lacking sufficient music theory background to begin theory sequence with MUSC 200 should first enroll in MUSC 121 or pursue an individualized course of instruction on their own."}, {"courseNum": "MUSC 202", "courseName": "Advanced Theory", "info": "A thorough knowledge of major compositional techniques from approximately 1910 to the present.  Class requires advanced knowledge of the Sibelius notation program.  Prerequisite: MUSC 201."}, {"courseNum": "MUSC 213", "courseName": "Women in Music", "info": "A survey of women's involvement in music from the Middle Ages to today. Gender roles in society and the arts will also be discussed."}, {"courseNum": "MUSC 248", "courseName": "Music and Culture: History of Jazz", "info": "A critical examination of musicians, movements, and cultural intersections within the development of jazz. Crosslisted as AFST 248."}, {"courseNum": "MUSC 249", "courseName": "Cross-Cultural Perspectives in Music", "info": "An introduction to the study of music in cross-cultural perspective.  Examines various musics' sounds, contexts, and meanings through several intersecting themes: identity, ritual, dance, etc."}, {"courseNum": "MUSC 253", "courseName": "Music and Culture: Beethoven to Virtual Music", "info": "A survey of western European art music from the early 19th century to the present. When possible, MUSC 252 should be taken before enrolling in MUSC 253."}, {"courseNum": "MUSC 260", "courseName": "Ensemble", "info": "Non music majors may receive 1/4 credit per ensemble (maximum of 1/2 credit per semester, limit of two full-course credits in all). Music majors audit ensembles. Audition or permission of the instructor required for first-time members. 01-Symphonic Band, 02-Orchestra, 03-University Choir, 04-Camerata, 05-Opera Theatre, 06-Handbells, 07-Jazz Band, 08-Gamelan."}, {"courseNum": "MUSC 270", "courseName": "Piano", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 271", "courseName": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 272", "courseName": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 274", "courseName": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 275", "courseName": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 276", "courseName": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 278", "courseName": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 279", "courseName": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 281", "courseName": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 283", "courseName": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 285", "courseName": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 287", "courseName": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 288", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 289", "courseName": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 291", "courseName": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 292", "courseName": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 293", "courseName": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 294", "courseName": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 296", "courseName": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 297", "courseName": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 299", "courseName": "Improvisation II", "info": "Studio lessons in improvisation."}, {"courseNum": "MUSC 322", "courseName": "Music and Social Justice", "info": "This course explores music that has been created to advance the goals of social justice movements in various cultures and time periods."}, {"courseNum": "MUSC 335", "courseName": "Student Teacher Seminar", "info": "This course provides student teachers in music with the opportunity to refine their teaching practices through guided reflection, discussion, reading, writing, and various other activities. Corequisite: EDUC 439. Prerequisite: MUSC 235."}, {"courseNum": "MUSC 370", "courseName": "Piano", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 371", "courseName": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 372", "courseName": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 374", "courseName": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 375", "courseName": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 376", "courseName": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 378", "courseName": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 379", "courseName": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 381", "courseName": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 383", "courseName": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 385", "courseName": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 387", "courseName": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 388", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 389", "courseName": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 391", "courseName": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 392", "courseName": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 393", "courseName": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 394", "courseName": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 396", "courseName": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 397", "courseName": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 399", "courseName": "Improvisation III", "info": "Studio lessons in improvisation."}, {"courseNum": "NEUR 248", "courseName": "Developmental Psychobiology", "info": "Addresses development in humans from conception through adolescence with some comparative analysis with non-humans. Emphasis on both normal and atypical cognitive, neuropsychological and neurobiological development. Prerequisite: PSYC 100 or NEUR 100. Crosslisted as PSYC 248."}, {"courseNum": "NEUR 250", "courseName": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as PSYC 250."}, {"courseNum": "NEUR 253", "courseName": "Neural Cell Biology", "info": "A core course for neuroscience focused on structure/function relationships in neural cells. Basic protein biochemistry, ion channel activity, protein receptors, cell signaling, electrical properties and response patterns will be emphasized. Recommended for sophomores. Prerequisites: BIOL 205 and PSYC 250 and permission of the instructor."}, {"courseNum": "NEUR 322", "courseName": "Clinical Neuroscience", "info": "Through case studies, guest lectures, and review of primary literature this course will explore fundamental mechanisms that underlie diseases and disorders of the brain and central nervous system. Prerequisites: PSYC 250 or NEUR 250. Open to Biology, Neuroscience, and Psychology majors. Crosslisted as PSYC 322 and PSYC 622."}, {"courseNum": "NEUR 348", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as PSYC 348 and PSYC 648."}, {"courseNum": "NEUR 360", "courseName": "Honors Thesis", "info": "Prerequisite: permission of the department and permission of the instructor."}, {"courseNum": "NEUR 399", "courseName": "Undergraduate Research", "info": "Research on any aspect of neuroscience. Research topics may be posed by students or faculty. Prerequisite: permission of the instructor."}, {"courseNum": "NEUR 400", "courseName": "Senior Seminar in Neuroscience", "info": "NEUR majors may elect to attend a lecture series in the spring semester to satisfy the Culminating Experience requirement. Students will prepare written reactions to each seminar, graded as pass/fail. Prerequisites: senior status and NEUR majors and permission of the instructor."}, {"courseNum": "PHIL 100", "courseName": "Introduction to Philosophy", "info": "An introduction to the main topics, fields and figures of philosophy. Multiple sections of this course are offered every semester, under a variety of titles."}, {"courseNum": "PHIL 103", "courseName": "Logic", "info": "An introduction to informal and formal ways of reasoning. The structures and general forms of argument as well as the standards and criteria needed to evaluate arguments, and the historical development of logical reasoning, will be studied."}, {"courseNum": "PHIL 201", "courseName": "Symbolic Logic", "info": "Careful work on the concepts/problems of modern logic will direct the course.  It will investigate topics in propositional and quantificational logic and general logical theory (completeness, consistency, independence, rigor). It will conclude with a study of the system of Wittgenstein's Tractatus. Prerequisites: PHIL 103 and permission of the instructor."}, {"courseNum": "PHIL 207", "courseName": "History of Modern Philosophy", "info": "Philosophical thought in the classical modern age, including Continental Rationalism, British Empiricism, and Kant. Prerequisite: PHIL 100 or permission of the instructor."}, {"courseNum": "PHIL 213", "courseName": "Ethics", "info": "An attempt to formulate adequate criteria for the basic moral conceptions of good and bad, right and wrong, and duty, by a study of leading ethical view points from Plato to the present. Prerequisite: PHIL 100 or PHIL 103 or PHIL 201 or permission of the instructor."}, {"courseNum": "PHIL 223", "courseName": "Philosophy of Religion", "info": "Problems for rational inquiry arising from the claims and practices of religious faith; the nature of religious experience and language, arguments for God's existence, evil. Prerequisite: permission of the instructor. Crosslisted as RELI 216."}, {"courseNum": "PHIL 229", "courseName": "Philosophy and Race", "info": "Critical examination of the nature and meaning of \"race\" in terms of conceptual analysis, experience, social constructionism, feminism, class, ethnicity, politics, colonialism, violence, and redress. Crosslisted as AFST 229 and POLS 259."}, {"courseNum": "PHIL 230", "courseName": "Feminist Philosophy", "info": "An examination of feminist philosophy primarily as it occurs in the U.S. from the late 18th century to the present. Prerequisite: PHIL 100, or WMST 150, or permission of the instructor. Crosslisted as WMST 230."}, {"courseNum": "PHIL 246", "courseName": "Philosophy of Law", "info": "Examination of some central philosophical issues relating to law, including law's relation to economics, literature, democracy, rules, integrity, and interpretation. Prerequisite: PHIL 100 or PHIL 103 or PHIL 201 or permission of the instructor."}, {"courseNum": "PHIL 267", "courseName": "Islamic Philosophy", "info": "A survey of major figures and movements in the Islamic philosophical tradition. Topics discussed include the good life, death and the afterlife, God, prophecy, the relation between reason and revelation, etc. Figures studied include al-Farabi, Avicenna, al-Ghazali, Averroes and others. Prerequisite: PHIL 100 or permission of instructor."}, {"courseNum": "PHIL 268", "courseName": "Topics in Metaphysics and/or Epistemology", "info": "Focused study of specific topics in metaphysics and/or epistemology, such as space and time, possible worlds, the mind-body problem, truth, skepticism, virtue epistemology, and norms of assertion. Prerequisite: varies."}, {"courseNum": "PHIL 276", "courseName": "Philosophy of Revolution", "info": "An exploration and analysis of the concept of revolution in political philosophy from modernity to the present day, examining ways that political philosophers have sought to make revolution unnecessary as well as how and why they have emphasized its necessity. Crosslisted as POLS 267."}, {"courseNum": "PHIL 280", "courseName": "Buddhist Philosophy in Comparative Perspective", "info": "An introduction to Buddhist thought in comparative perspective, through a close reading and discussion of primary texts of the classical, medieval, modern and contemporary traditions. Prerequisite: PHIL 100. Crosslisted as HUMN 280."}, {"courseNum": "PHIL 309", "courseName": "Seminar in Historical Studies: Individual Philosophers", "info": "Intensive study of the works of a single philosopher chosen from the ancient, medieval, modern, or contemporary period of the history of philosophy. In recent years: Plato, Aristotle, Descartes, Kant, Nietzsche, Heidegger, Wittgenstein. Prerequisites: two courses in philosophy and permission of the instructor."}, {"courseNum": "PHIL 319", "courseName": "Individual Studies in Philosophy", "info": "Open to advanced students who wish to pursue individual programs of study under the supervision of a professor, or of a committee of professors if the subject falls within two or more departments. May be conducted as a seminar for three or more students pursuing similar programs."}, {"courseNum": "PHIL 320", "courseName": "Individual Studies in Philosophy", "info": "Open to advanced students who wish to pursue individual programs of study under the supervision of a professor, or of a committee of professors if the subject falls within two or more departments. May be conducted as a seminar for three or more students pursuing similar programs."}, {"courseNum": "PHIL 322", "courseName": "Honors Thesis", "info": "Substantial independent work on some problem or topic approved by the department of philosophy as honors work. Prerequisite: permission of the instructor."}, {"courseNum": "PHIL 323", "courseName": "Senior Thesis", "info": "Independent research on a philosophical issue, in consultation with staff members. The thesis should show integrative and creative abilities. Prerequisite: major in philosophy or permission of the instructor."}, {"courseNum": "PHYS 140", "courseName": "Physics for Future Leaders", "info": "The science behind key issues facing us as engaged citizens and future leaders. Topics include energy, climate change, space travel, and technology, as well as the processes that lead to scientific progress. Designed for non-science majors. No prerequisites. Not open to students who have completed a 200-level physics course."}, {"courseNum": "PHYS 141", "courseName": "Secrets of the Universe", "info": "The great ideas of 20th-century physics (symmetry principles, relativity, and quantum mechanics) and their application to cosmology and the evolution of the universe. Also, historical development and philosophical implications of these ideas. Designed for non-science majors. No prerequisite. Not open to students who have successfully completed a 200-level physics course."}, {"courseNum": "PHYS 212", "courseName": "Classical and Modern Physics II", "info": "The second course in a two-course sequence that surveys major areas of physics. Topics include electricity and magnetism, light and waves, quantum mechanics, and particle physics. Prerequisite: PHYS 211 or permission of the instructor. Corequisite: MATH 202 or another mathematics course numbered above MATH 202."}, {"courseNum": "PHYS 222", "courseName": "Wave Mechanics and Quantum Physics", "info": "Physics of coupled oscillations and waves, including classical wave equation. Wave-particle duality; origin and elementary applications of quantum mechanics; the Schroedinger wave equation; atomic and nuclear physics. Prerequisites: PHYS 212 (or PHYS 212E) and MATH 211."}, {"courseNum": "PHYS 235", "courseName": "Applied Electronics", "info": "Circuit fundamentals, linear and digital integrated circuits, transducers, analog to digital conversion, filtering, Fourier methods, microcomputers, and computer interfacing. Designed for science and computer science majors. Prerequisite: PHYS 212 (or PHYS 212E). Open to electrical engineering students by permission only."}, {"courseNum": "PHYS 303", "courseName": "Modern Optics", "info": "Geometrical optics, interference and diffraction, quantum optics, optical properties of matter, lasers and holography. Prerequisite: PHYS 222 or permission of the instructor."}, {"courseNum": "PHYS 310", "courseName": "Experimental Physics", "info": "Methods and techniques used in experimental and computational physics, including data analysis and numerical methods, use of standard research equipment, and documentation of laboratory work emphasizing written and oral communication of scientific results. Prerequisite: PHYS 222 or permission of the instructor."}, {"courseNum": "PHYS 338", "courseName": "Contemporary Study in Physics", "info": "Seminar in topics of current interest in the physics and astronomy community. Co- and prerequisites are dependent on topic and instructor. Prerequisite: permission of the instructor. Crosslisted as PHYS 638."}, {"courseNum": "PHYS 339", "courseName": "Advanced Quantum Mechanics and Particle Physics", "info": "Advanced topics in quantum mechanics including applications to elementary particle physics. Prerequisite: PHYS 332."}, {"courseNum": "PHYS 350", "courseName": "Undergraduate Research", "info": "Undergraduate research. Prerequisite: permission of the instructor."}, {"courseNum": "POLS 140", "courseName": "American Politics", "info": "A critical examination of the principles, structures, and processes that shape American politics. An emphasis on political behavior and institutions with applications to contemporary political issues."}, {"courseNum": "POLS 170", "courseName": "International Politics", "info": "Introduction to major dynamics of international politics; the international system, decision making, perceptions, cooperation, conflict, and policy instruments, such as diplomacy and war. Analysis is linked to specific international events and issues."}, {"courseNum": "POLS 205", "courseName": "Comparative Politics", "info": "Politics and policy outside the United States; concepts for the comparison of political systems. Democracy, Third World politics, revolution, political stability and change, international effects on political processes."}, {"courseNum": "POLS 210", "courseName": "Political Theory", "info": "Examination of the moral dimensions of politics. Authors include Plato, Aristotle, Milton, Hobbes, Locke, Rousseau, and Marx. Major concepts include justice, freedom, rights, and authority."}, {"courseNum": "POLS 219", "courseName": "Latin American Politics", "info": "The dynamics of politics in Latin American social, economic, and cultural context, with use of general comparative concepts of politics."}, {"courseNum": "POLS 223", "courseName": "European Politics", "info": "Comparative analysis of institutions and policy-making in European political systems, including the European Union."}, {"courseNum": "POLS 226", "courseName": "East Asian Politics", "info": "This course surveys political history, political institutions, economy, and society of major countries in East Asia, with focus on the continuity and changes in politics and policies of China, Japan, and Korea. Crosslisted as EAST 226 and IREL 226."}, {"courseNum": "POLS 234", "courseName": "State and Local Internship Program", "info": "Participants explore politics and policy at the state and local level through integrated class work, independent research, and real world work experiences. Prerequisite: permission of the instructor."}, {"courseNum": "POLS 235", "courseName": "Media and Politics", "info": "This course explores the role of the news media in American politics. Ideas to be discussed include: the relationship between elected officials and the media, campaign advertising and media coverage of elections, and the role of the media in shaping public opinion and public policy."}, {"courseNum": "POLS 259", "courseName": "Philosophy of Race", "info": "Critical examination of the nature and meaning of \"race\" in terms of conceptual analysis, experience, social constructionism, feminism, class, ethnicity, politics, colonialism, violence, and redress. Crosslisted as AFST 229 and PHIL 229."}, {"courseNum": "POLS 267", "courseName": "Philosophy of Revolution", "info": "An exploration and analysis of the concept of revolution in political philosophy from modernity to the present day, examining ways that political philosophers have sought to make revolution unnecessary as well as how and why they have emphasized its necessity. Crosslisted as PHIL 276."}, {"courseNum": "POLS 275", "courseName": "Global Governance", "info": "This course explores the rationales, processes, and institutions of multilateral governance in a globalized world. We examine the U.N. nongovernmental organizations, conflict resolution, economic development, environment, human rights, and international law. Not open to first-year students. Crosslisted as IREL 275."}, {"courseNum": "POLS 280", "courseName": "War", "info": "This course focuses on the causes of wars. Theories from many disciplines are examined in relation to interstate wars. Applying these theories to different wars, through the use of case studies, will comprise a large part of the course."}, {"courseNum": "POLS 284", "courseName": "International Relations of Europe", "info": "This course will examine the foreign policies of European countries, individually and collectively through the European Union, toward each other, regional and global intergovernmental organizations and other regions/countries. Crosslisted as IREL 218."}, {"courseNum": "POLS 352", "courseName": "Politics of Economic Development", "info": "This course critically engages the tools, concepts, and theories that are used to examine the politics of economic development in poorer countries. Prerequisite: POLS 205 or permission of the instructor."}, {"courseNum": "POLS 371", "courseName": "Minority Politics", "info": "This course is designed to provide students with a comprehensive understanding of how minority groups operate within the U.S. political system."}, {"courseNum": "POLS 381", "courseName": "Arab-Israeli Conflict, Peace Process", "info": "This course examines the failures/successes of the peace process among Israel, the Arab States, and the Palestinians.  Special focus is on Oslo peace process, outstanding issues, and the involvement of outside actors, particularly the role of the U.S. Prerequisite: POLS 170 or permission of instructor. Crosslisted as IREL 381."}, {"courseNum": "POLS 382", "courseName": "U.S.-China Relations", "info": "Through tracing the evolution of U.S.-China relations from the 18th century to the present, this course discusses major issues and challenges between the two countries. Future trends of the relationship will also be explored. Prerequisite: POLS 170. Preference given to POLS/IREL/EAST seniors. Crosslisted as EAST 382 and IREL 482."}, {"courseNum": "PSYC 100", "courseName": "Introduction to Psychology", "info": "A survey of concepts, principles, and theories of an empirical science of behavior."}, {"courseNum": "PSYC 203", "courseName": "Learning", "info": "The study of basic mechanisms of associative learning in motivated behavior, especially Pavlovian and operant conditioning in the behaviors of various species.Prerequisite: PSYC 100 or ANBE 266 or NEUR 100 or permission of the instructor."}, {"courseNum": "PSYC 204", "courseName": "Human Cognition", "info": "A survey of the theories and methods employed in studying human mental abilities. Issues include attention, memory, language, problem solving, and decision making. Prerequisite: NEUR 100 or PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 207", "courseName": "Developmental Psychology", "info": "Study of stages, sequences, and processes in normal child development, prenatal through childhood. Emphasis on interaction of nature and nurture in cognitive, social, emotional development. Prerequisite: PSYC 100, EDUC 201 is accepted as an alternate prerequisite for students who are Education Bachelor of Science majors, or permission of the instructor."}, {"courseNum": "PSYC 209", "courseName": "Social Psychology", "info": "Theories of social influence and social interaction, their empirical foundations and implications for the individual and society. Prerequisite: PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 212", "courseName": "Emotion", "info": "An introduction to theory and research in the psychology of emotion. Prerequisite: PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 213", "courseName": "Abnormal and Clinical Psychology", "info": "A critical introduction to psychological disorders, theories of their causes, and approaches to their treatments. Includes an observational practicum in a psychiatric facility. Prerequisite: PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 215", "courseName": "Psychological Statistics", "info": "An introduction to basic statistical analyses in psychology. Prerequisite: PSYC 100, NEUR 100, or ANBE 266 or permission of the instructor."}, {"courseNum": "PSYC 216", "courseName": "Research Methods in Psychology", "info": "An introduction to the methods used and issues faced by psychological researchers. Topics include ethics, study design (true-experimental, correlational, and quasi-experimental), data collection and analysis, and communication of empirical findings. A foundation for other research-based courses in Psychology. Prerequisites: PSYC 100 and PSYC 215 or MATH 216."}, {"courseNum": "PSYC 229", "courseName": "Directed Study in Psycholoygy", "info": "An entry into psychological research or other independent study directed by a faculty member. Experiences might include library work, collecting data, entering and analyzing data, and other activities associated with engagement in research and in faculty-directed inquiry. Prerequisite: PSYC 100 and instructor permission."}, {"courseNum": "PSYC 240", "courseName": "Multicultural Psychology", "info": "A survey of multiculturalism as a major paradigm in psychology.  Analysis of multicultural principles, concepts, and sociocultural factors and their impact on assessment, practice, and research. Course topics include an exploration of diverse worldviews, communication styles, identity development, acculturation, stereotyping, prejudice, discrimination, structural oppression, and the development of cultural competence."}, {"courseNum": "PSYC 248", "courseName": "Developmental Psychobiology", "info": "Addresses development in humans from conception through adolescence with some comparative analysis with non-humans. Emphasis on both normal and atypical cognitive, neuropsychological and neurobiological development. Prerequisite: PSYC 100 or NEUR 100. Crosslisted as NEUR 248."}, {"courseNum": "PSYC 250", "courseName": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as NEUR 250."}, {"courseNum": "PSYC 252", "courseName": "Sensation and Perception", "info": "Anatomy and functions of the sensory systems: vision, audition, kinesthesis, vestibular sensation, taste and smell, with emphasis on theory and abnormalities of the human sensory systems. Prerequisites: NEUR 100 or PSYC 100 and permission of the instructor."}, {"courseNum": "PSYC 286", "courseName": "Research Methods Developmental Psychobiology", "info": "This course introduces students to various research methods and approaches relevant to the study of developmental psychopathology, including children with neurodevelopmental and neuropsychiatric disorders. Some of these methods will include an introduction to neuroimaging tools and neuropsychological testing, as well as recent trends such as managing data from existing data."}, {"courseNum": "PSYC 287", "courseName": "Research Methods in Multicultural Psychology", "info": "An introduction to research methods in multicultural psychology designed to understand the influence of culture on the physical and mental health of culturally diverse populations. Students will be exposed to qualitative, quantitative, and mixed methods approaches applied to community-based participatory research."}, {"courseNum": "PSYC 291", "courseName": "Research Methods in Abnormal Psychology", "info": "Laboratory and/or field research to accompany PSYC 213 Abnormal and Clinical Psychology. Prerequisites: PSYC 215 or MATH 216, and prerequisite or corequisite PSYC 213."}, {"courseNum": "PSYC 292", "courseName": "Research Methods in Sensation and Perception", "info": "Laboratory and/or field research to accompany PSYC 252 Sensation and Perception. Prerequisites: PSYC 215 or MATH 216 and prerequisite or corequisite PSYC 252."}, {"courseNum": "PSYC 293", "courseName": "Research Methods in Learning", "info": "Laboratory and/or field research to accompany PSYC 203 Learning. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or PSYC/ANBE 296, and prerequisite or corequisite PSYC 203."}, {"courseNum": "PSYC 294", "courseName": "Research Methods in Human Cognition", "info": "Laboratory to accompany PSYC 204 Human Cognition. Prerequisites: PSYC 215 or MATH 216 and prerequisite or corequisite PSYC 204."}, {"courseNum": "PSYC 298", "courseName": "Research Methods in Personality", "info": "Laboratory, field, or applied research to accompany PSYC 228 Personality Psychology. Prerequisites: PSYC 100 and PSYC 215 or MATH 216."}, {"courseNum": "PSYC 299", "courseName": "Research Methods in Social Psychology", "info": "Laboratory and/or field research to accompany PSYC 209 Social Psychology. Prerequisites: PSYC 100, PSYC 215 or MATH 216."}, {"courseNum": "PSYC 303", "courseName": "Critical Psychologies", "info": "Critical psychologies (e.g., critical liberation, radical) are progressive alternatives to mainstream psychology, emphasizing untoward consequences of the mainstream focus on the individual. Prerequisite: PSYC 100 or permission of the instructor. A service-learning practicum is part of the course. Crosslisted as PSYC 603."}, {"courseNum": "PSYC 307", "courseName": "Culture and Child Development", "info": "Study of culture-specific and universal processes in child development in diverse societies. Focus on cultural influences on social, emotional, and cognitive development, and on parenting, family, and education contexts and practices. Prerequisite: PSYC 207 or permission of the instructor. Crosslisted as PSYC 607."}, {"courseNum": "PSYC 309", "courseName": "Appetite and Eating Behavior", "info": "Advanced seminar considering psychological factors involved in appetite, food preferences, and food intake. Prerequisite: PSYC 203. Crosslisted as PSYC 609."}, {"courseNum": "PSYC 315", "courseName": "Language Development", "info": "Advanced seminar examining how children learn sounds, words, and grammar. Focus on reading primary research sources. Special topics based on students' interests. Prerequisites: PSYC 207 or PSYC 204 or LING 230 and a PSYC methods course and permission of the instructor. Crosslisted as PSYC 615."}, {"courseNum": "PSYC 322", "courseName": "Clinical Neuroscience", "info": "Through case studies, guest lectures, and review of primary literature this course will explore fundamental mechanisms that underlie diseases and disorders of the brain and central nervous system. Prerequisites: PSYC 250 or NEUR 250. Open to Biology, Neuroscience, and Psychology majors. Crosslisted as NEUR 322 and PSYC 622."}, {"courseNum": "PSYC 329", "courseName": "Undergraduate Research", "info": "Research or other independent study on any aspect of psychology. Research topics may be posed by students or faculty. Prerequisite: permission of the instructor."}, {"courseNum": "PSYC 348", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as NEUR 348 and PSYC 648."}, {"courseNum": "PSYC 349", "courseName": "Cognitive Neuroscience", "info": "Brain mechanisms of language, memory, and other processes as revealed by studies of human brain activity or pathology. Prerequisite: PSYC 204 or PSYC 250 or PSYC 252 or permission of the instructor. Crosslisted as PSYC 649."}, {"courseNum": "PSYC 352", "courseName": "Face Perception", "info": "Advanced seminar in face perception, including issues of holism, uniqueness, language, emotion, and race. Prerequisite: PSYC 204, PSYC 250, or PSYC 252 and permission of the instructor. Crosslisted as PSYC 652."}, {"courseNum": "PSYC 360", "courseName": "Honors Thesis", "info": "Prerequisites: permission of the department and permission of the instructor."}, {"courseNum": "PSYC 374", "courseName": "Latina/o Psychology", "info": "A seminar that examines the psychological research literature related to Latinas/os in the U.S. It considers the influences of Latina/o cultural values, practices, contexts and experiences on physical and mental health outcomes. Prerequisite: PSYC 216 or permission of the instructor. Crosslisted as PSYC 674."}, {"courseNum": "PSYC 375", "courseName": "Child Health Psychology", "info": "Study of the impact that pediatric illness has on child mental health and child development. Focus on the management of chronic illness, adherence, mental health concerns, coping, and family factors. Prerequisite: PSYC 207 or permission of the instructor. Crosslisted as PSYC 675."}, {"courseNum": "PSYC 603", "courseName": "Critical Psychologies", "info": "Critical psychologies (e.g., critical liberation, radical) are progressive alternatives to mainstream psychology, emphasizing untoward consequences of the mainstream focus on the individual. Crosslisted as PSYC 303."}, {"courseNum": "PSYC 607", "courseName": "Culture and Child Development", "info": "Study of culture-specific and universal processes in child development in diverse societies. Focus on cultural influences on social, emotional, and cognitive development, and on parenting, family, and education contexts and practices. Prerequisite: permission of the instructor. Crosslisted as PSYC 307."}, {"courseNum": "PSYC 609", "courseName": "Appetite and Eating Behavior", "info": "Advanced seminar considering psychological factors involved in appetite, food preferences, and food intake. Prerequisite: permission of the instructor. Crosslisted as PSYC 309."}, {"courseNum": "PSYC 615", "courseName": "Language Development", "info": "Advanced seminar examining how children learn the sounds, words, and grammar of their language. Special topics might include the social use of language, bilingualism, literacy, second language learning, or language disorders. Prerequisite: permission of the instructor. Crosslisted as PSYC 315."}, {"courseNum": "PSYC 622", "courseName": "Clinical Neuroscience", "info": "Through case studies, guest lectures, and review of primary literature this course will explore fundamental mechanisms that underlie diseases and disorders of the brain and central nervous system. Prerequisite: Permission of the instructor. Crosslisted as NEUR 322 and PSYC 322."}, {"courseNum": "PSYC 648", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as PSYC 348 and NEUR 348."}, {"courseNum": "PSYC 649", "courseName": "Cognitive Neuroscience", "info": "Brain mechanisms of language, memory, and other processes as revealed by studies of human brain activity or pathology. Prerequisite: permission of the instructor. Crosslisted as PSYC 349."}, {"courseNum": "PSYC 652", "courseName": "Face Perception", "info": "Advanced seminar in face perception, including holism, uniqueness, language, emotion, and race. Prerequisite: permission of the instructor. Crosslisted as PSYC 352."}, {"courseNum": "PSYC 674", "courseName": "Latina/o Psychology", "info": "A seminar that examines the psychological research literature related to Latinas/os in the U.S. It considers the influences of Latina/o cultural values, practices, contexts and experiences on physical and mental health outcomes. Prerequisite: Permission of the instructor. Crosslisted as PSYC 374."}, {"courseNum": "PSYC 675", "courseName": "Child Health Psychology", "info": "Study of the impact that pediatric illness has on child mental health and child development. Focus on the management of chronic illness, adherence, mental health concerns, coping, and family factors. Prerequisite: Permission of the instructor. Crosslisted as PSYC 375."}, {"courseNum": "RELI 100", "courseName": "Introduction to Religion", "info": "This course will introduce students to the academic study of religion to provide a foundation for religious literacy.  Multiple sections of this course are offered every semester, under a variety of titles."}, {"courseNum": "RELI 202", "courseName": "Hinduism", "info": "A historical survey of Hindu religious traditions. This course traces the development of Hindu scriptures, rituals, philosophies, and ethics from the ancient to the contemporary world. Concepts such as karma, yoga, and reincarnation will be put in the broader contexts of Hindu dharma (religious law), theism, and ritual."}, {"courseNum": "RELI 209", "courseName": "Israel: Land, People, and Tradition", "info": "Study of the complex relationship between Judaism and the sacred traditions of the Jews as related to the Land of Israel including the cultural situation and the Israeli-Palestinian conflict."}, {"courseNum": "RELI 216", "courseName": "Philosophy of Religion", "info": "Problems for rational inquiry arising from the claims and practices of religious faith, e.g., the nature of religious language, arguments for the existence of God, the concept of evil. Prerequisite: permission of the instructor. Crosslisted as PHIL 223."}, {"courseNum": "RELI 226", "courseName": "Environmental Ethics", "info": "A survey of the major theories of environmental ethics, with particular attention to the challenge of developing an ethic commensurate with increasing human power. Crosslisted as ENST 236."}, {"courseNum": "RELI 234", "courseName": "Issues of Religion and Culture", "info": "Focus on interdependence of religion and cultural phenomena: ideology; alienation; formation of world view; understandings of time and space; relation between church and state; faith and science."}, {"courseNum": "RELI 237", "courseName": "Judaism in Film", "info": "This is an introduction to Judaism in Film.  Judaism has been characterized as a culture, a civilization, a philosophy, a nation, an ethnic group, and a religion.  In this introductory class we will discuss ritual, ethical and historical issues."}, {"courseNum": "RELI 242", "courseName": "Religious Naturalism", "info": "This course will examine some of the diverse perspectives and ideas associated with religious naturalism. Students will explore the ways religious naturalists reconceptualize traditional concepts (God or supernatural theism), and examine their various approaches to understanding evil, morality, human nature, and humans' connectivity to nature."}, {"courseNum": "RELI 253", "courseName": "Dying For God: Martyrs and Monks", "info": "Early Christians were attracted to dramatic narratives of suffering--whether about spectacular deaths in the arena or extreme self-denial in the desert. This course explores the world of martyrs and monks and considers how ancient ideals about pain, gender, and sexuality continue to influence Christian thinking about holiness and sainthood. Crosslisted as CLAS 235 and WMST 245."}, {"courseNum": "RELI 312", "courseName": "Digesting Divinity: Religion and Food", "info": "This course considers the relationship between food, consumption, and the construction of religious identity. Students will read a wide range of sources from antiquity to the present, exploring the ways in which food customs structure human belief and function as a point of communication between humanity and divinity."}, {"courseNum": "RELI 320", "courseName": "Individual Studies In Religion", "info": "Guided investigations. Open to qualified students with some previous study of religion who wish to pursue individual programs of study in the field. Prerequisite: Only by permission of the instructor."}, {"courseNum": "RELI 400", "courseName": "Senior Seminar", "info": "The Senior Seminar is required for all majors in Religious Studies, and is designed to give majors an opportunity to integrate the knowledge and skills they have acquired, and to hone their research, writing, and oral skills. Prerequisites: Open to seniors in Religious Studies only."}, {"courseNum": "RESC 221", "courseName": "Residential College Sophomore Program", "info": "Students will complete the set of learning experiences constructed in the fall and will present their work to first-year students in the same Residential College. Prerequisite: permission of the instructor."}, {"courseNum": "RUSS 101A", "courseName": "Intensive Elementary Russian", "info": "Intensive elementary Russian in speaking, reading, writing, and comprehending Russian. Fundamentals of first-year Russian covered in one semester."}, {"courseNum": "RUSS 102", "courseName": "Elementary Russian II", "info": "Fundamentals of speaking, reading, writing, and comprehending Russian, and an introduction to Russian culture. Prerequisite: RUSS 101 or equivalent is prerequisite for RUSS 102."}, {"courseNum": "RUSS 104", "courseName": "Intermediate Russian II", "info": "Advanced points of grammar and review of grammar. Training in all language skills combined with the study of cultural texts. Prerequisite: RUSS 102 or equivalent for RUSS 103; RUSS 103 is the prerequisite for RUSS 104."}, {"courseNum": "RUSS 204", "courseName": "Russian Conversation", "info": "Concentrated development of speaking skill. Conducted entirely in Russian by a native speaker. Intended for students enrolled in 200- and 300-level courses. This course cannot be taken more than twice."}, {"courseNum": "RUSS 209", "courseName": "Russian Complementary Reading", "info": "Russian sources read in conjunction with English language courses. Independent course of study established by instructor and student. Prerequisite: the equivalent of four semesters of Russian. This course cannot be taken more than twice."}, {"courseNum": "RUSS 252", "courseName": "Russian Through Literature", "info": "A study of Russian through literary works by contemporary Russian writers. In Russian."}, {"courseNum": "RUSS 255", "courseName": "Dangerous Texts: 20th-century Russian Literature", "info": "Discussion of major trends and key literary figures in Russian literature from the 1917 Revolution to post-Soviet Russia. Focuses on texts that challenge established orthodoxies. In English"}, {"courseNum": "RUSS 311", "courseName": "Readings in Russian Literature", "info": "An advanced study of the Russian language through close reading and discussion of short works by major Russian writers. In Russian. Not open to students who have taken RUSS 252."}, {"courseNum": "RUSS 393", "courseName": "Honors in Russian", "info": "Independent study for RUSS 393 Honors in Russian. Prerequisite: permission of the instructor."}, {"courseNum": "SIGN 102", "courseName": "Elementary American Sign Language II", "info": "An introduction to American Sign Language. Training and practice in signing together with approaches to communicating with deaf people. Prerequisite: SIGN 101 or equivalent."}, {"courseNum": "SOCI 100", "courseName": "Introduction to Sociology", "info": "The concepts and methods sociologists use to investigate human groups. Focuses on the study of social organization, its variety and development."}, {"courseNum": "SOCI 140", "courseName": "American Culture and Society", "info": "Exploration of topics including individualism, youth, culture, media, sport, health and the body, education, immigration, religion, sex, and death."}, {"courseNum": "SOCI 201", "courseName": "Field Research in Local Communities", "info": "Participant-observation, interviewing, and other field research methods. Students will devise and conduct their own ethnographic research projects in a local community. Crosslisted as ANTH 201."}, {"courseNum": "SOCI 203", "courseName": "Social Psychology", "info": "Survey of major theoretical/methodological approaches in social psychology (social cognition, exchange theory, group dynamics, etc.). Emphasis on evaluation/application of each theory."}, {"courseNum": "SOCI 209", "courseName": "Analyzing the Social World", "info": "A course in sociological data analysis, using the General Social Survey and other data sets, promoting student research."}, {"courseNum": "SOCI 212", "courseName": "Sociological Theory", "info": "This course introduces students to theory construction and development in the social sciences. We will explore a range of theoretical types and traditions (e.g., evolutionary theories, functionalism, conflict theories, structuralism, exchange theories, interactionism)."}, {"courseNum": "SOCI 238", "courseName": "Brain, Mind, Self, and Society", "info": "This course presents a biosocial perspective on the human self and personality. Examination of descriptions and explanations for human consciousness, agency, behavior, and experience of self from the social sciences and neurosciences."}, {"courseNum": "SOCI 241", "courseName": "Marriages and Families in the 21st Century", "info": "Focusing on courtship, marriages, and families in the 21st century U.S., we explore how work and family life vary by gender, race, and social class."}, {"courseNum": "SOCI 243", "courseName": "Sociology of Race and Ethnicity", "info": "Studies the concepts and social significance of race/ ethnicity and major race/ethnic groups within the United States. Emphasis on varying theoretical and methodological approaches to the sociological study of race/ethnicity."}, {"courseNum": "SOCI 251", "courseName": "Violence and Society", "info": "The study of violent social, political, and legal institutions: domestic violence, sexual coercion, vigilantism, political conflict; the production and control of criminal violence."}, {"courseNum": "SOCI 300", "courseName": "Evolution, Biology and Society", "info": "Exploration of the contribution of the biological sciences to understanding of human social organization and behavior. Theoretical tools from evolutionary biology, sociobiology, behavioral genetics, and neurobiology are applied to the study of a range of sociological topics (e.g., sexuality and sex difference, stratification, aggression and violence, morality, self-interest and altruism)."}, {"courseNum": "SOCI 309", "courseName": "How Holocausts Happen", "info": "A comparative-historical analysis of genocide, politicide, and the Holocaust, from premodern colonial regimes through Darfur, examining social, psychological, political and economic determinants. Prerequisite: seniors only; juniors by permission of the instructor."}, {"courseNum": "SOCI 341", "courseName": "Seminar in Law and Society", "info": "Structure and process of legal institutions: police, courts, prisons, lawyers, juries, and extralegal mechanisms relevant to the legal system."}, {"courseNum": "SPAN 101", "courseName": "Elementary Spanish I", "info": "Beginning language skills, with practice of points of grammar, through listening, speaking, reading and writing, in the context of Hispanic cultures. SPAN 101 is prerequisite to SPAN 102."}, {"courseNum": "SPAN 102", "courseName": "Elementary Spanish II", "info": "Continues development of basic language skills, with practice of points of grammar, in the context of Hispanic culture. Prerequisite: SPAN 101 or two years of Spanish in high school."}, {"courseNum": "SPAN 103", "courseName": "Toward Intermediate Spanish", "info": "Through grammar review and the development of new linguistic skills, in the context of Hispanic cultures, students reach intermediate competency in Spanish. Prerequisite: SPAN 102 or three years of secondary school Spanish."}, {"courseNum": "SPAN 105", "courseName": "Intermediate Spanish", "info": "Review of grammar and development of new linguistic skills and cultural competency to reach high-intermediate level in Spanish. Prerequisite: SPAN 103 or four years of secondary school Spanish."}, {"courseNum": "SPAN 207", "courseName": "Toward Advanced Spanish", "info": "Students demonstrating high-intermediate skills progress toward advanced language proficiency. Reading, discussion and writing about brief literary or cultural texts advances cultural competency. Prerequisite: SPAN 105 or five years of secondary school Spanish."}, {"courseNum": "SPAN 208", "courseName": "Advanced Conversation and Composition", "info": "Advanced study and practice to enhance oral and written proficiency. A variety of texts and media, including literature, film and internet sources provide a point of departure for class discussion and written assignments. Prerequisite: SPAN 207 or six years of Spanish."}, {"courseNum": "SPAN 222", "courseName": "Introduction to Latin American Literature", "info": "Introduction to the authors, topics and genres that constitute the literary tradition of Latin America. Literary works are studied in their historical and cultural context."}, {"courseNum": "SPAN 245", "courseName": "Vida y Cultura en Espana", "info": "Guides students in their experience of life and culture in Spain, and fosters their reflection on the cross-cultural learning experience. Prerequisite: SPAN 207 or equivalent. Only given in the Bucknell en Espana program."}, {"courseNum": "SPAN 270", "courseName": "Spanish Cultural Tradition", "info": "An introduction to the cultural tradition of Spain through the study of art, history, literature, and film. Prerequisite: SPAN 208."}, {"courseNum": "SPAN 280", "courseName": "Latin American Cultural Traditions", "info": "An introduction to the cultural traditions of Latin America through the study of art, history, literature, and film. Prerequisite: SPAN 208."}, {"courseNum": "SPAN 285", "courseName": "Latino Literature in the U.S.", "info": "This course focuses on issues of cultural identity within the literary and some film production of Hispanic peoples living in the U.S."}, {"courseNum": "SPAN 339", "courseName": "Topics in Hispanic Linguistics", "info": "Advanced study of topics or issues in Hispanic Linguistics. Prerequisites: two 200-level courses beyond SPAN 208."}, {"courseNum": "SPAN 361", "courseName": "Topics in Hispanic Literature", "info": "These courses will deal with topics in Spanish or Latin American literature on an advanced level. Prerequisites: two 200-level courses beyond SPAN 208."}, {"courseNum": "THEA 101", "courseName": "Technical Theatre Practicum", "info": "Quarter-course credit for supervised participation in any one of several aspects of theatrical production of the Department of Theatre and Dance's major productions. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 102", "courseName": "Theatrical Rehearsal and Performance", "info": "Quarter-course credit for substantial participation in a major theatrical production; for example, as actor, stage manager, vocal coach, choreographer. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 145", "courseName": "Bucknell Backstage", "info": "Bucknell Backstage is an introductory course where craft, art and engineering intersect. Subject areas include Stage Management, Lighting, Sound, Properties, Painting, Stagecraft, Rigging and Wardrobe. Preference given to Theatre Majors. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 220", "courseName": "Acting Methods", "info": "Application of technique and improvisation to the performance of scenes, with emphasis on characterization and textual analysis. Prerequisites: THEA 110 and permission of the instructor."}, {"courseNum": "THEA 249", "courseName": "Mask and Makeup Design", "info": "The study of stage makeup (including corrective and character) progresses to the design of makeup as mask and then to the design of three-dimensional masks for performance. Our study emphasizes the ways that the performance, ritual, and festival traditions of the Americas, Africa, Asia, Europe and Oceania have influenced present performance styles in theatre and dance."}, {"courseNum": "THEA 251", "courseName": "Costume Design", "info": "Introduction to design of clothing for the stage; emphasis on character analysis and design for plays in different styles and periods."}, {"courseNum": "THEA 265", "courseName": "Special Studies in Theatre", "info": "In appropriate years, special topics such as stage combat, mime, or theatrical criticism will be studied."}, {"courseNum": "THEA 319", "courseName": "Individual Projects", "info": "Individual, special projects supervised by the instructor, honors thesis. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 342", "courseName": "Devising Performance", "info": "An exploration into the process of creating collaborative theatre. This class examines new ways of authoring performance with multiple artists (designers, writers, performers, etc.) working together to manifest a shared vision. Prerequisites: THEA 240 and/or DANC 262."}, {"courseNum": "THEA 365", "courseName": "Independent Studies in Theatre", "info": "Independent special studies in theatre or dance performance, history, design, or technology. Prerequisite: permission of the instructor."}, {"courseNum": "UNIV 140", "courseName": "Social Science Methods Survey Workshop", "info": "This team-taught course introduces multiple methodologies employed in social science disciplines for students considering independent research or deciding between social science majors. Students will gain broad comparative knowledge about the strengths, applicability, types of data produced by various methodological approaches, and how to pursue more advanced methodological training."}, {"courseNum": "UNIV 199", "courseName": "Arts Entrepreneurship", "info": "This survey course explores the theories, processes and practices involved in entrepreneurship in arts practice and cultural organizations. The course features guest lectures by faculty and staff who are experts in arts entrepreneurship."}, {"courseNum": "UNIV 200", "courseName": "Integrated Perspectives Course", "info": "Team-taught interdisciplinary course. Topics vary."}, {"courseNum": "UNIV 214", "courseName": "Fresh Water", "info": "The availability of fresh water will be a major issue in many regions around the world during the 21st century (the \"global water crisis\"). This course examines the problem from a variety of perspectives including religion, aesthetics, ethics, chemistry, biology, geology, engineering, economics, law, and sustainability."}, {"courseNum": "UNIV 234", "courseName": "Transformative Dialogue and Social Justice", "info": "Students will explore the impact of systems of power at interpersonal, community, cultural, institutional and societal levels. Employing forms of dialogic communication designed for people to communicate across social, cultural and power differences, students will explore their own and other groups’ experiences, also identifying actions to address social justice issues. Crosslisted as WMST 234."}, {"courseNum": "UNIV 239", "courseName": "Working with Writers: Theory and Practice", "info": "Theory and Practice. An exploration of the social and intellectual dynamics of the writing and tutoring process. Prerequisite: permission of the instructor."}, {"courseNum": "UNIV 248", "courseName": "Intermediality: Italy, Film, and the Arts", "info": "This IP course will focus on intermediality, film, and Italy. It seeks to examine the relationships of cinema with the other arts, in particular the arts of Italy. Crosslisted as ENFS 248 and ITAL 248."}, {"courseNum": "UNIV 261", "courseName": "Nazi Culture", "info": "A study of Nazi attitudes toward the arts, science, education, mass media, work, morality, sex, war, and religion. In English. Crosslisted as GRMN 261."}, {"courseNum": "UNIV 262", "courseName": " The Modern Jewish Experience in Lit&Film;", "info": "The course explores modern Jewish life around the world through a variety of perspectives, including literature, film, history, and memoir. Emphasis is placed on Jews in Israel and the U.S., as well as on immigration and the Holocaust. Crosslisted as HEBR 252."}, {"courseNum": "UNIV 270", "courseName": "Technical Prospectives: Life, the Universe, and Engineering", "info": "Technical and critical evaluation of issues in our society using principles of mass and energy conservation and engineering design methodology. Issues may include: global warming, disposal of hazardous waste, product and advertisements, pharmaceutical development and testing, product manufacturing, successes and failures."}, {"courseNum": "WMST 150", "courseName": "Introduction to Women's and Gender Studies", "info": "Interdisciplinary introduction to the major theories, themes, methodologies, and issues of women's studies. Emphasis in the social sciences."}, {"courseNum": "WMST 208", "courseName": "The Red Brush: Women Writers in Imperial China", "info": "In this course we explore the writings of Chinese women from the 1st to the early 20th centuries, and discuss the changing social and historical contexts within which these women wrote, and the obstacles these women writers had to overcome in order to ensure that their voices were heard. Crosslisted as EAST 208."}, {"courseNum": "WMST 230", "courseName": "Feminist Philosophy", "info": "An examination of feminist philosophy primarily as it occurs in the U.S. from the late 18th century to the present. Prerequisite: PHIL 100 or WMST 150 or permission of the instructor. Crosslisted as PHIL 230."}, {"courseNum": "WMST 234", "courseName": "Transformative Dialogue and Social Justice", "info": "Students will explore the impact of systems of power at interpersonal, community, cultural, institutional and societal levels. Employing forms of dialogic communication designed for people to communicate across social, cultural and power differences, students will explore their own and other groups’ experiences, also identifying actions to address social justice issues. Crosslisted as UNIV 234."}, {"courseNum": "WMST 244", "courseName": "Global Feminisms", "info": "The course investigates the often conflicting meanings for the term “feminism” that cut across international feminist politics, academic debates and the local/global politics of place and identity. Crosslisted as IREL 244."}, {"courseNum": "WMST 245", "courseName": "Dying for God: Martyrs and Monks", "info": "Early Christians were attracted to dramatic narratives of suffering--whether about spectacular deaths in the arena or extreme self-denial in the desert. This course explores the world of martyrs and monks and considers how ancient ideals about pain, gender, and sexuality continue to influence Christian thinking about holiness and sainthood. Crosslisted as CLAS 235 and RELI 253."}, {"courseNum": "WMST 270", "courseName": "Special Topics in Women's and Gender Studies", "info": "A course on special topics of interest to faculty members, offered occasionally. Subject varies."}, {"courseNum": "WMST 290", "courseName": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Prerequisite: EDUC 201 or permission of the instructor. Crosslisted as EDUC 290 and EDUC 690."}, {"courseNum": "WMST 320", "courseName": "Independent Studies", "info": "Independent study supervised by Women's and Gender Studies faculty member. Prerequisite: permission of the instructor."}, {"courseNum": "WMST 333", "courseName": "Black Feminism", "info": "This course explores the context, development, and outcomes of black feminists in the United States during the second half of the 20th century."}, {"courseNum": "WMST 370", "courseName": "Special Topics in Women's and Gender Studies", "info": "Advanced course on special topics of interest to faculty members, offered occasionally. Subject varies."}, {"courseNum": "WMST 390", "courseName": "Honors in Women's and Gender Studies", "info": "Individual, special projects supervised by instructor, culminating in honors thesis. Prerequisite: permission of the instructor."}, {"courseNum": "WMST 400", "courseName": "Advanced Seminar in Women's and Gender Studies", "info": "The seminar will focus on the production of an independent research project by each student, with common readings on the practice of feminist scholarship. Students will develop and give formal presentations of their projects. Prerequisites: open to seniors, juniors by permission, WMST 150 and WMST 220 or WMST 230/PHIL 230."}]