{"department": [{"abbreviation": "ACFM", "name": "Accounting & Financial Management"}, {"abbreviation": "AFST", "name": "Africana Studies"}, {"abbreviation": "ANBE", "name": "Animal Behavior"}, {"abbreviation": "ANTH", "name": "Anthropology"}, {"abbreviation": "ARBC", "name": "Arabic"}, {"abbreviation": "ARTH", "name": "Art History"}, {"abbreviation": "ARST", "name": "Art Studio"}, {"abbreviation": "ASTR", "name": "Astronomy"}, {"abbreviation": "BIOL", "name": "Biology"}, {"abbreviation": "BMEG", "name": "Biomedical Engineering"}, {"abbreviation": "CHEG", "name": "Chemical Engineering"}, {"abbreviation": "CHEM", "name": "Chemistry"}, {"abbreviation": "CHIN", "name": "Chinese"}, {"abbreviation": "CEEG", "name": "Civil & Environmental Engineering"}, {"abbreviation": "CLAS", "name": "Classics"}, {"abbreviation": "CSCI", "name": "Computer Science"}, {"abbreviation": "ENCW", "name": "Creative Writing"}, {"abbreviation": "DANC", "name": "Dance"}, {"abbreviation": "EAST", "name": "East Asian Studies"}, {"abbreviation": "ECON", "name": "Economics"}, {"abbreviation": "EDUC", "name": "Education"}, {"abbreviation": "ECEG", "name": "Electrical & Computer Engineering"}, {"abbreviation": "ENGR", "name": "Engineering"}, {"abbreviation": "ENGL", "name": "English"}, {"abbreviation": "ENST", "name": "Environmental Studies"}, {"abbreviation": "ENFS", "name": "Film/Media Studies"}, {"abbreviation": "FOUN", "name": "Foundation Seminar"}, {"abbreviation": "FREN", "name": "French"}, {"abbreviation": "GEOG", "name": "Geography"}, {"abbreviation": "GEOL", "name": "Geology"}, {"abbreviation": "GRMN", "name": "German"}, {"abbreviation": "GLBM", "name": "Global Management"}, {"abbreviation": "GREK", "name": "Greek"}, {"abbreviation": "HEBR", "name": "Hebrew"}, {"abbreviation": "HIST", "name": "History"}, {"abbreviation": "HUMN", "name": "Humanities"}, {"abbreviation": "IREL", "name": "International Relations"}, {"abbreviation": "ITAL", "name": "Italian"}, {"abbreviation": "JAPN", "name": "Japanese"}, {"abbreviation": "LATN", "name": "Latin"}, {"abbreviation": "LAMS", "name": "Latin American Studies"}, {"abbreviation": "LING", "name": "Linguistics"}, {"abbreviation": "ENLS", "name": "Literary Studies"}, {"abbreviation": "MGMT", "name": "Management"}, {"abbreviation": "MSUS", "name": "Managing for Sustainability"}, {"abbreviation": "MIDE", "name": "Markets, Innovation & Design"}, {"abbreviation": "MATH", "name": "Mathematics"}, {"abbreviation": "MECH", "name": "Mechanical Engineering"}, {"abbreviation": "MILS", "name": "Military Science"}, {"abbreviation": "MUSC", "name": "Music"}, {"abbreviation": "NEUR", "name": "Neuroscience"}, {"abbreviation": "PHIL", "name": "Philosophy"}, {"abbreviation": "PHYS", "name": "Physics"}, {"abbreviation": "POLS", "name": "Political Science"}, {"abbreviation": "PSYC", "name": "Psychology"}, {"abbreviation": "RELI", "name": "Religion"}, {"abbreviation": "RESC", "name": "Residential Colleges"}, {"abbreviation": "RUSS", "name": "Russian"}, {"abbreviation": "SIGN", "name": "Sign Language"}, {"abbreviation": "SOCI", "name": "Sociology"}, {"abbreviation": "SPAN", "name": "Spanish"}, {"abbreviation": "THEA", "name": "Theatre"}, {"abbreviation": "UNIV", "name": "University Course"}, {"abbreviation": "WMST", "name": "Women's and Gender Studies"}], "course": [{"abbreviation": "ACFM 201", "name": "Business Law", "info": "Introduction to business law. Topics include contracts, the Uniform Commercial Code, agency, and business structures. Not open to first-year students or students who have taken ACFM 220."}, {"abbreviation": "ACFM 203", "name": "Corporate Finance", "info": "Concepts, principles, and recent innovations in corporate finance: risk and return, valuation, capital budgeting and structure, dividend policy, financial planning, risk management. Prerequisite: MGMT 104. Not open to students who have taken ACFM 370."}, {"abbreviation": "ACFM 204", "name": "Foundations of Accounting II", "info": "Covers general purpose financial statements, the theoretical framework that underlies the measurement of income, and asset and liability valuation. Prerequisite: MGMT 104 or MGMT 200. Not open to students who have taken ACFM 261."}, {"abbreviation": "ACFM 266", "name": "Principles of Real Estate", "info": "This class will provide an overview of the real estate industry including roles, activities and players in the industry; basic legal aspects of ownership and various contracts; and the valuation of various real estate assets and debt instruments."}, {"abbreviation": "ACFM 302", "name": "Business Analytics & Financial Modeling", "info": "Decision making of individuals and groups in organizations, emphasizing the organization's financial dimension. Topics include linear and nonlinear optimization with applications in finance and accounting, fundamentals of portfolio and risk management, and the application of Monte Carlo methods to the pricing of financial derivatives. Note two prerequisites."}, {"abbreviation": "ACFM 321", "name": "Intermediate Financial Accounting I", "info": "Accounting theory and practice applicable to income determination and asset valuation. This course develops students' understanding of the accounting and financial reporting environment. Prerequisite: ACFM 204 or ACFM 261. Not open to students who have taken ACFM 351."}, {"abbreviation": "ACFM 322", "name": "Intermediate Financial Accounting II", "info": "A continuation of ACFM 321. Topics include: investments, debt, leases, pensions, deferred taxes, EPS, equity, and cash flows. Prerequisite: ACFM 321 or ACFM 351. Not open to students who have taken ACFM 352."}, {"abbreviation": "ACFM 323", "name": "Advanced Financial Accounting", "info": "Accounting theory and practice applicable to business combinations and additional advanced topics related to financial reporting. Prerequisite: ACFM 322 or ACFM 352 or permission of the instructor. Not open to students who have taken ACFM 353."}, {"abbreviation": "ACFM 324", "name": "Individual Federal Income Taxes", "info": "Survey of federal income taxes with emphasis on individual tax law, practice, and planning. Prerequisite: junior or senior status. Not open to students who have taken ACFM 354."}, {"abbreviation": "ACFM 326", "name": "Managerial & Cost Accounting", "info": "Examines managerial accounting and cost behavior, specifically, how product cost information is recorded, reported, analyzed and used by managers in decision making. Includes preparation and analysis of operating budgets and capital budgets. Prerequisite: ACFM 204 or ACFM 261. Not open to students who have taken ACFM 365."}, {"abbreviation": "ACFM 327", "name": "Auditing & Assurance", "info": "This course helps students develop a strong foundation for quality professional judgments to support the practice of auditing by examining professional and ethical standards and understanding the audit process. Prerequisite: ACFM 204 or ACFM 261. Not open to students who have taken ACFM 357."}, {"abbreviation": "ACFM 361", "name": "Financial Statement Analysis", "info": "Students will learn to read, analyze, and interpret financial disclosures at a more sophisticated level, and learn statement analysis to make judgments about the quality of reported earnings, to forecast future results and, ultimately, to value companies. Prerequisites (ACFM 203 or ACFM 370) and (ACFM 204 or ACFM 261)."}, {"abbreviation": "ACFM 362", "name": "Investments", "info": "Principles of investment practice and theory. Emphasis on the fundamentals of intangible investments (equities, debt and derivative instruments). Two prerequisites: MGMT 102 (or MATH 216 or PSYC 215) and (ACFM 203 or ACFM 370) or permission of the instructor. Not open to students who have taken ACFM 377."}, {"abbreviation": "ACFM 363", "name": "Topics in Financial Management", "info": "Topic for this course is specific to the semester the course is offered and will be listed in the course guide at the time of registration. Example topics include banking in the capital markets, the mass investing society, advanced corporate finance. Prerequisites, if any, will be set by the instructor."}, {"abbreviation": "ACFM 375", "name": "Student Managed Investment Fund I", "info": "The first course of a two semester experiential learning exercise in which students manage a real dollar investment portfolio. Subsequent completion of ACFM 476 required to obtain course credit. Prerequisites: ACFM 362 or ACFM 377 and permission of the instructor."}, {"abbreviation": "ACFM 476", "name": "Student Managed Investment Fund II", "info": "The second course of a two semester portfolio management course in which students manage a real dollar investment portfolio.  Prerequisite: ACFM 375 and permission of the instructor."}, {"abbreviation": "AFST 199", "name": "Introduction to Africana Studies", "info": "The course introduces students to concepts, theories, and debates of the vibrant discipline of Africana Studies. It surveys major themes, questions, concerns, and events of African, African American, and other African diasporic communities. The course examines the making of the modern world through the lens of black global experience."}, {"abbreviation": "AFST 201", "name": "Introduction to Black Performance", "info": "This course will introduce students to the field of performance theory as it is engaged through the lens of the Black World. It will place scholars in Black performance theory in conversation with scholars working in the black radical tradition whose work raises important questions about performance, blackness, and more."}, {"abbreviation": "AFST 255", "name": "Radical Black Drama and Performance", "info": "This course presents an ensemble of playwrights from the 19th century into the present, whose dramatic works consider the predicament of the blackness in the world. This course pays particular attention to plays not just as artistic creations but also as political and performative gestures."}, {"abbreviation": "AFST 260", "name": "Black Women and Activism", "info": "This course examines the multiple ways Black women activists have and continue to shape histories and present realities in the Americas and on the continent of Africa."}, {"abbreviation": "AFST 265", "name": "(Really) Reading Black Plays", "info": "This course will examine the plays of Pulitzer Prize-winning playwright, August Wilson and by extension explore what is so often referred to as the “Black experience” in a regional, national, and global context."}, {"abbreviation": "AFST 295", "name": "Hip-Hop and Blackness", "info": "This course will explore the ways in which hip-hop culture has impacted global youth culture, particularly within the realms of music, film, television, clothing styles, politics, language, public policy, race, gender and sexuality. In summary, it will provide a much-needed perspective on the intersection of hip hop and blackness."}, {"abbreviation": "AFST 302", "name": "Contemporary Africa & Colonial Pasts: Investments and Re-Emergences", "info": "Globalized investment, oil extraction, Oprah and Bono-endorsed RED products, a rising middle class: This course addresses contemporary political economy, meanings of 'the continent', and colonial legacy in Africa.  We draw on human geography, African history, postcolonial and feminist studies, and literature to understand a rapidly changing continent. Crosslisted as GEOG 302."}, {"abbreviation": "AFST 399", "name": "Independent Study", "info": "Individual study or project, supervised by instructor. Prerequisite: permission of the instructor."}, {"abbreviation": "ANBE 266", "name": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior emphasizing both proximate and ultimate mechanisms and explanations for behavior. Crosslisted as BIOL 266 and PSYC 266."}, {"abbreviation": "ANBE 296", "name": "Research Methods in Animal Behavior", "info": "Laboratory and/or field research to accompany ANBE 266, BIOL 266, or PSYC 266. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or BIOL 205 and prerequisite or corequisite ANBE 266, BIOL 266, or PSYC 266. Crosslisted as PSYC 296."}, {"abbreviation": "ANBE 314", "name": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation. Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations. Prerequisites: BIOL 206, BIOL 208 and permission of the instructor. Crosslisted as BIOL 314 and BIOL 614 and ANBE 614."}, {"abbreviation": "ANBE 320", "name": "Advanced Topics in Animal Behavior", "info": "Culminating Experience seminar for senior animal behavior majors covering selected topics of current interest in animal behavior. Crosslisted as ANBE 620. Prerequisites: senior animal behavior major status and permission of the instructor."}, {"abbreviation": "ANBE 321", "name": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations.  Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood care.  Prerequisites: BIOL 208 and permission of the instructor.  Crosslisted as BIOL 321 and BIOL 621 and ANBE 621."}, {"abbreviation": "ANBE 355", "name": "Social Insects", "info": "Evolution and genetics of social behavior, caste, communication in foraging and colony defense, queen and worker control over reproduction, social homeostasis, and population dynamics. Occasionally may be taught as a laboratory science.  Prerequisites: BIOL 208 and permission of the instructor.  Crosslisted as BIOL 355. Juniors and seniors only."}, {"abbreviation": "ANBE 370", "name": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor. Crosslisted as ANBE 670 and BIOL 370 and BIOL 670 and PSYC 370 and PSYC 670."}, {"abbreviation": "ANBE 372", "name": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition. Prerequisites: PSYC 266 or ANBE 266, and permission of the instructor. Crosslisted as PSYC 372 and PSYC 672 and ANBE 672."}, {"abbreviation": "ANBE 391", "name": "Research", "info": "Independent research, with faculty supervision, in the study of animal behavior.  Crosslisted as ANBE 691. Prerequisite: permission of the instructor."}, {"abbreviation": "ANBE 399", "name": "Senior Thesis", "info": "Original research leading to a thesis presentation on a topic related to the study of animal behavior.  Prerequisite: permission of the instructor."}, {"abbreviation": "ANBE 614", "name": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation. Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations. Prerequisite: permission of the instructor. Crosslisted as BIOL 614 and ANBE 314 and BIOL 314."}, {"abbreviation": "ANBE 620", "name": "Advanced Topics in ANBE", "info": "Culminating Experience seminar for senior animal behavior majors covering selected topics of current interest in animal behavior. Prerequisites: senior animal behavior major status and permission of the instructor. Crosslisted as ANBE 320."}, {"abbreviation": "ANBE 621", "name": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations.  Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood care. Prerequisite: permission of the instructor. Crosslisted as BIOL 321 and BIOL 621 and ANBE 321."}, {"abbreviation": "ANBE 655", "name": "Social Insects", "info": "Evolution and genetics of social behavior, caste, communication in foraging and colony defense, queen and worker control over reproduction, social homeostasis, and population dynamics. Occasionally may be taught as a laboratory science. Prerequisite: permission of the instructor. Crosslisted as BIOL 355."}, {"abbreviation": "ANBE 670", "name": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and BIOL 370 and BIOL 670 and PSYC 370 and PSYC 670."}, {"abbreviation": "ANBE 672", "name": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition.  Prerequisite: permission of the instructor. Crosslisted as PSYC 372 and PSYC 672 and ANBE 372."}, {"abbreviation": "ANTH 109", "name": "Introduction to Cultural Anthropology", "info": "Nature and scope of the field: method and theory, institutions of human beings in cross-cultural perspective, case studies."}, {"abbreviation": "ANTH 201", "name": "Field Research in Local Communities", "info": "Participant-observation, interviewing, and other field research methods. Students will devise and conduct their own ethnographic research projects in a local community. Crosslisted as SOCI 201."}, {"abbreviation": "ANTH 202", "name": "Ecopolitics in Latin America", "info": "This course examines climate policy debates and recent shifts in global environmentalism, with a focus on a wide range of Latin American territories. Crosslisted as LAMS 202 and ENST 209."}, {"abbreviation": "ANTH 229", "name": "Pilgrimage, Prayer, and Purity: The Anthropology of Religion", "info": "The anthropological analysis of religion and religious phenomena. The exploration of religious practices across the globe, including initiation, circumcision, death and funerary customs, spirit possession, sacrifice, pilgrimage and saint veneration."}, {"abbreviation": "ANTH 243", "name": "Introduction to Southeast Asia Studies", "info": "Introduction to diversity of contemporary Southeast Asia. Interdisciplinary perspectives on topics including politics, gender, religion, violence, and globalization."}, {"abbreviation": "ANTH 248", "name": "Latin America: Challenges for the 21st Century", "info": "Perspectives on the challenges facing Latin American peoples and nations in the 21st century. Crosslisted as LAMS 250."}, {"abbreviation": "ANTH 265", "name": "Food, Eating, and Culture", "info": "Social significance of food and eating. Taboos and ritual, food and identities, eating and political hierarchy, food and gender, global culture. Materialist and symbolic interpretations."}, {"abbreviation": "ANTH 283", "name": "Theory in Anthropology", "info": "Explores the historical and contemporary theories in cultural anthropology; conceptualizations of culture, society, humankind; history and critical assessment of the concept of culture in anthropology."}, {"abbreviation": "ANTH 290", "name": "Medical Anthropology", "info": "Health and illness are not solely determined by an individual's biology. Their social determinants are the focus of this course. An understanding of health requires an investigation into the cultural meanings of the body, social relations, and the systems of power in which they are embedded."}, {"abbreviation": "ANTH 352", "name": "Ritual, Resistance, and Rebellion in South America", "info": "The cultural and social groups inhabiting the South American west coast in historical context; implications for anthropological and social issues concerning Third World societies. Prerequisite: permission of the instructor. Crosslisted as LAMS 252."}, {"abbreviation": "ARBC 101", "name": "Beginning Arabic I", "info": "Beginning language skills. Practice in listening, speaking, reading and writing. Elementary grammar. Introduction to Arabic culture."}, {"abbreviation": "ARBC 103", "name": "Intermediate Arabic I", "info": "A continuation and review of basic grammar, emphasizing all four language skills and culture. Prerequisite: ARBC 101A or ARBC 102 or equivalent."}, {"abbreviation": "ARST 112", "name": "Photography I", "info": "An introduction to the theory, practice, and criticism of fine art photography. Not open to seniors."}, {"abbreviation": "ARST 120", "name": "Painting I", "info": "Studio course to introduce basic techniques and materials of painting, color theory and its application, image and composition. Not open to seniors."}, {"abbreviation": "ARST 130", "name": "Printmaking I", "info": "An introduction to visual concepts and processes in intaglio, relief, and screen printing. Not open to seniors."}, {"abbreviation": "ARST 131", "name": "Drawing I", "info": "The tradition of drawing, its practice and theory in various media. Not open to seniors."}, {"abbreviation": "ARST 150", "name": "Sculpture I", "info": "Students will be introduced to a variety of sculptural materials and methods of fabrication, become familiar with the work of contemporary sculptors, and learn to interpret visual works. Prerequisite: seniors by permission of the instructor."}, {"abbreviation": "ARST 234", "name": "Digital Photography", "info": "Individual projects in digital photography with an emphasis on concept and refinement of image. Prerequisites: ARST 112, ARST 131 and permission of the instructor."}, {"abbreviation": "ARST 243", "name": "Graphic Design", "info": "An introduction to the theory and practice of graphic design and the principles underlying the visual presentation of information, both verbal and pictorial. Prerequisites: one of the following: ARST 112, ARST 130, ARST 131, ARST 150, or ARST 234 and permission of the instructor."}, {"abbreviation": "ARST 336", "name": "Advanced Work in the Studio", "info": "Advanced projects in each studio area: painting, printmaking, photography, sculpture, or graphics. This course may be repeated for additional credit. Prerequisite: permission of the instructor."}, {"abbreviation": "ARST 350", "name": "Honors Studio Art", "info": "Independent study or creative work leading either to the writing of a thesis or the completion of a significant studio project.  For courses in theatre production and design, see listings in Theatre and Dance.  Prerequisite: permission of the instructor."}, {"abbreviation": "ARST 450", "name": "Senior Projects in Studio Art", "info": "Studio Art Culminating Experience: in the fall semester majors will take ARST 450 Senior Projects in Studio Art to work towards creating a portfolio of professional standards. In the spring semester, majors will install and exhibit the work created in ARST 450 in the Samek Art Gallery."}, {"abbreviation": "ARTH 265", "name": "Contemporary Philosophy of Art", "info": "An investigation of and focused study of contemporary philosophical issues in the arts and aesthetics more generally. Prerequisite: PHIL 100, or ARTH 207 or ARTH 208. Crosslisted as PHIL 265."}, {"abbreviation": "ARTH 319", "name": "Independent Study in Art History", "info": "Advanced problems in art history.  Prerequisite: permission of the instructor."}, {"abbreviation": "ARTH 380", "name": "Honors Art History", "info": "Independent study leading to the writing of a thesis. Prerequisite: permission of the instructor."}, {"abbreviation": "ARTH 402", "name": "Culminating Experience", "info": "Required for all art history majors. Students will explore individual research projects independently and workshop them in class. The class will culminate in a departmental art history conference where students will present their work. Prerequisite: senior status. Juniors by permission only."}, {"abbreviation": "ASTR 101", "name": "Our Solar System", "info": "An introduction to astronomy concentrating on our evolving understanding of the solar system. Designed for non-science majors. No prerequisite."}, {"abbreviation": "ASTR 337", "name": "Independent Study  in Astronomy/Astrophysics", "info": "Seminar or independent study in areas of current interest in the astronomy/astrophysics community.  Prerequisite: permission of the instructor."}, {"abbreviation": "BIOL 122", "name": "Biology for Non-majors", "info": "Introductory course primarily for the non-biology major. Topics covered include principles of ecology, evolution, animal diversity, behavior, and structure, and function. This course is not appropriate preparation for the majority of pre-health graduate programs. Please consult with the Pre-health Adviser for more information."}, {"abbreviation": "BIOL 130", "name": "Health and Disease", "info": "A biology course, for non-science majors, that explores the basic biological principles underlying normal health and the most common diseases of humans. Students who have taken any 200-level Biology courses are not eligible for enrollment."}, {"abbreviation": "BIOL 205", "name": "Introduction to Molecules and Cells", "info": "An introductory course which focuses on the molecular biology of cells. Basic biochemical processes, cellular and subcellular structure and function are emphasized. First core course."}, {"abbreviation": "BIOL 207", "name": "Genetics", "info": "A comprehensive survey of genetic mechanisms and methodologies, including classical genetics, recombinational analysis in bacteria, fungi, and higher eukaryotes, molecular genetics and populational and quantitative genetics. Third core course. Prerequisite: BIOL 205."}, {"abbreviation": "BIOL 220", "name": "Human Anatomy", "info": "A course that focuses on the anatomy of and relationship between human muscles, bones, and organs. Lab involves dissection, with the cat as the primary specimen. Does not count toward the biology major.  Prerequisite: permission of the instructor."}, {"abbreviation": "BIOL 266", "name": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior emphasizing both proximate and ultimate mechanisms and explanations for behavior. Crosslisted as ANBE 266 and PSYC 266."}, {"abbreviation": "BIOL 312", "name": "Comparative Vertebrate Anatomy", "info": "Gross morphology with emphasis on functional and evolutionary modifications of animal structure. Gross dissection and techniques used in morphology.  Prerequisites: BIOL 122 or BIOL 206 and permission of the instructor. Crosslisted as BIOL 612."}, {"abbreviation": "BIOL 314", "name": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation.  Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations.   Prerequisites: BIOL 206, BIOL 208 or 208E and permission of the instructor. Crosslisted as ANBE 314 and BIOL 614 and ANBE 614."}, {"abbreviation": "BIOL 316", "name": "Plant Growth and Development", "info": "The physiological and molecular bases of growth and development at the organ, tissue, and cellular levels. Effects of environmental stimuli and hormones on gene expression and the resultant changes at higher levels of organization. Prerequisite: BIOL 205, BIOL 206, and permission of the instructor. Crosslisted as BIOL 616."}, {"abbreviation": "BIOL 318", "name": "Principles of Physiology", "info": "Emphasizes the breadth of physiology and explores physiological principles of animals from a cellular, organismal, medical, and ecological framework. Laboratory focuses on experimental design and independent research.  Prerequisites: BIOL 205, BIOL 206 and permission of the instructor. Crosslisted as BIOL 618."}, {"abbreviation": "BIOL 319", "name": "Seminar", "info": "Topics vary. Crosslisted as BIOL 619."}, {"abbreviation": "BIOL 321", "name": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations. Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood care.  Prerequisites: BIOL 208 and permission of the instructor. Crosslisted as BIOL 621 and ANBE 321 and ANBE 621."}, {"abbreviation": "BIOL 328", "name": "Endocrinology", "info": "Regulation and function of hormones and their receptors from molecular to organismal levels. Role of hormones in development, physiology, and behavior; endocrine disease.  Prerequisites: BIOL 205 and BIOL 206 and permission of the instructor. Crosslisted as BIOL 628."}, {"abbreviation": "BIOL 347", "name": "Virology", "info": "The study of virus structure, genome organization, replication and host-interactions. Emphasis will be on animal and bacterial viruses.  Prerequisites: BIOL 205, BIOL 207, and permission of the instructor. Crosslisted as BIOL 647."}, {"abbreviation": "BIOL 352", "name": "Cell Biology", "info": "Covers biomembranes, cell growth patterns, cell signaling, the cytoskeleton, cell organelles, and microscopic techniques. Laboratory includes experience with cell culture.  Prerequisites: BIOL 205 and permission of the instructor. Crosslisted as BIOL 652."}, {"abbreviation": "BIOL 353", "name": "Ecosystem Ecology", "info": "Interactions between organisms and the physical and chemical environment including nutrient cycling and energy flow, biogeochemistry, and temporal and spatial dynamics of ecosystems.  Prerequisites: BIOL 208, junior or senior status, and permission of the instructor. Crosslisted as BIOL 653 and ENST 353."}, {"abbreviation": "BIOL 355", "name": "Social Insects", "info": "Evolution and genetics of social behavior, caste, communication in foraging and colony defense, queen and worker control over reproduction, social homeostasis and population dynamics. Occasionally may be taught as a laboratory science.  Prerequisites: BIOL 208 and permission of the instructor.  Crosslisted as ANBE 355. Juniors and seniors only."}, {"abbreviation": "BIOL 370", "name": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 670 and PSYC 370 and PSYC 670."}, {"abbreviation": "BIOL 371", "name": "Field Entomology", "info": "Introduction to insects in their natural habitats, with emphasis on insect collecting, taxonomy, identification, ecology, and natural history. Students will make a professional-quality insect collection and acquire skills appropriate for biodiversity surveys. Prerequisites: BIOL 208 and permission of the instructor. Crosslisted as BIOL 671."}, {"abbreviation": "BIOL 375", "name": "Cellular and Molecular Neurobiology", "info": "A course focused on the molecular and cellular mechanisms that drive the firing and wiring of neurons. Topics of emphasis include excitable membrane physiology, synaptic transmission, plasticity and learning, and sensory transduction. The required co-requisite laboratory component provides hands-on neurophysiology experience with live animal models. Crosslisted as BIOL 675."}, {"abbreviation": "BIOL 399", "name": "Undergraduate Research", "info": "Undergraduate research.  Prerequisite: permission of the instructor."}, {"abbreviation": "BIOL 612", "name": "Comparative Vertebrate Anatomy", "info": "Gross morphology with emphasis on functional and evolutionary modifications of animal structure. Gross dissection and techniques used in morphology. Prerequisites: introductory biology course and permission of the instructor. Crosslisted as BIOL 312."}, {"abbreviation": "BIOL 614", "name": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation.  Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations.  Prerequisite: permission of the instructor. Crosslisted as ANBE 614 and BIOL 314 and ANBE 314."}, {"abbreviation": "BIOL 616", "name": "Plant Growth and Development", "info": "The physiological and molecular bases of growth and development at the organ, tissue, and cellular levels. Effects of light and hormones on gene expression and the resultant changes at higher levels of organization. Prerequisites: permission of the instructor. Crosslisted as BIOL 316."}, {"abbreviation": "BIOL 618", "name": "Principles of Physiology", "info": "Emphasizes the breadth of physiology and explores physiological principles of animals from cellular, organismal, medical, and ecological framework. Laboratory focuses on experimental design and independent research. Prerequisite: permission of the instructor. Crosslisted as BIOL 318."}, {"abbreviation": "BIOL 619", "name": "Seminar", "info": "Topics vary. Crosslisted as BIOL 319."}, {"abbreviation": "BIOL 621", "name": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations. Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood behavior.  Prerequisite: permission of the instructor. Crosslisted as BIOL 321 and ANBE 321 and ANBE 621."}, {"abbreviation": "BIOL 628", "name": "Endocrinology", "info": "Regulation and function of hormones and their receptors from molecular to organismal levels. Role of hormones in development, physiology, and behavior; endocrine disease. Prerequisite: permission of the instructor. Crosslisted as BIOL 328."}, {"abbreviation": "BIOL 647", "name": "Virology", "info": "The study of virus structure, genome organization, replication and host-interactions. Emphasis will be on animal and bacterial viruses. Prerequisite: permission of the instructor. Crosslisted as BIOL 347."}, {"abbreviation": "BIOL 652", "name": "Cell Biology", "info": "Covers biomembranes, cell growth patterns, cell signaling, the cytoskeleton, cell organelles, and microscopic techniques. Laboratory includes experience with cell structure. Prerequisite: permission of the instructor. Crosslisted as BIOL 352."}, {"abbreviation": "BIOL 653", "name": "Ecosystem Ecology", "info": "Interactions between organisms and the physical and chemical environment including nutrient cycling and energy flow, biogeochemistry, and temporal and spatial dynamics of ecosystems.  Prerequisites: BIOL 208, junior or senior status, and permission of the instructor. Crosslisted as BIOL 353 and ENST 353."}, {"abbreviation": "BIOL 655", "name": "Social Insects", "info": "Evolution and genetics of social behavior, caste, communication in foraging and colony defense, queen and worker control over reproduction, social homeostasis, and population dynamics. Occasionally may be taught as a laboratory science. Crosslisted as ANBE 655. Prerequisite: permission of the instructor."}, {"abbreviation": "BIOL 660", "name": "Graduate Research", "info": "Graduate research. Prerequisite: permission of the instructor."}, {"abbreviation": "BIOL 670", "name": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 370 and PSYC 370 and PSYC 670."}, {"abbreviation": "BIOL 671", "name": "Field Entomology", "info": "Introduction to insects in their natural habitats, with emphasis on insect collecting, taxonomy, identification, ecology, and natural history. Students will make a professional-quality insect collection and acquire skills appropriate for biodiversity surveys. Prerequisites: BIOL 208 and permission of the instructor. Crosslisted as BIOL 371."}, {"abbreviation": "BIOL 675", "name": "Cellular and Molecular Neurobiology", "info": "A course focused on the molecular and cellular mechanisms that drive the firing and wiring of neurons. Topics of emphasis include excitable membrane physiology, synaptic transmission, plasticity and learning, and sensory transduction. The required co-requisite laboratory component provides hands-on neurophysiology experience with live animal models. Crosslisted as BIOL 375."}, {"abbreviation": "BIOL 680", "name": "Thesis", "info": "Thesis. Prerequisite: permission of the instructor."}, {"abbreviation": "BIOL 690", "name": "Graduate Seminar", "info": "This course will cover topics related to being a professional scientist, including ethics, presentation skills, grant and paper writing and reviewing, and effective mentoring and teaching. Prerequisites: graduate standing and permission of the instructor."}, {"abbreviation": "BMEG 250", "name": "Fundamentals of Biomechanics", "info": "Application of mechanical analyses to solve biomechanical problems including: equilibrium of rigid bodies, anthropometric analysis, link segment analysis, internal loads, combined loading, failure theory. Prerequisites: PHYS 211 and MATH 201. Not open to students who have taken ENGR 220, ENGR 221 or MECH 220. Open to biomedical engineering majors only."}, {"abbreviation": "BMEG 350", "name": "Fundamental of Biomedical Signals and Systems", "info": "Time and frequency analysis, filter design and feedback control as applied to biomedical signals and systems. Prerequisites: BMEG 205 and MATH 212. Open to biomedical engineering majors only."}, {"abbreviation": "BMEG 400", "name": "Biotransport II", "info": "Second biotransport course focusing on the advanced application of fundamental heat and mass transport concepts to biological systems and medical devices. Conduction, convection, thermal properties of materials, mass diffusion, compartmental modeling. Prerequisite: BMEG 300. Open to biomedical engineering majors only."}, {"abbreviation": "BMEG 401", "name": "Biomedical Engineering Capstone I", "info": "Senior design course emphasizing the biomedical engineering design process including problem identification and medical motivation, background research, medical regulations and ethics, design and project proposal presentation. Prerequisite: BMEG 408. Open to biomedical engineering majors only."}, {"abbreviation": "BMEG 409", "name": "Fabrication and Experimental Design", "info": "A hands-on course focusing on skills relevant to biomedical engineers, such as computer-aided design and documentation, fabrication, materials, selection and biocompatibility. Cell culture and experimental design. Class will be a mixture of lectures and hands-on activities. Prerequisite: BMEG 226. Open to biomedical engineering majors only."}, {"abbreviation": "BMEG 471", "name": "Advanced Topics in Biomedical Engineering", "info": "Advanced, in-depth course developed from areas of biomedical engineering. Topics will vary.  Prerequisite: permission of the instructor."}, {"abbreviation": "BMEG 480", "name": "Biomedical Engineering Project", "info": "Individual work with a faculty adviser on development, design, or research project beginning with a written plan and culminating with a written or oral presentation.  Prerequisite: permission of the instructor."}, {"abbreviation": "BMEG 490", "name": "Biomedical Engineering Research", "info": "Independent study with a faculty adviser on a research or design project. Submit a proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group.  Prerequisite: permission of the instructor."}, {"abbreviation": "CEEG 300", "name": "Introduction to Structural Engineering", "info": "Introduction to behavior, analysis and design of structures; including design criteria, loads, modeling of structural systems, design with various material types (e.g. steel, concrete, timber, masonry). Discussion of the design process, and societal/global  context of structural design. Case studies used throughout the course. Prerequisites: ENGR 230 and ENGR 242."}, {"abbreviation": "CEEG 320", "name": "Water Resources Engineering", "info": "Planning, design, and operation of water resources projects with emphasis on hydrology, hydraulic structures, and open and closed conduits; applications in stormwater management and water supply. Prerequisite: ENGR 222."}, {"abbreviation": "CEEG 340", "name": "Environmental Engineering", "info": "Introduction to fundamentals of environmental engineering and science including chemistry, microbiology, mass balance, and reactor theory. Application of concepts to environmental engineering includes water quality, water and waste-water treatment, solid and hazardous waste, air pollution, greenhouse gases and climate change.  Includes hands-on lab."}, {"abbreviation": "CEEG 350", "name": "Geotechnical Engineering I", "info": "Origin, composition, structure, and properties of soils. Identification, classification, strength, permeability, and compressibility characteristics. Introduction to foundation engineering. Laboratory determination of soil properties. Prerequisites: ENGR 222 and ENGR 229 or permission of the instructor."}, {"abbreviation": "CEEG 401", "name": "Structural Analysis", "info": "Analysis of structures including: review of essential mechanics; sketching deflection, moment, and force diagrams for indeterminate systems; influence lines; application of virtual force and displacement principles; and a comprehensive study of the direct stiffness method with a focus on matrix analysis.  Prerequisites: CEEG 300 and ENGR 212 or permission of the instructor."}, {"abbreviation": "CEEG 421", "name": "Hydrology", "info": "The interrelation of meteorological conditions, precipitation, surface runoff, and groundwater storage. Prerequisites: CEEG 320 and permission of the instructor."}, {"abbreviation": "CEEG 430", "name": "Introduction to Roadside Safety", "info": "Fundamentals of roadside safety design and analysis: topics include traffic barrier warranting and selection, crash data analysis, hardware performance evaluation, and benefit/cost analysis. Prerequisites: CEEG 330 or permission of the instructor."}, {"abbreviation": "CEEG 441", "name": "Environmental Engineering Biotechnology", "info": "Theory and design of biological waste treatment systems for industrial, municipal and hazardous pollutants and natural biotransformation of pollutants in the environment. Laboratory experience on startup, operation, and analysis of systems that biodegrade pollutants and produce useful forms of energy. Prerequisite: CEEG 340 or instructor permission. Crosslisted as CEEG 641."}, {"abbreviation": "CEEG 445", "name": "Environmental Engineering Chemistry", "info": "Principles of aquatic chemistry and applications with emphasis on acid-base reactions, metal speciation and solubility, and oxidation-reduction reactions in water.  Prerequisite: permission of the instructor."}, {"abbreviation": "CEEG 481", "name": "Undergraduate Research", "info": "Original investigations in structural engineering, transportation engineering, environmental engineering, geotechnical engineering, or water resource engineering."}, {"abbreviation": "CEEG 490", "name": "Engineering Planning and Project Management", "info": "Exploration and application of the civil engineering planning process including feasibility study, decision making,  engineering economic analysis, and project management skills. Prerequisite: senior status."}, {"abbreviation": "CEEG 495", "name": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications.  Prerequisite: permission of the instructor. Crosslisted as CHEG 495 and ECEG 495 and MECH 495 and ENGR 695."}, {"abbreviation": "CEEG 601", "name": "Structural Analysis", "info": "Analysis of structures, including: review of essential mechanics; sketching deflection, moment, and force diagrams for indeterminate systems; influence lines; application of virtual force and displacement principles; and a comprehensive study of the direct stiffness method with a focus on a matrix analysis. Prerequisite: permission of the instructor."}, {"abbreviation": "CEEG 621", "name": "Hydrology", "info": "The interrelation of meteorological conditions, precipitation, surface runoff, and groundwater storage. Prerequisite: CEEG 320 and permission of the instructor."}, {"abbreviation": "CEEG 641", "name": "Environ Engr Biotechnology", "info": "Theory and design of biological waste treatment systems for industrial, municipal and hazardous pollutants and natural biotransformation of pollutants in the environment. Laboratory experience on startup, operation, and analysis of systems that biodegrade pollutants and produce useful forms of energy. Prerequisite: CEEG 340 or permission of the instructor. Crosslisted as CEEG 441."}, {"abbreviation": "CEEG 645", "name": "Environmental Engineering Chemistry", "info": "Principles of aquatic chemistry and applications with emphasis on acid-base reactions, solubility, precipitation, and oxidation reduction reactions in water.  Prerequisite: permission of the instructor."}, {"abbreviation": "CEEG 681", "name": "Graduate Research", "info": "Original investigations in any discipline of civil engineering. Prerequisite: permission of the instructor."}, {"abbreviation": "CEEG 699", "name": "Thesis", "info": "Research on the graduate level under the direction of a faculty member."}, {"abbreviation": "CHEG 300", "name": "Heat and Mass Transfer", "info": "Conductive, convective and radiation heat transfer; analytical and numerical solutions of heat transfer problems, estimation of heat transfer coefficients, and heat exchanger design. Fundamentals of mass transfer (diffusion and convection) with applications to unit operations. With experimental laboratory. Prerequisites: ENGR 233, CHEG 200 and CHEG 210 or MATH 212."}, {"abbreviation": "CHEG 302", "name": "Separation Processes", "info": "Analysis of binary and multicomponent separations by analytical, graphical, and computer methods. Topics include gas absorption, distillation, liquid-liquid extraction as well as selected novel separation processes. With computational laboratory. Prerequisite: CHEG 200. Corequisite: CHEG 302L."}, {"abbreviation": "CHEG 320", "name": "Chemical Reaction Engineering", "info": "Rate forms for homogeneous, catalytic, and biological reactions; isothermal and nonisothermal reactor design and analysis; interpretation of laboratory data; introduction to nonideal flow and residence-time distributions. With experimental laboratory. Prerequisites: CHEM 341 or CHEM 343, CHEG 210, and CHEG 310."}, {"abbreviation": "CHEG 400", "name": "Process Engineering", "info": "Applications of engineering, economic, environmental, and ethical principles in preliminary process design using computer aids such as process simulators. Problem definition literature survey, flowsheet development, material and energy balances, equipment design, profitability analysis, oral and written communication. With design laboratory. Prerequisites: CHEG 310 and CHEG 315."}, {"abbreviation": "CHEG 430", "name": "Chemical Engineering Project", "info": "Individual work with a faculty adviser on a development or design project beginning with a written plan and culminating with a deliverable product and a written report. Problem analysis involving information synthesis, experimentation, mathematical modeling or software development.  Prerequisite: permission of the instructor. Crosslisted as CHEG 630."}, {"abbreviation": "CHEG 440", "name": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group.  Prerequisite: permission of the instructor. Crosslisted as CHEG 441 and CHEG 640 and CHEG 641."}, {"abbreviation": "CHEG 453", "name": "Product and Process Chemistry", "info": "Examination of the internal structure of the chemical industry. The roles of key chemicals and intermediates in chemical synthesis are emphasized to provide an overview of current industrial production methods. Product and process history, design and improvement are covered through discussions, simulations and case studies. Prerequisite: junior or senior status. Crosslisted as CHEG 653."}, {"abbreviation": "CHEG 454", "name": "Pharmaceutical Engineering", "info": "Applications of core chemical engineering concepts to pharmaceutical processes. Development of  fundamentals used in the pharmaceutical industry. Introduction to the development and approval of pharmaceutical process, along with social, regulatory, historical and ethical issues present in the pharmaceutical industry. Prerequisite: CHEG 300 or BMEG 400 or permission of the instructor. Crosslisted as CHEG 654."}, {"abbreviation": "CHEG 460", "name": "Biomaterials: Materials in Medicine", "info": "Classes of biomaterials, their applications, and current trends in biomaterials research and technology. Medical/ethical implications of biomaterials development and research. Open to juniors and seniors in chemical engineering, others by permission of the instructor. Crosslisted as CHEG 660."}, {"abbreviation": "CHEG 495", "name": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications. Prerequisite: junior or senior status. Crosslisted as CEEG 495 and ECEG 495 and ECEG 695 and MECH 495 and ENGR 695."}, {"abbreviation": "CHEG 640", "name": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group. Prerequisite: permission of the instructor. Crosslisted as CHEG 440 and CHEG 441 and CHEG 641."}, {"abbreviation": "CHEG 653", "name": "Product and Process Chemistry", "info": "Examination of the internal structure of the chemical industry. The roles of key chemicals and intermediates in modern chemical synthesis are emphasized to provide an overview of current industrial methods. Process history, design and improvement are covered through discussions, simulations and case studies. Prerequisite: permission of the instructor. Crosslisted as CHEG 453."}, {"abbreviation": "CHEG 654", "name": "Pharmaceutical  Engineering", "info": "Applications of core chemical engineering concepts to pharmaceutical processes. Development of fundamentals used in the pharmaceutical industry. Introduction to the development and approval  of pharmaceutical process, along with social, regulatory, historical and ethical issues present in the pharmaceutical industry.  Prerequisite: CHEG 300 or BMEG 400 or permission of the instructor. Crosslisted as CHEG 454."}, {"abbreviation": "CHEG 660", "name": "Biomaterial-Materl in Medicine", "info": "Classes of biomaterials, their applications, and current trends in biomaterials research and technology. Medical/ ethical implications of biomaterials development and research. Prerequisite: permission of the instructor. Crosslisted as CHEG 460."}, {"abbreviation": "CHEG 680", "name": "Graduate Research and Thesis", "info": "Individual graduate-level investigations culminating in a thesis. Required for the master of science in chemical engineering degree."}, {"abbreviation": "CHEM 105", "name": "Introduction to Chemistry", "info": "A terminal elementary course covering in-depth selected topics, which may vary from year to year. Satisfies science requirement for Bachelor of Arts students not majoring in science or engineering. Not open to students who have taken CHEM 160 or any 200-level CHEM course. Prerequisite: seniors by permission only."}, {"abbreviation": "CHEM 203", "name": "General Chemistry for Engineers", "info": "Fundamental principles in inorganic chemistry including aqueous reactions, atomic and molecular structure, coordination compounds, solids, liquids, and gases, and basic equilibrium. Laboratory experiments are both qualitative and quantitative."}, {"abbreviation": "CHEM 205", "name": "Principles of Chemistry", "info": "First college chemistry course for most students. Introduction to chemical principles. Prerequisite: high school chemistry or equivalent. Credit not given for both CHEM 205 and CHEM 207."}, {"abbreviation": "CHEM 207", "name": "Explorations in Chemistry", "info": "Advanced introductory chemistry course for students with a strong chemistry background. Inquiry based projects and lab experiences. Students seeking permission to take CHEM 207 (instead of CHEM 205) must take the online placement test. Credit not given for both CHEM 207 and CHEM 205."}, {"abbreviation": "CHEM 212", "name": "Organic Chemistry II", "info": "A continuation of CHEM 211 with focus on properties and reactions of functional groups, synthesis, and spectroscopic analysis. Prerequisite: CHEM 211."}, {"abbreviation": "CHEM 233", "name": "Analytical Chemistry for Engineers", "info": "Chemical equilibrium and modern analysis with an emphasis on acid-base systems, solubility, metal ion determinations, electroanalytical chemistry, and spectrophotometry. College of Engineering students only. Prerequisite: CHEM 205, CHEM 207, CHEM 1AP by permission. Students may take only one of these for credit: CHEM 230, CHEM 231, or CHEM 233."}, {"abbreviation": "CHEM 314", "name": "Mechanistic Organic Chemistry", "info": "Thermal and kinetic aspects of organic reactions are discussed along with the effect of substituents, solvents, and stereochemistry on reaction pathways. Qualitative molecular orbital theory of organic compounds is covered in depth. Weekly problem sessions are held. Prerequisite: CHEM 212. Crosslisted as CHEM 614."}, {"abbreviation": "CHEM 332", "name": "Analytical Chemistry II", "info": "Theory and practice of techniques of instrumental analysis including spectrophotometry, fluorescence, mass spectrometry, atomic absorption, chromatography, capillary electrophoresis, and dynamic electrochemistry. Prerequisite: CHEM 231. Crosslisted as CHEM 632."}, {"abbreviation": "CHEM 341", "name": "Physical Chemistry I", "info": "Introductory physical chemistry with emphasis on thermodynamics, kinetics and electrochemistry. Prerequisites: CHEM 231, MATH 211, and PHYS 212. Not open to engineering majors. Crosslisted as CHEM 641."}, {"abbreviation": "CHEM 343", "name": "Physical Chemistry for Engineers", "info": "Introductory physical chemistry for engineers, with emphasis on thermodynamics, chemical kinetics and electrochemistry. Prerequisites: CHEM 231, MATH 211, PHYS 211. Only open to engineering majors."}, {"abbreviation": "CHEM 351", "name": "Biochemistry I", "info": "Introduction to biological chemistry with emphasis on the structure and function of proteins, lipids, carbohydrates and nucleic acids, kinetics and mechanisms of enzymes, bioenergetics, and metabolism. Prerequisites: CHEM 212 and either CHEM 230 or CHEM 231. Crosslisted as CHEM 651."}, {"abbreviation": "CHEM 371", "name": "Chemistry Lecture Series", "info": "Formal oral presentations on current research will be given by students, faculty and visiting scientists. Prerequisites: participation in an approved research project or independent study for seniors or second term juniors only."}, {"abbreviation": "CHEM 375", "name": "Undergraduate Research", "info": "Original investigations in analytical, biological, organic, physical, environmental or inorganic chemistry."}, {"abbreviation": "CHEM 385", "name": "Seminar", "info": "Topics vary. Crosslisted as CHEM 685."}, {"abbreviation": "CHEM 614", "name": "Mechanistic Organic Chemistry", "info": "Discussions of the reaction mechanisms of substitution, elimination, cycloaddition, and acylation reactions are presented. Class topics include the influence of solvent on mechanism, and steric, sterochemical, and kinetic aspects of reactions. Prerequisite: permission of the instructor. Crosslisted as CHEM 314."}, {"abbreviation": "CHEM 632", "name": "Analytical Chemistry II", "info": "Theory and practice of techniques of instrumental analysis including spectrophotometry, fluorescence, mass spectrometry, atomic absorption, chromatography, capillary electrophoresis, and dynamic electrochemistry. Prerequisite: CHEM 231. Crosslisted as CHEM 332."}, {"abbreviation": "CHEM 641", "name": "Physical Chemistry I", "info": "Introductory physical chemistry with emphasis on thermodynamics and kinetics. Prerequisites: permission of the instructor. Crosslisted as CHEM 341."}, {"abbreviation": "CHEM 651", "name": "Biochemistry I", "info": "Introduction to biological chemistry with emphasis on the structure and function of proteins, lipids, carbohydrates and nucleic acids, kinetics and mechanisms of enzymes, bioenergetics, and metabolism. Crosslisted as CHEM 351."}, {"abbreviation": "CHEM 675", "name": "Graduate Research", "info": "Graduate research."}, {"abbreviation": "CHEM 685", "name": "Seminar", "info": "Topics vary. Crosslisted as CHEM 385."}, {"abbreviation": "CHIN 101", "name": "Chinese I", "info": "Intensive introduction to spoken and written \"Mandarin\" Chinese, the puutonghuah (common language) of modern China."}, {"abbreviation": "CHIN 103", "name": "Chinese II", "info": "Continued rigorous study of spoken and written \"Mandarin\" Chinese now called puutonghuah (the common language). Prerequisite: CHIN 102 or equivalent."}, {"abbreviation": "CHIN 201", "name": "Chinese III", "info": "Continued study of modern \"Mandarin.\"  Contemporary essays, movie scripts, short stories and newspaper articles.  Equal emphasis on reading and speaking.  Conducted in Chinese. Prerequisite: CHIN 104 or equivalent."}, {"abbreviation": "CHIN 203", "name": "Chinese IV", "info": "Reading and discussion of selected modern Chinese texts: newspaper and magazine articles, essays, short stories, and film scripts.  Conducted in Chinese. Prerequisite: CHIN 202 or equivalent."}, {"abbreviation": "CLAS 120", "name": "The Secret History of Words: The Greek and Latin Origins of English and Bio-Scientific Vocabulary", "info": "This course explores the Greek and Latin origins of many English words and the specialized vocabulary in fields such as the biosciences and law. We will primarily analyze words in order to improve your comprehension of English, but will simultaneously learn about the languages and cultures of the ancient Mediterranean."}, {"abbreviation": "CLAS 132", "name": "Roman Civilization", "info": "Introduction to Roman Civilization from Romulus to Constantine. Emphasis on social and cultural history, including literature, art, architecture, religion, and historiography in their cultural context."}, {"abbreviation": "CLAS 141", "name": "Ancient Cities", "info": "Introduction to Near Eastern and Greco-Roman civilization through study of major urban centers. Seniors by permission of the instructor."}, {"abbreviation": "CLAS 217", "name": "Greek History", "info": "Greek history from the heroic Bronze age down through the Persian invasion, the flourishing of Classical Athens, and the Peloponnesian wars to the death of Socrates, focusing on political, social, and economic developments. Crosslisted as HIST 240."}, {"abbreviation": "CLAS 220", "name": "Preindustrial Environment", "info": "An introduction to global environmental history of the preindustrial world through three thematic lenses: how the natural environment shaped patterns of human life, how ideologies toward nature shifted over time, and how human activities and ideologies reshaped the ancient landscape. Crosslisted as ENST 216."}, {"abbreviation": "CLAS 311", "name": "Independent Study in Classics", "info": "Topics in classical civilization, to be chosen by the student.  Prerequisite: permission of the instructor."}, {"abbreviation": "CLAS 321", "name": "Honors Tutorial and Thesis", "info": "Independent study and research leading to the writing of a thesis.  Prerequisite: permission of the instructor."}, {"abbreviation": "CSCI 203", "name": "Introduction to Computer Science I", "info": "Overview of computing that explores relationships between computer organization, various programming approaches, limits to computing, and computing in society. Students solve computational problems using Python."}, {"abbreviation": "CSCI 204", "name": "Introduction to Computer Science II", "info": "Introduction to data structures and algorithms using an object-oriented approach. Topics include software-engineering principles, object-oriented programming, recursion, basic data structures, algorithm analysis, and team programming. Prerequisite: CSCI 203 or permission of the instructor. Corequisite: MATH 201 or equivalent."}, {"abbreviation": "CSCI 205", "name": "Software Engineering and Design", "info": "Fundamentals of software design and software engineering. Students will participate in large-scale, team-based software development project. Prerequisite: CSCI 204 or permission of the instructor."}, {"abbreviation": "CSCI 278", "name": "Computer Science Individual Study", "info": "Independent study or project in computer science. Prerequisite: one of the following: CSCI 185, CSCI 203, CSCI 204, CSCI 205, CSCI 206, CSCI 208, CSCI 240, or permission of the instructor."}, {"abbreviation": "CSCI 311", "name": "Algorithms and Data Structures", "info": "Introduction to the algorithms and data structures used in implementing abstract data types including priority queues, dictionaries, and graphs. Includes complexity analysis of various implementations. Prerequisites: MATH 241 and CSCI 205 or permission of the instructor."}, {"abbreviation": "CSCI 315", "name": "Operating Systems Design", "info": "Introduction to operating system design including processor management, scheduling, memory management, resource allocation, file systems, and concurrency. Prerequisite: CSCI 206."}, {"abbreviation": "CSCI 320", "name": "Computer Architecture", "info": "Use hardware description language to describe and design digital systems. Processor design, pipelining, cache and storage systems. Instruction and thread level parallelism, speculation, branch prediction. Prerequisite: CSCI 315 or permission of the instructor."}, {"abbreviation": "CSCI 341", "name": "Theory of Computation", "info": "Finite automata, regular sets, pushdown automata, context-free grammars. Turing machines, recursive functions and undecidability. Prerequisite: MATH 241 or MATH 280."}, {"abbreviation": "CSCI 376", "name": "Computer Science Honors Thesis", "info": "Independent work on computer science honors thesis. Prerequisite: permission of the instructor."}, {"abbreviation": "CSCI 378", "name": "Individual Study in Computer Science", "info": "Independent study in computer science. Recent areas include graph algorithms, computer security, distributed computing, graphics, programming languages, software engineering, web retrieval. Prerequisites: junior standing and permission of the instructor."}, {"abbreviation": "CSCI 379", "name": "Topics in Computer Science", "info": "Current topics of interest. Course may/may not require laboratory depending upon the topic. Prerequisite: permission of the instructor."}, {"abbreviation": "CSCI 475", "name": "Senior Design I", "info": "A recognized software engineering methodology will be used with all phases of a senior design project. Written work will include a technical report about the project, a feasibility report, and a requirements specification document. Not open to students who have taken ENGR 452."}, {"abbreviation": "CSCI 479", "name": "Computer Science Design Project", "info": "Students in teams use software engineering methodology to design and implement a semester-long project. Written reports and oral presentations are required. Prerequisites: CSCI 205 and senior standing in the College of Arts and Sciences and permission of the instructor."}, {"abbreviation": "DANC 105", "name": "Jazz Dance Technique I", "info": "Beginning level course on jazz as an American vernacular dance form emphasizing its roots in African and Latin cultural rhythms, as well as contemporary technique. Crosslisted as AFST 105."}, {"abbreviation": "DANC 120", "name": "Modern Dance Technique I", "info": "Beginning level technique emphasizing the basic principles of different modern dance styles, dynamics and alignment through floorwork, locomotor patterns, improvisation and movement combinations."}, {"abbreviation": "DANC 140", "name": "Ballet Technique I", "info": "Beginning level ballet course emphasizing fundamental classical ballet technique and vocabulary necessary for performance."}, {"abbreviation": "DANC 200", "name": "Art of Chinese Watersleeve", "info": "Studio training in the classical and folk dance forms of China, including Chinese traditional dance and specialized props, such as watersleeves, fans, ribbons, etc. Dance experience required."}, {"abbreviation": "DANC 220", "name": "Modern Dance Technique II", "info": "Intermediate level technique exploring the basic principles of different modern dance styles, alignment, dynamics, and musicality through floorwork, locomotor patterns and movement combinations. Prerequisite: DANC 120."}, {"abbreviation": "DANC 240", "name": "Ballet Technique II", "info": "Intermediate level ballet course emphasizing the development of technique and performance aesthetics."}, {"abbreviation": "DANC 250", "name": "History of Dance", "info": "Survey of Western and non-Western dance forms both as reflective of cultural history and as an art form from ancient times to the present."}, {"abbreviation": "DANC 273", "name": "American Social Dance", "info": "No experience required. A kinesthetic American history course, this class will focus on the various popular dance forms of the 20th century common to American dance halls, television and movies, stage, and streets."}, {"abbreviation": "DANC 319", "name": "Individual Projects", "info": "Individual, special projects supervised by instructor. Prerequisites: junior or senior status and permission of the instructor."}, {"abbreviation": "DANC 360", "name": "Rehearsal and Performance", "info": "Quarter-course credit for substantial participation in dance production. Prerequisite: permission of the instructor."}, {"abbreviation": "EAST 228", "name": "China Through the Lens", "info": "A history of cinema in mainland China, its origin and important periods, movements, and \"generations,\" as well as representative cinemas of Taiwan and Hong Kong."}, {"abbreviation": "EAST 233", "name": "China from Ancient Time to 18th Century", "info": "Chinese history and culture from their beginnings to the middle of the Qing Dynasty, before that dynasty and China were challenged by the West. Crosslisted as HIST 293."}, {"abbreviation": "EAST 244", "name": "Ghosts, Gods, & Immortals: The Taoist Religion in China", "info": "To live as long as heaven and earth; to make the body indestructible; to master the transformations of the cosmos; to control legions of demons and deities. These are the aims of the Chinese religion known as Taoism. This course examines Taoist beliefs and practices from ancient to modern times. Crosslisted as RELI 244."}, {"abbreviation": "EAST 251", "name": "Buddhism", "info": "Interdisciplinary introduction to Buddhism, including basic teachings of liberation from suffering, impermanence, no-self, ethics, and meditation. Also explores the historical development of various streams of Buddhism in Asia and the West, with attention to the effect of Buddhism on society, politics, and material culture. Crosslisted as RELI 200."}, {"abbreviation": "EAST 254", "name": "From Shinto to Shogun: Pre-modern Japan", "info": "The course will examine the cultural and institutional developments which constitute the Japanese heritage, with emphasis on classical Heian and early medieval court culture and late medieval samurai society.  Crosslisted as HIST 295."}, {"abbreviation": "EAST 255", "name": "Modern Japanese History", "info": "Japanese economy, society, politics, war, and diplomacy from 1868 to World War II; successes, crises, and conflicts in building a modern nation-state. Crosslisted as HIST 296."}, {"abbreviation": "EAST 256", "name": "Contemporary Japanese History", "info": "Political and cultural history of post-World War II Japan using various sources including film, anime, art, political cartoon, popular song. Crosslisted as HIST 286."}, {"abbreviation": "EAST 321", "name": "Independent Study", "info": "Individual program of reading, research, or writing.  Prerequisite: permission of the instructor."}, {"abbreviation": "ECEG 101", "name": "Electrical and Computer Engineering Analysis", "info": "Introduction to concepts, voltage, current, signals, network elements, and Kirchhoff's laws. Electrical measurements, energy and information generation, storage and transmission. Introduction to logic circuits and switching theory. Not for majors in electrical and computer engineering. Students must have had or be taking MATH 202."}, {"abbreviation": "ECEG 201", "name": "Introduction to Electrical and Computer Engineering Design", "info": "This introductory ECE design course covers basics of electronic design focusing particularly on fabrication, measurement, and professional communication. Students will design, fabricate, and test electronic circuits and learn standards for manufacturability and professional communication."}, {"abbreviation": "ECEG 205", "name": "Electrical and Computer Engineering Fundamentals", "info": "Electrical measurement and physical quantities, sensors, sensor dynamics, and filters. Corequisite: MATH 202."}, {"abbreviation": "ECEG 210", "name": "Circuit Theory & Application", "info": "Analysis and design of simple DC and AC circuits including Thevenin equivalents, time domain and sinusoidal response, power transfer, and complex impedance. Design of practical circuits and fundamentals of system integration. Prerequisite: ECEG 100."}, {"abbreviation": "ECEG 240", "name": "Digital System Design", "info": "Introduction to digital design focusing on representation and abstraction in digital systems. Prerequisite: ECEG 100 or ECEG 120 or CSCI 206."}, {"abbreviation": "ECEG 301", "name": "Praxis of Engineering Design", "info": "Project-oriented course that focuses on electrical and computer engineering design with the goal of developing practical skills in prototyping, professional communication, and test and measurement. Prerequisite: ECEG 201 or ECEG 226 or permission of the instructor."}, {"abbreviation": "ECEG 320", "name": "Linear Systems and Signal Processing", "info": "Discrete and continuous signals; differential and difference equations; state equations; transform techniques (Z, Laplace, Fourier); analog and digital filter designs. Prerequisites: ECEG 226 and MATH 212."}, {"abbreviation": "ECEG 350", "name": "Electronics I", "info": "Introduction to semiconductor components and circuits. Device physics, operation, and modeling; design applications of operational amplifiers, diodes, and transistors; PN junctions; digital logic gates. Prerequisite: ECEG 210 or ECEG 226 or permission of the instructor."}, {"abbreviation": "ECEG 400", "name": "ECE Capstone Design I", "info": "Engineering capstone design focusing on problem identification, project planning and logistics, and learning the divergent/convergent engineering design process in Electrical & Computer Engineering. Year long capstone experience that concludes with ECEG 401. Prerequisite: ECEG 301 or permission of instructor."}, {"abbreviation": "ECEG 409", "name": "Engineering: A Humanist Enterprise", "info": "This course explores engineering as a human activity: undertaken by humans to meet human goals. The course explores how multiple disciplinary perspectives are required to undertake good engineering, and how our nature as humans affects engineering activities to help students transcend disciplinary boundaries. Crosslisted as UNIV 350 and ECEG 610."}, {"abbreviation": "ECEG 431", "name": "Computer Systems", "info": "This course provides students the concepts, technologies, and skills needed for advanced study in computer engineering. It includes aspects of computer organization, computer architecture, operating systems, networking, and performance evaluation and the relationship between them. Prerequisite: CSCI 206 or ECEG 247."}, {"abbreviation": "ECEG 471", "name": "Applications of Probability in Electrical and Computer Engineering", "info": "Probability theory, random variables, probability mass/density functions, expected value, Gaussian distribution, detection, estimation, applications in electrical and computer engineering. Prerequisite: ECEG 320 or permission of the instructor. Crosslisted as ECEG 671."}, {"abbreviation": "ECEG 473", "name": "Digital Speech and Audio Processing", "info": "Theory and application of digital speech and audio processing. Topics include speech and audio (MP3) coding, artificial speech synthesis, automatic speech recognition, and audio effects. Prerequisite: ECEG 320 or permission of the instructor. Crosslisted as ECEG 673."}, {"abbreviation": "ECEG 480", "name": "Electrical Control Systems", "info": "System components: closed loop systems; stability from Nyquist and root locus viewpoints: performance, compensation techniques, sampled systems, Z-Transforms. Prerequisites: ECEG 320 and ECEG 350."}, {"abbreviation": "ECEG 495", "name": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical computation techniques for solving ordinary and partial differential equations relevant to engineering applications. Prerequisite: permission of the instructor.Crosslisted as CEEG 495 and CHEG 495 and MECH 495 and ENGR 695."}, {"abbreviation": "ECEG 610", "name": "Advanced Engineering: A Humanist Enterprise", "info": "This course explores engineering as a human activity: undertaken by humans to meet human goals. The course explores how multiple disciplinary perspectives are required to undertake good engineering, and how our nature as humans affects engineering activities to help students transcend disciplinary boundaries. Crosslisted as ECEG 409 and UNIV 350."}, {"abbreviation": "ECEG 671", "name": "Applications of Probability in Electrical and Computer Engineering", "info": "Probability theory, random variables, probability mass/density functions, expected value, Gaussian distribution, detection, estimation, applications in electrical and computer engineering. Corequisite: ECEG 320 or permission of the instructor. Crosslisted as ECEG 471."}, {"abbreviation": "ECEG 673", "name": "Digital Speech/Audio Process.", "info": "Theory and application of digital speech and audio processing. Topics include speech and audio (MP3) coding, artificial speech synthesis, automatic speech recognition, and audio effects. Crosslisted as ECEG 473."}, {"abbreviation": "ECEG 695", "name": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications."}, {"abbreviation": "ECON 103", "name": "Economic Principles and Problems", "info": "General introduction to both macroeconomics and microeconomics, along with an introduction to economic history, international economics, and political economy. The course also examines the origin of economic ideas in the works of Adam Smith, John Maynard Keynes, Karl Marx, and others."}, {"abbreviation": "ECON 222", "name": "Economic Topics", "info": "Selected issues in economic theory or policy.  Prerequisite: permission of the instructor."}, {"abbreviation": "ECON 236", "name": "Gender, Race and Poverty", "info": "A study of concentrated poverty and unemployment in the United States and policies to generate full employment and eliminate poverty. Prerequisite: ECON 103 and/or permission of the instructor. Crosslisted as WMST 236."}, {"abbreviation": "ECON 257", "name": "Intermediate Macroeconomic", "info": "The study of national income, employment, inflation, interest rates, and the impact of monetary and fiscal policy on the economy. Prerequisite: ECON 103 and MATH 192 or MATH 201."}, {"abbreviation": "ECON 258", "name": "Intermediate Political Economy", "info": "Intermediate study of Marxist and institutionalist political economy. The ideas of Marx and Veblen applied to such matters as the distribution of income and power, the environment, working conditions, consumerism, and race and gender issues. Prerequisite: ECON 103."}, {"abbreviation": "ECON 259", "name": "Intermediate Mathematical Microeconomics", "info": "Intermediate microeconomic theory of the consumer, the firm, market structures, and resource allocation. Topics are introduced using differential calculus. Not open to students who have completed ECON 256. Prerequisites: ECON 103 and MATH 192 or MATH 201."}, {"abbreviation": "ECON 273", "name": "Latin American Economic Development", "info": "The course deals with historic and contemporary economic problems, starting from colonial times and reaching the present integration into world economy. Crosslisted as LAMS 273."}, {"abbreviation": "ECON 299", "name": "Teaching Assistants in Economics", "info": "This course can only be taken by economic majors who have permission and have taken the prerequisites. Prerequisites: ECON 256 or ECON 259, ECON 257, and ECON 258 and permission of the instructor."}, {"abbreviation": "ECON 303", "name": "Game Theory", "info": "“Game Theory” is a set of ideas that help in analyzing strategic situations: situations in which multiple players — individual, groups, nations, organizations, even flora and fauna — interact and pursue their goals in situations of cooperation and conflict. Game theory has been applied to study strategic conflict and cooperation"}, {"abbreviation": "ECON 304", "name": "Financial Economics", "info": "The course is focused on theory of finance and asset pricing. Topics include state pricing theory, capital asset pricing model, portfolio theory and risk aversion."}, {"abbreviation": "ECON 311", "name": "Labor Economics", "info": "An examination of economic models related to labor markets, current labor market trends, and the influence of related government policies. Prerequisites: ECON 256 or ECON 259 and one semester of statistics. Preference given to ECON and ECMA majors."}, {"abbreviation": "ECON 339", "name": "China and East Asian Economics", "info": "An analysis of economic transition and development in China, with emphasis on its role in the Asia-Pacific and world economies."}, {"abbreviation": "ECON 341", "name": "Econometrics", "info": "The application of statistical methods to quantify and test economic theories, analyze government policies, and forecast economic variables."}, {"abbreviation": "ECON 350", "name": "Classical Marxism", "info": "The goal is to develop an understanding of Marx's analysis of capitalism by reading mainly original texts by Marx and consider its applications to disciplinary thinking. Crosslisted as GEOG 350."}, {"abbreviation": "ECON 357", "name": "Economic Development", "info": "The main theories of development; economic and social dualism; agricultural, industrial, and trade strategies; and the role of less developed countries in the emerging global economy. Prerequisites: ECON 256 or ECON 259 and ECON 257 and permission of the instructor. Preference given to ECON and ECMA majors."}, {"abbreviation": "ECON 418", "name": "American Economic History", "info": "An examination of the development and influence of American economic institutions from colonial to current times. Prerequisites: ECON 256 or ECON 259 and ECON 257, or permission of the instructor. Preference given to ECON and ECMA majors."}, {"abbreviation": "ECON 429", "name": "Political Economy of Financial Crises", "info": "This course will explore the causes and consequences of financial crises from macroeconomic perspectives, with most of the attention given to the recent financial crisis in the United States. Prerequisite: ECON 258 or permission of the instructor. Preference given to ECON and ECMA majors."}, {"abbreviation": "ECON 444", "name": "Senior Seminar in Economic Topics", "info": "Topics to be announced at the time of preregistration."}, {"abbreviation": "EDUC 101", "name": "Social Foundation of Education", "info": "Historical, economic, philosophical, and social foundations of education, and their implications for present-day education in America. Provides a background of information for the prospective teacher and citizen. Not open to seniors."}, {"abbreviation": "EDUC 201", "name": "Educational Psychology", "info": "Role of psychological concepts in educational practices. Nature, sources of individual differences in development and readiness. Learning theory, motivation, and emotion in learning.  Issues in identifying and supporting the learning of all students. Measurement and evaluation of learning."}, {"abbreviation": "EDUC 232", "name": "Remaking Public Education", "info": "Examines the way advocates, entrepreneurs, and philanthropists are changing public education (and society) through innovations liike charter schools, school vouchers, cyber schools, and home schooling."}, {"abbreviation": "EDUC 290", "name": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Crosslisted as WMST 290 and EDUC 690."}, {"abbreviation": "EDUC 312", "name": "Counseling Techniques", "info": "This course provides an introduction to counseling theory and basic micro-skills of counseling. Students will practice basic techniques of therapeutic interviewing. Crosslisted as EDUC 612."}, {"abbreviation": "EDUC 315", "name": "Senior Thesis", "info": "Senior thesis.  Prerequisites: permission of the instructor and department."}, {"abbreviation": "EDUC 317", "name": "Problems in Education", "info": "Research on a problem not involved in a student thesis. Upperclass students. Prerequisite: permission of the instructor. Crosslisted as EDUC 617."}, {"abbreviation": "EDUC 318", "name": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education. Crosslisted as EDUC 618."}, {"abbreviation": "EDUC 322", "name": "Psychology of the Exceptional Child", "info": "Understanding the psychology of the exceptional child from childhood through adolescence. Focused involvement in building an understanding of the diverse ways cognitive disabilities are manifested in children and adolescents with an emphasis on prevention, intervention and remediation. Optional fieldwork. Crosslisted as EDUC 622."}, {"abbreviation": "EDUC 323", "name": "Education of Young Children", "info": "A conceptual-development overview of the social, emotional, cognitive, and physical characteristics of the early childhood years (to age 9) stressing extrapolation from developmental theory to educational practice for teachers and parents who function as the earliest educators. Crosslisted as EDUC 623."}, {"abbreviation": "EDUC 335", "name": "Child & Adolescent Development", "info": "Using textbooks, films, media and popular children's and young adult literature, this course examines all aspects of development of school-age students in grades K-12. Requires field work. Not open to students who have taken EDUC 334 or EDUC 634 or EDUC 635."}, {"abbreviation": "EDUC 339", "name": "Inclusive Practices", "info": "Students will explore the unique instructional needs of L2 learners and students with disabilities and learn how to modify and adjust content, process, and product to enhance their development in inclusive classrooms. Required fieldwork."}, {"abbreviation": "EDUC 344", "name": "Science as Inquiry", "info": "This course reflects best practices for the teaching of science as inquiry outlined by the National Science Education Standards and the PA State Standards. This course provides instructional methods and curricular materials appropriate for teaching science concepts, processes, and skills to young children. Prerequisites: EDUC 101 and EDUC 201. Crosslisted as EDUC 644."}, {"abbreviation": "EDUC 349", "name": "Student Teaching: Elementary", "info": "Supervised practice in the design and implementation of instruction in elementary school classrooms. Emphasis on professional conduct and use of theory to inform practice. Students must be accepted into the Pre-CIP program, must have enrolled in all certification courses or obtain permission of the instructor.  Corequisite: EDUC 449. Crosslisted as EDUC 649."}, {"abbreviation": "EDUC 351", "name": "Learning and Development in Postsecondary Education", "info": "Investigation of contemporary theories pertaining to the processes of learning and development that occur from later adolescence through old age. Crosslisted as EDUC 651."}, {"abbreviation": "EDUC 355", "name": "Teaching of Science in Secondary School", "info": "Principles and practices of teaching biology, chemistry, physics, earth and space science, and environmental science in grades 7-12. Prerequisites: EDUC 101, EDUC 201, and EDUC 334 or EDUC 335 (EDUC 335 required for environmental science). Crosslisted as EDUC 655."}, {"abbreviation": "EDUC 364", "name": "Qualitative Research Methods", "info": "This is an introduction to the foundations of qualitative design in education, including: history, philosophy, nature, types, examples, and the challenges associated with data collection and its interpretation. Crosslisted as EDUC 664."}, {"abbreviation": "EDUC 425", "name": "Internship in Education", "info": "Supervised practice in an educational setting including a structured reflection component. This course may be used to fulfill the Culminating Experience course requirement for the B.A. in education."}, {"abbreviation": "EDUC 449", "name": "Professional Seminar in Elementary Education", "info": "Systematic approach to the observation, interpretation, verification, and remediation of problems affecting student learning. Psychological and sociological theory informing teaching practice. Implications of student diversity for adaptation of instruction.  Prerequisites: EDUC 342, senior status, and permission of the instructor. Corequisite: EDUC 349."}, {"abbreviation": "EDUC 612", "name": "Counseling Techniques", "info": "This course provides an introduction to counseling theory and basic micro-skills of counseling. Students will practice basic techniques of therapeutic interviewing. Crosslisted as EDUC 312."}, {"abbreviation": "EDUC 618", "name": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education. Crosslisted as EDUC 318."}, {"abbreviation": "EDUC 622", "name": "Psyc of  the Exceptional Child", "info": "Understanding the psychology of the exceptional child from childhood through adolescence. Focused involvement in building an understanding of the diverse ways cognitive disabilities are manifested in children and adolescents with an emphasis on prevention, intervention and remediation. Optional fieldwork. Crosslisted as EDUC 322."}, {"abbreviation": "EDUC 623", "name": "Education of Young Children", "info": "A conceptual-developmental overview of the social, emotional cognitive, and physical characteristics of the early childhood years (to age 9) stressing extrapolation from developmental theory to educational practice for teachers and parents who function as the earliest educators. Crosslisted as EDUC 323."}, {"abbreviation": "EDUC 639", "name": "Inclusive Practices", "info": "Students will explore the unique instructional needs of L2 learners and students with disabilities and learn how to modify and adjust content, process, and product to enhance their development in inclusive classrooms. Required fieldwork."}, {"abbreviation": "EDUC 644", "name": "Science as Inquiry", "info": "This course reflects best practices for the teaching of science as inquiry outlined by the National Science Education Standards and the PA State Standards. This course provides instructional methods and curricular materials appropriate for teaching science concepts, processes, and skills to young children. Prerequisite: permission of instructor. Crosslisted as EDUC 344."}, {"abbreviation": "EDUC 651", "name": "Learning and Development in Postsecondary Education", "info": "Investigation of contemporary theories pertaining to the processes of learning and development that occur from later adolescence through old age. Crosslisted as EDUC 351."}, {"abbreviation": "EDUC 664", "name": "Qualitative Research Methods", "info": "This is an introduction to the foundations of qualitative design in education, including: history, philosophy, nature, types, examples, and the challenges associated with data collection and its interpretation. Crosslisted as EDUC 364."}, {"abbreviation": "EDUC 680", "name": "Thesis", "info": "Independent study."}, {"abbreviation": "EDUC 681", "name": "Master's Treatise", "info": "Master's Treatise. Prerequisite: permission of the instructor."}, {"abbreviation": "EDUC 690", "name": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Prerequisite: permission of the instructor. Crosslisted as EDUC 290 and WMST 290."}, {"abbreviation": "EDUC 697", "name": "College Stdnt Personnel Intern", "info": "Supervised practice in student affairs, together with group reflection. May be repeated for up to two credits. Prerequisite: permission of the instructor."}, {"abbreviation": "ENCW 101", "name": "Creative Writing", "info": "Introduction to creative writing through the reading and writing of poetry and prose (fiction or creative nonfiction). Does not count toward the creative writing concentration or minor. Prerequisite: seniors by permission of the instructor."}, {"abbreviation": "ENCW 102", "name": "Writing Fiction", "info": "In this introductory fiction workshop, students will read and discuss contemporary and classic texts with a writer’s eye. Completing fiction exercises and revisions as well as responding to one another’s work, they will use the techniques and habits of successful writers to enhance their own writing and creativity."}, {"abbreviation": "ENCW 202", "name": "Fiction Workshop", "info": "Principles of writing fiction, with constant practice. Designed for students planning to concentrate or minor in creative writing. Preference given to juniors, sophomores, and first-year students. Restrictions: seniors by permission of the instructor."}, {"abbreviation": "ENCW 204", "name": "Poetry Workshop", "info": "Principles of writing poetry, with constant practice. Designed for students planning to concentrate or minor in creative writing. Preference given to juniors, sophomores, and first-year students. Prerequisite: seniors by permission of the instructor."}, {"abbreviation": "ENCW 210", "name": "Special Topic in Creative Writing", "info": "Studies in such topics as prosody, stylistics, characterization, or narrative theory. Course emphasizes formal or structural elements within particular genres and an appreciation of craft from a writer's perspective. Prerequisite: permission of the instructor."}, {"abbreviation": "ENCW 232", "name": "Topics: Literary Journalism", "info": "Literary journalists engage the world via fact-based methods including interview, research, and first-hand observation. Using unique personal perspectives, they write in-depth, non-fiction stories employing both narrative and essayistic techniques. Students should aim to write with immediacy via vivid storytelling, while also placing events and experiences within broader cultural contexts."}, {"abbreviation": "ENCW 250", "name": "The Writing World", "info": "Students will discover and engage with the Creative Writing community at Bucknell (as well as with the greater writing community) through a community- and career-focused sequence of practical assignments, culminating in a group project in which students will identify a local need and design an event to address it."}, {"abbreviation": "ENCW 304", "name": "Advanced Poetry Workshop", "info": "Advanced workshop in the writing of poetry. Prerequisites: Any 200-level Creative Writing (ENCW) course in poetry  and permission of the instructor. Crosslisted as ENCW 608."}, {"abbreviation": "ENCW 323", "name": "Writing the Novel", "info": "Students will produce the first draft of a novel or section thereof. The first half of the semester will emphasize composition; the second, revision. Students will read a variety of novels and speak with authors. Prerequisite: any 200-level ENCW course in creative nonfiction or fiction and permission of the instructor."}, {"abbreviation": "ENFS 130", "name": "Introduction to Film/Media Studies", "info": "Introduction to film grammar, history, genres, and movements using theoretical text and primary source films. Emphasis on critical thinking skills through video essay projects."}, {"abbreviation": "ENFS 238", "name": "Special Topics in Film Studies", "info": "Examination of a specialized topic in film studies. Weekly screenings."}, {"abbreviation": "ENFS 245", "name": "Televisual Culture", "info": "This course focuses on non-cinematic moving image culture including the television industry, video art, and new media technologies. The course examines the subject from a variety of theoretical viewpoints—industrial practices, stylistic modes, and audience reception."}, {"abbreviation": "ENFS 253", "name": "Introduction to Film/Media Production", "info": "An introductory level, studio-based course covering the basics of moving image practice, from pre-visualization to principles and techniques of cinematography, editing, lighting and sound. Students produce individual projects, developing both technical skills and personal vision. In-class screenings further students’ awareness of cinema’s expressive potential. Prerequisite: ENFS 130"}, {"abbreviation": "ENFS 335", "name": "Special Topics in Film/Media Production", "info": "This advanced seminar focuses on specific production (lighting, cinematography) and post-production (sound design, color grading) areas to provide students with an in-depth knowledge of specialized production skills. Prerequisites: ENFS 238 or ENFS 253 or ENFS 254."}, {"abbreviation": "ENFS 337", "name": "Seminar in Film Theory", "info": "Survey of approaches to film analysis and critique, ranging from realist/formalist debates to psychoanalytic, feminist, and semiotics approaches. Weekly screenings. Prerequisite: ENFS 130 and permission of the instructor."}, {"abbreviation": "ENFS 340", "name": "Film/Media Production Practicum", "info": "The Film/Media Production Practicum provides students with advanced and specialized study in a particular area of Film/Media production. Possible practicum topics might include advanced sound design, color grading, visual effects works, or specialized cinematography techniques."}, {"abbreviation": "ENGR 100", "name": "Exploring Engineering", "info": "Introduction to the study and practice of engineering, including overviews of specific disciplines. Participatory focus involves group design projects, hands-on learning, computer work, team building, and engineering ethics discussions. Permission of instructor required for non-first-year students."}, {"abbreviation": "ENGR 239", "name": "Solid Mechanics II", "info": "Behavior of deformable systems: analysis for forces/stresses and deformation/strains due to axial, torsional, flexural, shear, and combined effects. Analysis of indeterminate systems and basic concepts of stability of compression members. Laboratory experiments to demonstrate mechanics principles. Prerequisite: ENGR 229."}, {"abbreviation": "ENGR 240", "name": "Science of Materials", "info": "Study of the relationships between atomic structure and observable properties of materials. Properties of metallic, ceramic, and polymeric materials. Selection of materials for engineering applications. Measurement and modification of material properties. With experimental laboratory. Pre/Corequisite: one of the following: CHEM 203, 205, 207, or equivalent, or instructor permission."}, {"abbreviation": "ENGR 245", "name": "Technical and Professional Communication for Engineers", "info": "Survey of communication, including, but not limited to, oral and poster presentations, professional/business communication, and developing and conveying arguments, all of which are highly relevant to engineers pursuing academic, industrial, or other career paths."}, {"abbreviation": "ENGR 452", "name": "Interdisciplinary Senior Design I", "info": "Capstone design course emphasizing realization of engineered design solutions in interdisciplinary teams. Focus areas include problem definition, background research, solution generation, team skills, communication, and professional development. Emphasis placed on articulating, addressing, and validating customer-appropriate value proposition."}, {"abbreviation": "ENLS 101", "name": "Literature and Composition", "info": "Introduction to the critical study of literature and instruction in composition. First-year students only; others by permission of the instructor."}, {"abbreviation": "ENLS 103", "name": "Public Writing for Media: Rhetoric for a Digital Age", "info": "This course will help students develop skills in effective writing for a public audience across a range of types of digital and print media--including journalism, blogs, short video scripts, email lists, and even social media such as Twitter. The course will draw on basics of Classical Rhetoric, the instructor's experience."}, {"abbreviation": "ENLS 109", "name": "Public Speaking in the 21st Century", "info": "Introduction to public speaking with a focus on historical speeches. Study and practice of speech writing and organization, verbal and nonverbal communication."}, {"abbreviation": "ENLS 199", "name": "Survey of Literatures in English", "info": "A survey of major authors, texts, concepts, and developments in English and American literature with participation of weekly guest lecturers from the English department."}, {"abbreviation": "ENLS 213", "name": "Special Topics in American Literature", "info": "Selected special topics in American literature."}, {"abbreviation": "ENLS 216", "name": "Studies in American Literary Genres", "info": "Study of a selected genre of texts in American Literature."}, {"abbreviation": "ENLS 222", "name": "Ethnic Comedy in the United States", "info": "History, theory, and practice of comedy in the United States, focused on works by comedians of many ethnicities. The course explores how comedy contributes to the national conversation on race, sometimes soothing social tensions with laughter and at other times sparking ethnic conflict."}, {"abbreviation": "ENLS 258", "name": "Studies in Shakespeare", "info": "Studies in such special topics as \"Shakespeare and Film\", \"Shakespeare's History Plays,\" \"Psychoanalysis and Shakespeare\"."}, {"abbreviation": "ENLS 270", "name": "Romantic Literature, 1780-1832", "info": "Examination of selected authors in poetry and prose, read in relationship to contemporary political and cultural influences."}, {"abbreviation": "ENLS 284", "name": "The 19th-century English Novel", "info": "Major developments in the novel as a genre and representative novels."}, {"abbreviation": "ENLS 300", "name": "Seminar in Literary Theory and Criticism", "info": "Introduction to graduate study, including literary and critical theory, research, and other elements of literary scholarship. Open to advanced undergraduates. Crosslisted as ENLS 600."}, {"abbreviation": "ENLS 326", "name": "Seminar in Irish Literature", "info": "Advanced topics in Irish literature including Irish Women Writers, Nationalism and Literature, and Contemporary Irish Writers. Prerequisite: permission of the instructor. Crosslisted as ENLS 626."}, {"abbreviation": "ENLS 327", "name": "Seminar in Caribbean Literature", "info": "Study of selected thematic, aesthetic and ideological issues in Caribbean writing."}, {"abbreviation": "ENLS 378", "name": "Thesis Workshop", "info": "A colloquium on problems arising from the writing of a scholarly thesis. Prerequisite: permission of the instructor. Crosslisted as ENLS 678."}, {"abbreviation": "ENLS 393", "name": "Seminar in Contemporary Drama", "info": "Special topics. Student reports, oral and written. Crosslisted as ENLS 693."}, {"abbreviation": "ENLS 600", "name": "Seminar in Literary Theory", "info": "Introduction to graduate study, including literary and critical theory, research, and other elements of literary scholarship. Prerequisite: permission of the instructor. Crosslisted as ENLS 300."}, {"abbreviation": "ENLS 626", "name": "Seminar in Irish Literature", "info": "Advanced topics in Irish literature, including Irish Women Writers, Nationalism and Literature, and Contemporary Irish Writing. Prerequisite: permission of the instructor. Crosslisted as ENLS 326."}, {"abbreviation": "ENLS 627", "name": "Seminar-Caribbean Literature", "info": "Study of selected thematic, aesthetic, and ideological issues in Caribbean writing. Prerequisite: permission of the instructor. Crosslisted as ENLS 327."}, {"abbreviation": "ENLS 678", "name": "Thesis Workshop", "info": "A colloquium on the writing of a scholarly thesis. Prerequisite: permission of the instructor. Crosslisted as ENLS 378."}, {"abbreviation": "ENLS 693", "name": "Seminar in Contemporary Drama", "info": "Special topics. Student reports, oral and written. Prerequisite: permission of the instructor. Crosslisted as ENLS 393."}, {"abbreviation": "ENST 100", "name": "Introduction to Environmental Studies", "info": "A survey of environmental issues intended for non-majors. Students will understand the cultural, political, historical, economic and ethical complexities of environmental problems and their responses. Intended for first-year students and sophomores. Does not count toward either the Environmental Studies or Environmental Science major."}, {"abbreviation": "ENST 113", "name": "Human Impact on Environment", "info": "Causes and effects of major environmental changes induced by humans, challenges to our future well-being, and opportunities for future sustainability. Prerequisite: open to first-year students only. Crosslisted as GEOG 113."}, {"abbreviation": "ENST 205", "name": "Green Utopias", "info": "Introduction to literary utopias and to the cultural writings of various ecological movements offering alternative concepts to the increasing destruction of nature."}, {"abbreviation": "ENST 209", "name": "Ecopolitics in Latin America", "info": "This course examines climate policy debates and recent shifts in global environmentalism, with a focus on a wide range of Latin American territories. Crosslisted as ANTH 202 and LAMS 202."}, {"abbreviation": "ENST 215", "name": "Environmental Planning", "info": "Explores the main approaches to planning theory and their environmental applications. Considers how environmental planning can promote the socio-ecological health and sustainability of democratic communities. Crosslisted as GEOG 215."}, {"abbreviation": "ENST 216", "name": "Preindustrial Environment", "info": "An introduction to global environmental history of the preindustrial world through three thematic lenses: how the natural environment shaped patterns of human life, how ideologies toward nature shifted over time, and how human activities and ideologies reshaped the ancient landscape. Crosslisted as CLAS 220."}, {"abbreviation": "ENST 221", "name": "Hazardous Waste and Society", "info": "Hazardous waste regulation, risk assessment and toxicology, overview of treatment technologies and site investigation, environmental audits, facilities siting and public participation, pollution prevention. Not open to engineering students, and also not open to students who have taken CEEG 444."}, {"abbreviation": "ENST 243", "name": "Global Environmental History", "info": "Explores how global forces, including population growth, commercialization, and fossil fuel revolutions, transformed nature and culture across the planet in the 20th century."}, {"abbreviation": "ENST 245", "name": "Environmental Policy and Politics", "info": "An introduction to understanding the role of political institutions, stakeholders and policy processes (in the U.S. and internationally) in addressing environmental problems. Crosslisted as POLS 291."}, {"abbreviation": "ENST 254", "name": "Environmental Humanities", "info": "Explores humanistic perspectives on the environment--from history, ethics, literature, religion, and the arts--including how these perspectives complement or unsettle knowledge about nature from the sciences."}, {"abbreviation": "ENST 302", "name": "Community-Based Research Design", "info": "Students will learn quantitative and qualitative research methods related to environmental studies including research design, data collection, and analysis. Prerequisite: junior or senior status. Preference to Environmental Studies majors, others by permission of the instructor."}, {"abbreviation": "ENST 325", "name": "Nature, Wealth and Power", "info": "A seminar in political ecology that explores the historical, social political and economic dimensions of environmental change in developing regions. First-year students and sophomores by permission only.  Prerequisite: permission of the instructor.  Crosslisted as GEOG 325."}, {"abbreviation": "ENST 345", "name": "Food and the Environment", "info": "Nothing from the environment is more important than food production, nothing affects the environment more; we'll study both environmental and social circumstances. Laboratory science course. Crosslisted as GEOG 345."}, {"abbreviation": "ENST 353", "name": "Ecosystem Ecology", "info": "Interactions between organisms and the physical and chemical environment including nutrient cycling and energy flow, biogeochemistry, and temporal and spatial dynamics of ecosystems.  Prerequisites: BIOL 208, junior or senior status, and permission of the instructor. Crosslisted as BIOL 353 and BIOL 653."}, {"abbreviation": "FOUN 098", "name": "Foundation Seminar", "info": "A small writing-intensive first-year seminar. Also see RESC 098."}, {"abbreviation": "FREN 101", "name": "Discovering French", "info": "Beginning language skills. Practice in listening, speaking, reading, and writing; elementary grammar; and introduction to French civilization. Prerequisite: no more than two years of secondary school French or permission of the instructor."}, {"abbreviation": "FREN 102", "name": "Exploring French", "info": "Continuation of language skills. Practice in listening, speaking, reading, and writing; grammar; readings in literature and civilization. Prerequisite: FREN 101 or one year of secondary school French."}, {"abbreviation": "FREN 103", "name": "Building Proficiency in French", "info": "A review of basic grammar emphasizing all four language skills and culture. Prerequisite: FREN 102 or equivalent (three years of secondary school French)."}, {"abbreviation": "FREN 104", "name": "Communicating in Context", "info": "Continuing review of basic grammar emphasizing all four language skills and culture. Prerequisite: FREN 103 or four years of secondary school French."}, {"abbreviation": "FREN 201", "name": "Intermediate French Conversation I", "info": "Concentration on development of speaking skill. Conducted entirely in French by native speaker. Not open to students who have studied in France or other French-speaking countries. Intended for students enrolled in 200-level courses. Prerequisite: FREN 104 or FREN 150 or equivalent. (Cannot be applied toward the French major or minor)"}, {"abbreviation": "FREN 230", "name": "French Literature I", "info": "Introduction to history of French literature from the Middle Ages to the French Revolution. Provides an introduction to literary history and methods of critical reading. A comprehensive survey. Prerequisite: FREN 104."}, {"abbreviation": "FREN 295", "name": "Topics in French Studies", "info": "Topics vary but permit study of one or several subjects in French or Francophone literature, culture and civilization. Prerequisite: FREN 104."}, {"abbreviation": "FREN 301", "name": "Advanced French Conversation I", "info": "Advanced conversation for students who have studied in France or other French-speaking countries. Conducted entirely in French by native speaker. May not be taken by native speakers of French.(Cannot be applied toward the French major or minor)"}, {"abbreviation": "FREN 336", "name": "Francophone Africa", "info": "Study of literature, film, politics, and society of Francophone Africa. Prerequisite: FREN 104 or FREN 150."}, {"abbreviation": "FREN 390", "name": "Independent Study", "info": "Subject to be selected by student in consultation with the instructor.  Prerequisite: permission of the instructor."}, {"abbreviation": "GEOG 101", "name": "Globalization, People, and Place", "info": "Investigates the world from a spatial perspective to understand the complexity of places and the dynamic relationship between peoples and the world they inhabit. Open to first-years and sophomores."}, {"abbreviation": "GEOG 113", "name": "Human Impact on Environment", "info": "Causes and effects of major environmental changes induced by humans, challenges to our future well-being, and opportunities for future sustainability. Prerequisite: open to first-year students only. Crosslisted as ENST 113."}, {"abbreviation": "GEOG 210", "name": "Urban Condition", "info": "Geographic and sociological inquiry into pressing urban issues of advanced industrialized societies, including inequality, housing, employment, and how cities fit into the American present and future. Crosslisted as SOCI 210."}, {"abbreviation": "GEOG 215", "name": "Environmental Planning", "info": "Explores the main approaches to planning theory and their environmental applications. Considers how environmental planning can promote the socio-ecological health and sustainability of democratic communities. Crosslisted as ENST 215."}, {"abbreviation": "GEOG 216", "name": "Borders and Politics of Mobility", "info": "Explores the politics of contemporary nation state borders, issues of territory, sovereignty, mobility, migration, identity, citizenship, statelessness, and focuses on borders at other scales. Crosslisted as IREL 216."}, {"abbreviation": "GEOG 228", "name": "Media, Space and Place", "info": "This course will explore the power implications of the connections between media and place. Media is shaped by places and society just as much as it shapes them. In the context of “fake news” and social media echo chambers, this course will query the continued relevance of media's \"where\"."}, {"abbreviation": "GEOG 265", "name": "Geography of Pennsylvania", "info": "Exploring the landscape, industry, culture, and history of Pennsylvania; using this example to understand the broad themes of human geography."}, {"abbreviation": "GEOG 302", "name": "Contemporary Africa & Colonial Pasts: Investments and Re-Emergences", "info": "Globalized investment, oil extraction, Oprah and Bono-endorsed RED products, a rising middle class: This course addresses contemporary political economy, meanings of ‘the continent’, and colonial legacy in Africa. We draw on human geography, African history, postcolonial and feminist studies, and literature to understand a rapidly changing continent. Crosslisted as AFST 302."}, {"abbreviation": "GEOG 316", "name": "Geographies of Nationalism", "info": "The course explores nationalism and its increasing popularity by considering it geographically; for example, its dynamic scalar dimensions, its forging of race and gender spatially, and its naturalization in landscape and built form. In so doing, we will critically consider those interests that nationalism serves."}, {"abbreviation": "GEOG 325", "name": "Nature, Wealth and Power", "info": "A seminar in political ecology that explores the historical, social political and economic dimensions of environmental change in developing regions. First-year students and sophomores by permission only. Crosslisted as ENST 325."}, {"abbreviation": "GEOG 345", "name": "Food and the Environment", "info": "Nothing from the environment is more important than food production, nothing affects the environment more; we'll study both environmental and social circumstances. Laboratory science course. Crosslisted as ENST 345."}, {"abbreviation": "GEOG 350", "name": "Classical Marxism", "info": "The goal is to develop an understanding of Marx's analysis of capitalism by reading mainly original texts by Marx and consider its applications to disciplinary thinking. Crosslisted as ECON 350."}, {"abbreviation": "GEOL 203", "name": "Physical/Environmental Geology", "info": "Introduction to Earth's dynamic systems, plate tectonic processes that make Earth a unique planet, and human interaction with Earth. Geologic factors and limitations that affect use or management of the environment. Not open to students who have taken GEOL 250. Prerequisite: first- or second-year status, others by permission."}, {"abbreviation": "GEOL 204", "name": "Evolution of the Earth", "info": "Introduction to the evolution of life, climate, plate tectonics, and catastrophes through time provides perspective for making decisions about ongoing and future environmental change. Preference given to first-years and sophomores."}, {"abbreviation": "GEOL 230", "name": "Environmental GIS", "info": "Geographic Information Systems (GIS) in geologic mapping, environmental monitoring, and hydrologic modeling. Introduction to global positioning,(GPS), environmental databases, spatial analyses, and terrain modeling."}, {"abbreviation": "GEOL 304", "name": "Crystallography-Mineralogy", "info": "Principles of crystallography and mineralogy; crystal morphology, structure, chemistry, physical properties, genesis, occurrence, and identification of important minerals by various techniques including chemical analysis. Prerequisite: GEOL 203 or GEOL 250 or permission of the instructor."}, {"abbreviation": "GEOL 314", "name": "Structural Geology", "info": "Orientation and geometric analyses of rock structures, kinematics and mechanics of rock deformation at all scales. Prerequisite: GEOL 203 or GEOL 250 or permission of the instructor. Crosslisted as GEOL 614."}, {"abbreviation": "GEOL 316", "name": "Geomorphology", "info": "Physical processes shaping the Earth's surface and evolution of resulting landforms. Emphasis on linkages between landscape components and understanding complex relationships between process and form. Prerequisite: GEOL 203 or GEOL 250 or permission of the instructor. Crosslisted as GEOL 616."}, {"abbreviation": "GEOL 319", "name": "Undergraduate Research", "info": "Research course for qualified students in any branch of geology.  Prerequisite: permission of the instructor."}, {"abbreviation": "GEOL 336", "name": "Hydrogeology", "info": "Water properties, fundamental flow equations, surface and subsurface flow, well hydraulics, regional flow, and contamination. Prerequisites: GEOL 203 or GEOL 250 and MATH 192 or MATH 201, or permission of the instructor."}, {"abbreviation": "GEOL 636", "name": "Hydrogeology", "info": "Fundamentals of subsurface flow, regional groundwater flow, well hydraulics, and groundwater quality.  Prerequisite: permission of the instructor. Culminating research project required."}, {"abbreviation": "GLBM 300", "name": "Global Manager as Diplomat", "info": "This course will examine the changing role of the manager in the global business environment."}, {"abbreviation": "GLBM 301", "name": "Global Supply Chain Management", "info": "In this course students will learn the concepts and tools to model, analyze and improve global supply chain operations under a variety of contexts. Prerequisite: MGMT 102 or MATH 216 or permission of the instructor."}, {"abbreviation": "GLBM 302", "name": "The Global Flow of Capital", "info": "This course will explore the challenges of financial management in a global context. Prerequisite: (ACFM 203 or ACFM 370), or MGMT 203, or permission of the instructor."}, {"abbreviation": "GLBM 310", "name": "Independent Study in Global Management", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of instructor."}, {"abbreviation": "GREK 101", "name": "Introductory Ancient Greek", "info": "An introduction to the classical and koine forms of the language.  Emphasis upon forms and grammar, and rapid development of facility in reading."}, {"abbreviation": "GREK 151", "name": "Intermediate Greek", "info": "Study of selected works in Greek, including such authors as Homer, Euripides, Herodotus, Lysias, Plato, Xenophon. Review of forms and grammar. Prerequisite: GREK 102 or equivalent."}, {"abbreviation": "GREK 221", "name": "Studies in Greek Literature", "info": "Study of a topic or author focusing on original Greek texts (e.g., Herodotus, Homer, Sophocles, Plato, New Testament). Highly recommended for students anticipating application to graduate programs in classics or divinity. Prerequisite: GREK 151 or equivalent."}, {"abbreviation": "GRMN 101", "name": "Exploring Your World", "info": "Beginning language skills. Practice in listening, speaking, reading, and writing; elementary grammar; and introduction to German culture."}, {"abbreviation": "GRMN 103", "name": "Building Proficiency in German", "info": "A continuation and review of basic grammar, emphasizing all four language skills and culture. Prerequisite: GRMN 102 or equivalent."}, {"abbreviation": "GRMN 201", "name": "Strategies in Speaking German", "info": "Concentration on development of speaking skills. Conducted in German by native speaker. Intended for students enrolled in 200 and 300-level courses. Co/prerequisite: GRMN 103 or equivalent."}, {"abbreviation": "GRMN 204", "name": "German Conversation and Composition", "info": "Intensive practice in speaking and writing German. Prerequisite: GRMN 104 or equivalent."}, {"abbreviation": "GRMN 318", "name": "Contemporary German Cinema", "info": "Analysis of contemporary German cinema. Advanced level."}, {"abbreviation": "GRMN 419", "name": "Culminating Experience", "info": "Independent study with a faculty member to prepare an oral presentation for annual German Studies Mini-Conference. Prerequisite: permission of the instructor."}, {"abbreviation": "HEBR 101", "name": "Beginning Modern Hebrew", "info": "Introduction to modern Hebrew. Practice in listening, speaking, reading, and writing, elementary grammar and introduction to Israeli culture."}, {"abbreviation": "HEBR 252", "name": " The Modern Jewish Experience in Lit&Film;", "info": "The course explores modern Jewish life around the world through a variety of perspectives, including literature, film, history, and memoir. Emphasis is placed on Jews in Israel and the U.S., as well as on immigration and the Holocaust. Crosslisted as UNIV 262."}, {"abbreviation": "HEBR 390", "name": "Independent Study", "info": "Modern Hebrew at the intermediate level. Prerequisites: HEBR 102 and permission of the instructor."}, {"abbreviation": "HIST 100", "name": "Thinking about History", "info": "Focus and content vary. An introductory history course for the development of informed historical analysis among its students. Primarily for first-year students."}, {"abbreviation": "HIST 211", "name": "Frontiers and Borderlands", "info": "This course examines the development of the American West to 1900."}, {"abbreviation": "HIST 213", "name": "North American Environmental History", "info": "This class introduces the practices and purposes of studying our past relationships with nature, to better understand the origins of North America's landscapes today. Crosslisted as ENST 213."}, {"abbreviation": "HIST 220", "name": "American Civil War and Reconstruction", "info": "The period is studied in depth as a revolutionary era through attention to political, economic, social, constitutional/legal, intellectual trends, events, personae, movements, and institutions."}, {"abbreviation": "HIST 222", "name": "U.S. History from the 1940s to the Present", "info": "This course examines the creation of modern America from World War II to the present."}, {"abbreviation": "HIST 225", "name": "Topics in American Political and Economic History", "info": "Intensive study of leading themes, in American history since 1600. Topics vary from year to year, but may include economic and political structures; intellectual movements, or social and cultural history."}, {"abbreviation": "HIST 240", "name": "Greek History", "info": "From the heroic Bronze Age down through the Persian invasion, the flourishing of Classical Athens, and the Peloponnesian wars to the death of Socrates, focusing on political, social and economic developments. Crosslisted as CLAS 217."}, {"abbreviation": "HIST 254", "name": "Age of Enlightenment", "info": "This course explores the major social, cultural, intellectual, and political developments associated with the European Enlightenment, or \"Age of Reason\"."}, {"abbreviation": "HIST 286", "name": "Contemporary Japanese History", "info": "Political and cultural history of post-World War II Japan using various sources including film, anime, art, political cartoon, popular song. Crosslisted as EAST 256."}, {"abbreviation": "HIST 293", "name": "China from Ancient Times to the 18th Century", "info": "Chinese history and culture from their beginning to the middle of the Qing Dynasty, before that dynasty and China were challenged by the West. Crosslisted as EAST 233."}, {"abbreviation": "HIST 295", "name": "From Shinto to Shogun: Pre-modern Japan", "info": "This course will examine the cultural and institutional developments which constitute the Japanese heritage, with emphasis on classical Heian and early medieval court culture and late medieval samurai society. Crosslisted as EAST 254."}, {"abbreviation": "HIST 296", "name": "Modern Japanese History", "info": "Japanese economy, society, politics, war, and diplomacy from 1868 to World War II; successes, crises, and conflicts in building a modern nation-state. Crosslisted as EAST 255."}, {"abbreviation": "HIST 299", "name": "Topics in Non-western History", "info": "Selected major issues in the study of imperialism and colonialism."}, {"abbreviation": "HIST 330", "name": "European History", "info": "Intensive study of selected issues. Topics vary."}, {"abbreviation": "HIST 374", "name": "Human Trafficking: Ancient to Present Day", "info": "This course covers the very real and challenging topic of human trafficking in Africa and other parts of the world. Human Trafficking illuminates the interconnectedness of multiple systems of economics, politics, and culture through the transfer and control of labor. Crosslisted as IREL 474."}, {"abbreviation": "HUMN 100", "name": "The Humanities Now!", "info": "A multi-section course in the humanities that introduces students to the humanities world through use of latest tools and methods of analysis. Open to first-years and sophomores only."}, {"abbreviation": "HUMN 250", "name": "Modernism and Crisis", "info": "Traces the development of \"modernity\" (and its discontents) by looking at selected interdisciplinary texts and documents - from philosophy, literature, psychology, film, art, and other related disciplinary fields - that reflect or directly address cultural transformation during the 20th century. Crosslisted as ENLS 230 and UNIV 230."}, {"abbreviation": "HUMN 320", "name": "History of Sexuality", "info": "A cross-cultural and interdisciplinary examination of the signification of sexuality in literature, philosophy, scientific discourse, and the visual arts.  Prerequisite: permission of the instructor.  Crosslisted as WMST 325."}, {"abbreviation": "HUMN 350", "name": "Senior Thesis Workshop", "info": "A colloquium on issues arising from the writing of a scholarly thesis.  Prerequisite: permission of the instructor."}, {"abbreviation": "HUMN 351", "name": "Honors Tutorial and Senior Thesis", "info": "Independent study and research leading to the writing of a thesis as approved by the Honors Council.  Prerequisite: permission of the instructor."}, {"abbreviation": "IREL 100", "name": "Globalization & World (Dis)Order", "info": "This course will explore the restructuring of the political, economic, and cultural dimensions of the global world by a way of the theoretical literature on globalization and a series of case studies."}, {"abbreviation": "IREL 200", "name": "International Relations: Topics/Issues", "info": "Selected topics in international relations."}, {"abbreviation": "IREL 216", "name": "Borders and Politics of Mobility", "info": "Explores the politics of contemporary nation state borders, issues of territory, sovereignty, mobility, migration, identity, citizenship, statelessness, and focuses on borders at other scales. Crosslisted as GEOG 216."}, {"abbreviation": "IREL 229", "name": "Middle East Conflict and Revolution", "info": "This course explores some of the most significant controversies, conflicts, revolutions, and resolutions, both historical and contemporary, that define the Middle East as a region."}, {"abbreviation": "IREL 240", "name": "Human Security", "info": "Explores emerging debates around human vulnerability and: conflict, climate change, displacement, development, and other forms of \"security.\""}, {"abbreviation": "IREL 250", "name": "Theories of International Relations", "info": "Analysis and evaluation of main theories of international relations, including realist, neo-realist, liberal, neo-liberal, Gramscian, Marxist, feminist, and post-modernist approaches. Theories are related to the major dimensions of international relations. Prerequisites: POLS 170. Preference given to second semester sophomores and junior IREL majors."}, {"abbreviation": "IREL 252", "name": "Political Economy of Global Resources", "info": "A study of environmental and energy economics in the context of global resources and politics.  The theme of sustainable development will be linked to the new realities of international relations. Prerequisite: ECON 103."}, {"abbreviation": "IREL 255", "name": "International Law", "info": "The nature, historical development, and sources of international law; substantive and procedural international law and its role in international relations. Crosslisted as POLS 278."}, {"abbreviation": "IREL 275", "name": "Global Governance", "info": "This course explores the rationales, processes, and institutions of multilateral governance in a globalized world. We examine the U.N., nongovernmental organizations, conflict resolution, economic development, environment, human rights, and international law. Not open to first-year students. Crosslisted as POLS 275."}, {"abbreviation": "IREL 276", "name": "Comparative Foreign Policy", "info": "This course is designed to introduce students to the theories that have been developed to explain foreign policy processes and foreign policy behavior. The course will also examine and discuss the foreign policies of specific international actors. Crosslisted as POLS 276."}, {"abbreviation": "IREL 381", "name": "Arab-Israeli Conflict, Peace Process", "info": "This course examines the failures and successes of the peace process among Israel, Arab States, and Palestinians. Special focus is on Oslo peace process, outstanding issues, and the involvement of outside actors, particularly the role of the US. Prerequisite: POLS 170 or permission from instructor. Crosslisted as POLS 381."}, {"abbreviation": "IREL 430", "name": "Global Poverty: Politics and Practices", "info": "This course engages debates about the politics and practice of addressing poverty in a global context. We examine how schemes are conceptualized, come to be taken up, and circulate globally -- from micro-finance, to food supplements, and cash-transfers for the poor. Alongside this, we examine the business of “ending poverty.”"}, {"abbreviation": "IREL 474", "name": "Human Trafficking: Ancient to Present Day", "info": "This course covers the very real and challenging topic of human trafficking in Africa and other parts of the world. Human Trafficking illuminates the interconnectedness of multiple systems of economics, politics, and culture through the transfer and control of labor. Crosslisted as Hist 374."}, {"abbreviation": "ITAL 101", "name": "Elementary Italian I", "info": "Beginning language skills, practice listening, speaking, reading, and writing; elementary grammar; and introduction to Italian culture."}, {"abbreviation": "ITAL 102", "name": "Elementary Italian II", "info": "Continuation of language skills. Practice in listening, speaking, reading and writing. Introduction to Italian culture. Prerequisite: ITAL 101 or equivalent."}, {"abbreviation": "ITAL 103", "name": "Intermediate Italian I", "info": "Review and expansion of language skills and cultural knowledge of Italy. Prerequisite: ITAL 102 or equivalent."}, {"abbreviation": "ITAL 104", "name": "Intermediate Italian II: Italian Civilization", "info": "Continuing review of grammar emphasizing all four skills. Focus on civilization. Prerequisite: ITAL 103 or equivalent."}, {"abbreviation": "ITAL 201", "name": "Intermediate Italian Conversation I", "info": "Concentration on development of speaking skills. Conducted in Italian by native speaker. This course can be counted only once toward the minor. Prerequisite or corequisite: ITAL 104 or equivalent."}, {"abbreviation": "ITAL 205", "name": "Discovering Italy", "info": "Introduction to Italian culture. Intensive practice in speaking and writing Italian. Prerequisite: ITAL 104 or equivalent."}, {"abbreviation": "JAPN 101", "name": "Japanese I", "info": "Beginning language skills.  Training in speaking and comprehending the basic sentence patterns of modern Japanese.  Introduction to reading and writing."}, {"abbreviation": "JAPN 103", "name": "Japanese II", "info": "Continued training in the four language skills.  Review of basic and introduction to complex sentence patterns. Reading of texts in basic Japanese. Prerequisite: JAPN 102 or the equivalent."}, {"abbreviation": "JAPN 201", "name": "Japanese III", "info": "Application of the four language skills.  Reading of texts written in standard Japanese and exercises in content-controlled conversation. Prerequisite: JAPN 104 or equivalent."}, {"abbreviation": "JAPN 203", "name": "Japanese IV", "info": "Continued application of the four language skills.  Reading and guided discussion of texts related to a variety of topics. Prerequisite: JAPN 202 or the equivalent."}, {"abbreviation": "JAPN 319", "name": "Independent Studies in Japanese", "info": "Independent projects conducted in Japanese in the student's area of special interest.  Prerequisite: permission of the instructor."}, {"abbreviation": "LAMS 150", "name": "Latin America: An Introduction", "info": "Introduction to the history, cultures, and societies of Latin America."}, {"abbreviation": "LAMS 202", "name": "Ecopolitics in Latin America", "info": "This course examines climate policy debates and recent shifts in global environmentalism, with a focus on a wide range of Latin American territories. Crosslisted as ENST 209 and ANTH 202."}, {"abbreviation": "LAMS 250", "name": "Latin America: Challenges for the 21st Century", "info": "Perspectives on the challenges facing Latin American peoples and nations in the 21st century. Crosslisted as ANTH 248."}, {"abbreviation": "LAMS 252", "name": "Ritual, Resistance, and Rebellion in South America", "info": "The cultural and social groups inhabiting the South American west coast in historical context; implications for anthropological and social issues concerning Third World societies. Prerequisite: permission of the instructor. Crosslisted as ANTH 352."}, {"abbreviation": "LAMS 273", "name": "Latin American Economic Development", "info": "The course deals with historic and contemporary economic problems, starting from colonial times and reaching the present integration into world economy. Crosslisted as ECON 273."}, {"abbreviation": "LATN 101", "name": "Introductory Latin", "info": "Introduction to the language.  Emphasis upon forms and grammar, and rapid development of facility in reading."}, {"abbreviation": "LATN 151", "name": "Intermediate Latin", "info": "Review of the grammar necessary for the introductory reading of selected Roman authors.  Authors may include Plautus, Cicero, Catullus, and Vergil. Prerequisite: LATN 102 or equivalent."}, {"abbreviation": "LATN 221", "name": "Studies in Latin Literature", "info": "Advanced readings in Latin authors. Authors vary by semester; prose and poetry offered in alternate semesters. May be repeated as topic varies. Prerequisite: LATN 151 or equivalent."}, {"abbreviation": "LING 105", "name": "Linguistic Analysis: Sounds and Words", "info": "One semester of a two-semester introduction to linguistics. Topics include: phonetics, phonology, word forms, language change, language acquisition."}, {"abbreviation": "LING 215", "name": "Syntax", "info": "Contemporary generative theories of phrase structure and its relation to meaning. Focus on comparative syntax and its implications for Universal Grammar. Prerequisite: LING 110 or permission of the instructor."}, {"abbreviation": "LING 220", "name": "Bilingualism", "info": "An examination of the psychological and social factors involved in the acquisition and use of two or more languages across the lifespan. Topics will also include language contact and bilingual education."}, {"abbreviation": "LING 237", "name": "Introduction to Language Development", "info": "Survey of the mechanisms involved in language development. Topics include the stages in language development, theoretical approaches to language development, the biological bases of language, and atypical language development. Prerequisite: PSYC 100, or LING 105, or LING 110, or LING 230. Crosslisted as PSYC 237."}, {"abbreviation": "LING 319", "name": "Undergraduate Research", "info": "Research in psycholinguistics. Research topics may be posed by students or faculty. Prerequisite: LING 230 and permission of the instructor."}, {"abbreviation": "MATH 117", "name": "Introduction to Mathematical Thought", "info": "An investigation of number, numeration, and operations from the perspective of elementary school teachers and pupils. Open only to B.S. in Education Early Childhood students. Required fieldwork."}, {"abbreviation": "MATH 192", "name": "Topics in Calculus", "info": "Elementary calculus and applications taken primarily from economics.  Topics include algebraic, exponential, and logarithmic functions, graphs, limits, regular and partial derivatives, constrained optimization, and integration. Not open to students who have MATH 201 credit."}, {"abbreviation": "MATH 201", "name": "Calculus I", "info": "An introduction to the calculus of algebraic, trigonometric and transcendental functions. Interpretation, significance and calculations of a derivative. Applications to geometry, biology, physics, economics, and other subjects. Introduction to the integral, including the Fundamental Theorem of Calculus and substitution. Not open to students who have MATH 192 credit."}, {"abbreviation": "MATH 202", "name": "Calculus II", "info": "Methods of integration including integration by parts, numerical approximations, and improper integrals. Sequences, series, including Taylor series. Complex numbers, polar coordinates, parametric functions, differential equations, and applications. Prerequisite: MATH 201."}, {"abbreviation": "MATH 208", "name": "Mathematical Explorations", "info": "An exploration of topics from pure mathematics, applied mathematics and statistics, illustrating the power and beauty of mathematical reasoning. For students considering a major in mathematics.  Corequisites: MATH 201 or MATH 202 or MATH 211 or MATH 212 or MATH 216. Open to first-year students only."}, {"abbreviation": "MATH 211", "name": "Calculus III", "info": "Calculus of vector-valued functions and functions of several variables. Multiple, line, and surface integrals; applications, and extrema. Green's, Stokes' and Divergence Theorems. Prerequisite: MATH 202."}, {"abbreviation": "MATH 212", "name": "Differential Equations", "info": "Basic methods of solving ordinary differential equations. Systems of linear differential equations, Laplace transform, applications and selected topics. Prerequisite: MATH 211. Not open to students who have taken MATH 222."}, {"abbreviation": "MATH 216", "name": "Statistics I", "info": "Exploratory data analysis, sampling and experimental designs, sampling distributions and confidence intervals, hypothesis testing, least squares regression, ANOVA, applications. Statistical software is used and a semester long project with real data is undertaken. Not open to students who have MATH 226 or PSYC 215 credit."}, {"abbreviation": "MATH 226", "name": "Probability and Statistics for Engineers", "info": "Exploratory data analysis, probability theory, discrete and continuous random variables, point estimation, sampling distributions and methods of statistical inference. Statistical software is used. Prerequisite: MATH 202. Open only to engineering students and students in computer science. Not open to students who have MATH 216 credit."}, {"abbreviation": "MATH 245", "name": "Linear Algebra", "info": "Linear equations, matrices, vector spaces, linear transformations, eigenvalues, inner products, Gram-Schmidt algorithm, singular value decomposition. Prerequisite: MATH 202."}, {"abbreviation": "MATH 280", "name": "Logic, Sets, and Proofs", "info": "Logic, sets; proof techniques; relations, functions, sequences and convergence; cardinality. Skills and tools for independent reading, problem solving and exploration. Prerequisite: MATH 211 or MATH 245."}, {"abbreviation": "MATH 291", "name": "Undergraduate Readings", "info": "Readings and research in special topics at an intermediate level. Prerequisites: permission of the instructor, adviser, and department chair."}, {"abbreviation": "MATH 303", "name": "Probability", "info": "Elementary probability, random variables, moments, central limit theorem, conditional expectation, statistical distributions derived from the normal distribution. Probability simulations and applications from various fields. Prerequisite: MATH 211. Crosslisted as MATH 603."}, {"abbreviation": "MATH 304", "name": "Statistical Inference Theory", "info": "Point and interval estimation, Fisher's likelihood theory, hypothesis testing, frequentist versus Bayesian inference, nonparametric statistics, simulation techniques. Prerequisites: MATH 216 or MATH 226, and MATH 303, or permission of the instructor. Crosslisted as MATH 604."}, {"abbreviation": "MATH 308", "name": "Real Analysis I", "info": "Real numbers and elementary topology of Cartesian spaces, convergence, continuity, differentiation, and history of the development of analysis. Prerequisites: MATH 211, MATH 245, and MATH 280."}, {"abbreviation": "MATH 320", "name": "Abstract Algebra I", "info": "Groups and rings; homomorphisms and isomorphism theorems; history of the development of algebra. Additional selected topics. Prerequisites: MATH 245 and MATH 280."}, {"abbreviation": "MATH 335", "name": "Geometry", "info": "Historical and axiomatic foundations of geometry. Euclidean and non-Euclidean geometries.  Prerequisite: MATH 280 or permission of the instructor. Crosslisted as MATH 635."}, {"abbreviation": "MATH 343", "name": "Numerical Analysis", "info": "Floating point arithmetic, development of computational algorithms and error estimates for root approximation, interpolation and approximation by polynomials, numerical differentiation and integration, cubic splines, least-squares, linear systems. Lab component. Prerequisites: MATH 211,  CSCI 203, and one  of MATH 241, MATH 245, or MATH 280; or permission of the instructor. Crosslisted as MATH 643."}, {"abbreviation": "MATH 345", "name": "Advanced Linear Algebra", "info": "Systems of linear equations, vector spaces, canonical forms for linear transformations and matrices, bilinear forms, inner product spaces, applications to such other areas as geometry, differential equations, linear programming. Prerequisites: MATH 245 and either MATH 280 or permission of the instructor. Crosslisted as MATH 645."}, {"abbreviation": "MATH 391", "name": "Reading and Research", "info": "Reading and research in various topics for qualified undergraduate students. Prerequisite: permission of the instructor."}, {"abbreviation": "MATH 405", "name": "Statistical Modeling", "info": "Regression, analysis of covariance, and logistic regression. Model diagnosis and remediation. Model selection, multicollinearity. R or SAS will be used. Prerequisites: MATH 245 and MATH 304. Crosslisted as MATH 605."}, {"abbreviation": "MATH 409", "name": "Real Analysis II", "info": "Continuation of MATH 308. Integration theory and advanced topics in analysis. Prerequisite: MATH 308. Crosslisted as MATH 609."}, {"abbreviation": "MATH 604", "name": "Statistical Inference Theory", "info": "Continuation of MATH 303/603. The two courses together constitute an introduction to mathematical statistics. Point and interval estimation, hypothesis testing, theory of least squares and its relation to the design and analysis of experiments. Prerequisite: MATH 303 or MATH 603. Crosslisted as MATH 304."}, {"abbreviation": "MATH 605", "name": "Statistical Modeling", "info": "Regression and analysis of (co)variance. Model diagnosis and remediation. Generalized linear models and nonlinear regression. Multicollinearity and ridge regression. Use of advanced statistical software. Crosslisted as MATH 305."}, {"abbreviation": "MATH 609", "name": "Real Analysis II", "info": "Continuation of Real Analysis I. Integration theory and advanced topics in analysis. Prerequisite: permission of the instructor. Crosslisted as MATH 409."}, {"abbreviation": "MATH 635", "name": "Geometry", "info": "Historical and axiomatic foundations of geometry. Euclidean and non-Euclidean geometries. Crosslisted as MATH 335."}, {"abbreviation": "MATH 643", "name": "Numerical Analysis", "info": "Floating point arithmetic, development of computational algorithms and error estimates for root approximation, interpolation and approximation by polynomials, numerical differentiation and integration, cubic splines, least-squares, linear systems, lab component. Prerequisite: permission of the instructor. Crosslisted as MATH 343."}, {"abbreviation": "MATH 645", "name": "Advanced Linear Algebra", "info": "Systems of linear equations, vector spaces, canonical forms for linear transformations and matrices, bilinear forms, inner product spaces, applications to such other areas as geometry, differential equations, linear programming. Prerequisite: permission of the instructor. Crosslisted as MATH 345."}, {"abbreviation": "MECH 151", "name": "Machining for Manufacturing Technology", "info": "Develop an understanding of the processes needed to produce manufactured parts. Emphasis on hands-on machining and fabrication."}, {"abbreviation": "MECH 213", "name": "Thermodynamics I", "info": "Thermodynamic principles including properties of substances, the first and second laws of thermodynamics, efficiencies, power and refrigeration cycles. Prerequisites: MATH 201 and ENGR 214 or permission of the department. Not open to students who have taken ENGR 200 or CHEG 310."}, {"abbreviation": "MECH 222", "name": "Introduction to Mechanical Engineering Lab Practice", "info": "Sensors, measurement techniques for static and dynamic measurements, data processing, statistical data analysis, propagation of error, technical report preparation. Corequisite: ECEG 205 and MECH 222L or permission of the department. Prerequisites: MATH 202 and MECH 220."}, {"abbreviation": "MECH 252", "name": "Dynamics", "info": "Kinematic and kinetic analysis of rigid bodies in planar and/or three-dimensional motion. Absolute and relative analysis of displacements, velocities, and accelerations; force, energy, and momentum methods; analysis of mechanical vibrations; analytical and computer-simulated solution techniques. Prerequisites: MECH 220 and MATH 212."}, {"abbreviation": "MECH 285", "name": "Independent Study for Sophomores", "info": "Independent investigation under the direction of a faculty member for students who have completed their first year. Sophomore standing in mechanical engineering and permission of the instructor."}, {"abbreviation": "MECH 313", "name": "Fluid Dynamics", "info": "Fundamentals of fluid dynamics including integral and differential control volume analysis, conservation equations, dimensional analysis, incompressible inviscid flows, internal and external viscous flows. Prerequisites: MATH 212, MECH 213, MECH 222, or permission of the department. Not open to students who have taken ENGR 222 or ENGR 233."}, {"abbreviation": "MECH 355", "name": "Manufacturing Processes", "info": "Analytical and technological study of manufacturing processes including metal deformation, casting, and cutting. Introduction to numerical control and CAD/CAM. Laboratory fabrication project and field trips. Co-Requisite: MECH 355L. Prerequisites: ENGR 240 and MECH 202."}, {"abbreviation": "MECH 385", "name": "Independent Study for Juniors", "info": "Independent investigation under the direction of a faculty member for students who have completed two years of study. Junior standing in mechanical engineering and permission of the instructor."}, {"abbreviation": "MECH 401", "name": "Senior Design I", "info": "Student teams design systems to solve open-ended problems with consideration of broad perspectives through the use of the design process, modeling and analysis, resource management, and documentation. Co-Requisite: MECH 401C. Prerequisites: MECH 312 and MECH 392, or permission of the instructor."}, {"abbreviation": "MECH 403", "name": "Thermal Design", "info": "Design of thermal-fluid energy conversion systems; equipment selection; codes and standards; and economic analysis. Mini-design laboratories and group design project. Co-Requisites: MECH 403L Prerequisites: MECH 312"}, {"abbreviation": "MECH 405", "name": "System Dynamics", "info": "Modeling and analysis of dynamic systems consisting of mechanical, electrical, fluid, and thermal elements. Frequency response methods. Sampled data systems. Experimental system identification. Co-Requisites: MECH 405L Prerequisites: MATH 212, MECH 252 and ECEG 205"}, {"abbreviation": "MECH 470", "name": "Engineering Composite Materials", "info": "Fundamental composite mechanics, including micromechanics and laminated plate theory. Design and analysis of composite structures; composite manufacturing techniques; current research topics in composite area. Prerequisites: MECH 353 or permission of the instructor. Crosslisted as MECH 670."}, {"abbreviation": "MECH 485", "name": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course. Prerequisite: permission of the instructor. Crosslisted as MECH 685."}, {"abbreviation": "MECH 495", "name": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications. Crosslisted as CEEG 495 and CHEG 495 and MECH 495 and ENGR 695 and ECEG 495 and ECEG 695. Prerequisite: permission of the instructor."}, {"abbreviation": "MECH 670", "name": "Engineering Composite Material", "info": "Fundamental composite mechanics, including micromechanics and laminated plate theory. Design and analysis of composite structures; composite manufacturing techniques; current research topics in composite area. Prerequisite: MECH 353 or permission of the instructor. Crosslisted as MECH 470."}, {"abbreviation": "MECH 685", "name": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course. Prerequisite: permission of the instructor. Crosslisted as MECH 485."}, {"abbreviation": "MECH 697", "name": "Graduate Thesis Research", "info": "Thesis-related research in mechanical engineering. Prerequisite: permission of the instructor."}, {"abbreviation": "MGMT 100", "name": "Exploring Management", "info": "Explores areas of inquiry and disciplines that are pervasive in understanding the management of people and organizations. Prerequisite: first year students only or permission of the instructor."}, {"abbreviation": "MGMT 101", "name": "Introduction to Organization and Management", "info": "Each section of 28 students learns management theories, concepts, and models, putting them into practice by designing and managing their own multi-divisional hybrid organizations that conduct major service projects funded by selling business products they created. Storytelling and writing are key pedagogies. Not open to first semester first-year students."}, {"abbreviation": "MGMT 102", "name": "Quantitative Reasoning for Managers", "info": "This course serves as a student's introduction to quantitative modeling and basic statistical analysis in a spreadsheet-based environment, especially as they apply to managerial decision making."}, {"abbreviation": "MGMT 104", "name": "Foundations of Accounting I", "info": "Introduction to accounting and financial management including financial statement preparation and analysis, financial forecasting, cost relationships, time value of money and capital budgeting. Not open to students who have taken MGMT 200."}, {"abbreviation": "MGMT 201", "name": "Marketing", "info": "Introduction to principles of marketing.  Examines how organizations facilitate exchange relationships by customers' needs and wants.  Explores the intricacies of identifying and establishing market positions and understanding consumer behavior.  Prerequisite: MGMT 101 or permission of the instructor."}, {"abbreviation": "MGMT 202", "name": "Operations", "info": "This course introduces students to the ways in which to model, analyze, and improve processes for producing services and goods. Prerequisite: MGMT 102. MATH 216 accepted with permission of the instructor."}, {"abbreviation": "MGMT 203", "name": "Managerial Finance", "info": "Financial analysis, forecasting, and valuation of projects and companies incorporating risk-return tradeoffs and capital structure and dividend decisions.  Employs 10-K research and presentations.  Prerequisite: MGMT 200. Intended ACFM majors must take ACFM 370 instead of MGMT 203."}, {"abbreviation": "MGMT 302", "name": "The Stakeholder Organization", "info": "Students explore the moral and ethical challenges associated with complex organizational decisions in a variety of contexts.  Prerequisite: MGMT 101. Juniors and seniors only."}, {"abbreviation": "MGMT 303", "name": "The Technological Organization", "info": "Organizations solve a variety of problems by deploying information systems.  This course explores a range of technological impacts on organizations from their behavior to survival."}, {"abbreviation": "MGMT 304", "name": "The Strategic Organization", "info": "Students learn strategic concepts and explore the challenges of formulating and implementing organizational strategies. Prerequisites: MGMT 101. Senior BSBA and MGEG sub-seniors, others by permission."}, {"abbreviation": "MGMT 310", "name": "Independent Study in Management", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"abbreviation": "MGMT 314", "name": "Topics in Management", "info": "Topic is specific to the semester offered. Course description will be provided prior to registration. Prerequisites, if any, will be established by instructor each semester."}, {"abbreviation": "MGMT 334", "name": "Team Leadership", "info": "Students will learn essential theories and concepts for analyzing, understanding, and leading high performing teams. Through case studies, articles, textbooks, and real life scenarios, the course will focus on strategies to build, organize, and structure teams to create successful team dynamics and cohesion."}, {"abbreviation": "MIDE 220", "name": "Building an Innovative Character", "info": "This course will introduce students to some of the habits, skills, and knowledge that make up an innovative character. In particular, students will practice their powers of observation, develop creative confidence, embrace ambiguity, fail forward, and develop a deeper sense of empathy. Taught by interdisciplinary teams of faculty across colleges."}, {"abbreviation": "MIDE 300", "name": "Markets, Innovation, and Design", "info": "A survey of the relationships among marketing, innovation, and design. Students will practice various approaches to creative and innovative thinking. Prerequisite: MGMT 201 or permission of the instructor."}, {"abbreviation": "MIDE 301", "name": "Understanding Consumers", "info": "A toolbox of research methods for understanding consumer behavior with appropriate exposure to philosophical and theoretical underpinnings of various approaches. Prerequisite: MGMT 201 or permission of instructor."}, {"abbreviation": "MIDE 302", "name": "Design Realization", "info": "Implementation of creative techniques for exploring ideas and transforming ideas into appropriate mediums for communication. Includes creative ideation, sketching, digital and physical modeling. Prerequisites: MGMT 201 and MIDE 300."}, {"abbreviation": "MIDE 304", "name": "Marketing Management", "info": "Integrating learned knowledge, students practice making marketing-related decisions through case analysis of various business scenarios. The predominant emphasis is on drawing together disciplinary experiences and providing a more coherent appreciation of the major's academic discipline. The educational goals of the class focus on critical, analytical, and synthetic thinking."}, {"abbreviation": "MIDE 315", "name": "Special Topics in Markets, Innovation, and Design", "info": "A seminar on selected topics in marketing, innovation, and design. Prerequisites: MGMT 201 and permission of the instructor."}, {"abbreviation": "MILS 101", "name": "Foundation of Officership", "info": "Focuses on developing comprehension of Army leadership dimensions, attributes and core leader competencies within the U.S. Army, and the Army's role in American society and government."}, {"abbreviation": "MILS 201", "name": "Individual Leadership Studies", "info": "Builds upon student development of the leadership attributes and core leader competencies through the understanding of Army organizational structures and its duty in American society."}, {"abbreviation": "MILS 301", "name": "Adaptive Team Leadership", "info": "Develops critical thinking skills through practical application of the fundamentals of Army leadership at the lowest organizational levels in the United States Army."}, {"abbreviation": "MILS 401", "name": "Developing Adaptive Leaders", "info": "Transitions the student learning from being trained to becoming a leader. Students study the U.S. Constitution and how it relates to their role as an Army officer."}, {"abbreviation": "MSUS 200", "name": "Managing for Sustainability I", "info": "This course explores how organizations manage toward social, environmental, and economic sustainability goals. Prerequisites: sophomores, juniors, or seniors only."}, {"abbreviation": "MSUS 310", "name": "Independent Study in Managing for Sustainability", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"abbreviation": "MSUS 315", "name": "Special Topics in Managing for Sustainability", "info": "A seminar on selected topics in managing for sustainability. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 114", "name": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 121", "name": "Introduction to Music Fundamentals", "info": "The study of the fundamentals of music, including standard notation, simple and compound meter, spelling triads, and simple harmonic progressions.  The skills in this course are required for MUSC 200. Does not fulfill the requirements for the music major or music minor."}, {"abbreviation": "MUSC 126", "name": "Introduction to Popular Music in the U.S.", "info": "A survey of principal style periods in American popular music from ca. 1840 to the present."}, {"abbreviation": "MUSC 135", "name": "Introduction to Music Teaching", "info": "This course provides  basic foundations in the discipline of music teaching, learning and pedagogy to students in music education, music performance, or BA in music majors. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 142", "name": "String Methods", "info": "Intended for music education majors. An introductory course in string instruments. Prerequisite: open to Bachelor of Music majors only."}, {"abbreviation": "MUSC 170", "name": "Piano Lessons", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 171", "name": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 172", "name": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 174", "name": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 175", "name": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 176", "name": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 178", "name": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 179", "name": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 181", "name": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 183", "name": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 185", "name": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 187", "name": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 188", "name": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 189", "name": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 191", "name": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 192", "name": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 193", "name": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 194", "name": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 196", "name": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 197", "name": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 198", "name": "Harp", "info": "Harp lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 199", "name": "Improvisation I", "info": "Studio lessons in improvisation. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 201", "name": "Chromatic Theory", "info": "Chromatic harmony, modulations, a study of basic classical and romantic forms.  Includes ear training, keyboard harmony, and sight singing. Prerequisite: MUSC 200."}, {"abbreviation": "MUSC 214", "name": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 235", "name": "Principles of Teaching Music", "info": "In this course, music education majors develop knowledge and skills necessary for successful K-12 music teaching including curricular design, philosophical foundations, assessment strategies, and various methodologies. Prerequisite: MUSC 135."}, {"abbreviation": "MUSC 252", "name": "Music and Culture: Chant to Beethoven", "info": "A survey of western European art music from Gregorian chant to Beethoven."}, {"abbreviation": "MUSC 259", "name": "Conducting I", "info": "Standard beat patterns, basic conducting problems, analysis of instrumental and choral scores. Prerequisite: MUSC 200."}, {"abbreviation": "MUSC 260", "name": "Ensemble", "info": "Non music majors may receive 1/4 credit per ensemble (maximum of 1/2 credit per semester, limit of two full-course credits in all). Music majors audit ensembles. Audition or permission of the instructor required for first-time members. 01-Symphonic Band, 02-Orchestra, 03-University Choir, 04-Camerata, 05-Opera Theatre, 06-Handbells, 07-Jazz Band, 08-Gamelan."}, {"abbreviation": "MUSC 270", "name": "Piano", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 271", "name": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 272", "name": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 274", "name": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 275", "name": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 276", "name": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 278", "name": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 279", "name": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 281", "name": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 283", "name": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 285", "name": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 287", "name": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 288", "name": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 289", "name": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 291", "name": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 292", "name": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 293", "name": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 294", "name": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 296", "name": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 297", "name": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 298", "name": "Harp", "info": "Harp lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 299", "name": "Improvisation II", "info": "Studio lessons in improvisation."}, {"abbreviation": "MUSC 300", "name": "Solo Vocal Literature & Language", "info": "Art Song Literature and Diction course that covers an introductory survey of representative vocal art song repertoire of Germany, France, Italy, the British Isles and the United States concurrent with learning the International Phonetic Alphabet and how to apply it to a variety of languages."}, {"abbreviation": "MUSC 314", "name": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 322", "name": "Music and Social Justice", "info": "This course explores music that has been created to advance the goals of social justice movements in various cultures and time periods. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 340", "name": "Performance Seminar I", "info": "Covers performance-related issues including collaboration, memorization, performance anxiety, wellness, and music cognition.  Students will be able to perform in master classes with visiting artists. Open to music majors; others by permission."}, {"abbreviation": "MUSC 350", "name": "Studies in Music", "info": "Special projects (typically independent studies) undertaken with the approval of a Music faculty member and the Department Chair."}, {"abbreviation": "MUSC 369", "name": "Conducting II", "info": "Advanced baton technique, rehearsal methods, and score analysis. Prerequisites: MUSC 259 or permission of the instructor."}, {"abbreviation": "MUSC 370", "name": "Piano", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 371", "name": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 372", "name": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 374", "name": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 375", "name": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 376", "name": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 378", "name": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 379", "name": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 381", "name": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 383", "name": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 385", "name": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 387", "name": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 388", "name": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 389", "name": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 391", "name": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 392", "name": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 393", "name": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 394", "name": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 396", "name": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 397", "name": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"abbreviation": "MUSC 399", "name": "Improvisation III", "info": "Studio lessons in improvisation."}, {"abbreviation": "MUSC 414", "name": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"abbreviation": "NEUR 248", "name": "Developmental Psychobiology", "info": "Addresses development in humans from conception through adolescence with some comparative analysis with non-humans. Emphasis on both normal and atypical cognitive, neuropsychological and neurobiological development. Prerequisite: PSYC 100 or NEUR 100. Crosslisted as PSYC 248."}, {"abbreviation": "NEUR 250", "name": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as PSYC 250."}, {"abbreviation": "NEUR 253", "name": "Cellular and Molecular Neurobiology", "info": "A course focused on the molecular and cellular mechanisms that drive the firing and wiring of neurons. Topics of emphasis include excitable membrane physiology, synaptic transmission, plasticity and learning, and sensory transduction. The required co-requisite laboratory component provides hands-on neurophysiology experience with live animal models. Prerequisite: BIOL 205. Crosslisted as BIOL 375."}, {"abbreviation": "NEUR 305", "name": "Developmental Psychopathology", "info": "Addresses the behavioral phenotypes of a variety of neurodevelopmental and neuropsychiatric disorders in the context of theories and processes of normal development. Genetic and neurobiological underpinnings of disorders are discussed. Prerequisites: NEUR 248 or PSYC 248 or permission of the instructor. Crosslisted as PSYC 305 and PSYC 605."}, {"abbreviation": "NEUR 319", "name": "Topics in Neuroscience", "info": "Occasional seminars on selected topics of current interest in neuroscience. Prerequisites: BIOL 205, BIOL 207 and NEUR 100, junior or senior status and permission of the instructor."}, {"abbreviation": "NEUR 360", "name": "Honors Thesis", "info": "Prerequisite: permission of the department and permission of the instructor."}, {"abbreviation": "NEUR 368", "name": "Social Neuroscience", "info": "Study of the brain basis of social behaviors such as bonding and attachment, parental behavior, play, social cognition, and the benefits of social support. We will investigate what is known about social function in the brains of species that have evolved to be social species, including humans. Crosslisted as PSYC 368 and PSYC 668."}, {"abbreviation": "NEUR 399", "name": "Undergraduate Research", "info": "Research on any aspect of neuroscience. Research topics may be posed by students or faculty. Prerequisite: permission of the instructor."}, {"abbreviation": "PHIL 100", "name": "Introduction to Philosophy", "info": "An introduction to the main topics, fields and figures of philosophy. Multiple sections of this course are offered every semester, under a variety of titles."}, {"abbreviation": "PHIL 103", "name": "Logic", "info": "An introduction to informal and formal ways of reasoning. The structures and general forms of argument as well as the standards and criteria needed to evaluate arguments, and the historical development of logical reasoning, will be studied."}, {"abbreviation": "PHIL 205", "name": "Greek Philosophy", "info": "Studies of the ancient Greek notions of kosmos, society, and soul, through readings of the Presocratics, Plato, and Aristotle. Some attention will also be paid to the mythic/poetic background from which philosophy arises for the ancient Greeks. Prerequisite: PHIL 100 or PHIL 103 or PHIL 201 or permission of instructor."}, {"abbreviation": "PHIL 233", "name": "The Philosophy of Peace and Nonviolence", "info": "A course in Peace Studies that will investigate the arguments and spirit of Pacifism and nonviolent philosophies. Crosslisted as UNIV 233."}, {"abbreviation": "PHIL 260", "name": "Phenomenology", "info": "Analysis of selected texts of Husserl, Heidegger, or Merleau-Ponty. Some consideration of the interpretation of the history of philosophy offered by phenomenology. Prerequisite: PHIL 100 or permission of the instructor."}, {"abbreviation": "PHIL 265", "name": "Contemporary Philosophy of Art", "info": "An investigation of and focused study of contemporary philosophical issues in the arts and aesthetics more generally. Prerequisite: PHIL 100, or ARTH 207 or ARTH 208. Crosslisted as ARTH 265."}, {"abbreviation": "PHIL 268", "name": "Topics in Metaphysics and/or Epistemology", "info": "Focused study of specific topics in metaphysics and/or epistemology, such as space and time, possible worlds, the mind-body problem, truth, skepticism, virtue epistemology, and norms of assertion. Prerequisite: PHIL 100 or permission of the instructor."}, {"abbreviation": "PHIL 276", "name": "Philosophy of Revolution", "info": "An exploration and analysis of the concept of revolution in political philosophy from modernity to the present day, examining ways that political philosophers have sought to make revolution unnecessary as well as how and why they have emphasized its necessity. Crosslisted as POLS 267."}, {"abbreviation": "PHIL 288", "name": "Topics in Philosophical ​Movements and Traditions", "info": "Focused study of specific topics in philosophical movements and/or traditions, such as specific topics in existentialism, feminist theory, philosophy of peace, and in Chinese, Medieval, Indian, or Islamic philosophy."}, {"abbreviation": "PHIL 311", "name": "Seminar in Philosophical Problems", "info": "A selected problem of philosophy as this occurs historically in the ancient, medieval, or modern periods, or in contemporary thought. In recent years: \"Philosophy of Mind,\" \"Environmental Aesthetics,\" \"Perception,\" \"Philosophical Heretics,\" \"Friendship,\" \"Doubt, Disagreement and Dogmatism.\" Prerequisites: two courses in philosophy and permission of the instructor."}, {"abbreviation": "PHIL 319", "name": "Individual Studies in Philosophy", "info": "Open to advanced students who wish to pursue individual programs of study under the supervision of a professor, or of a committee of professors if the subject falls within two or more departments. May be conducted as a seminar for three or more students pursuing similar programs."}, {"abbreviation": "PHIL 321", "name": "Honors Thesis", "info": "Substantial independent work on some problem or topic approved by the department of philosophy as honors work. Prerequisite: permission of the instructor."}, {"abbreviation": "PHIL 323", "name": "Senior Thesis", "info": "Independent research on a philosophical issue, in consultation with staff members. The thesis should show integrative and creative abilities. Prerequisite: major in philosophy or permission of the instructor."}, {"abbreviation": "PHYS 147", "name": "Energy and Sustainability", "info": "Examination of energy, its transformations, its effects on resource depletion, and environmental degradation. Models of sustainability for transportation, architecture, waste management, and personal lifestyle choices. Designed for non-science majors. No prerequisite. Not open to students who have successfully completed a 200-level physics course."}, {"abbreviation": "PHYS 211", "name": "Classical and Modern Physics I", "info": "The first course in a two-course sequence that surveys major areas of physics. Topics include Newtonian mechanics, relativity, thermodynamics and statistical mechanics, and gravity. Corequisite: MATH 201."}, {"abbreviation": "PHYS 221", "name": "Classical Mechanics", "info": "Newtonian mechanics including conservation laws, rotational dynamics, forced damped harmonic motion, and coupled oscillations. Prerequisites: PHYS 211 and MATH 202."}, {"abbreviation": "PHYS 317", "name": "Thermodynamics and Statistical Mechanics", "info": "The laws of thermodynamics, thermodynamic functions, kinetic theory of gases, statistical mechanics. Prerequisites: PHYS 212 (or PHYS 212E) and either PHYS 221 or PHYS 222, or permission of the instructor."}, {"abbreviation": "PHYS 331", "name": "Advanced Classical Mechanics", "info": "Kinematics and dynamics of particles, systems, and rigid bodies. Hamilton's principles, Lagrange's equations, theory of small vibrations, orbital mechanics, accelerated frames, and nonlinear dynamics. Prerequisites: PHYS 221 and MATH 212, or permission of the instructor."}, {"abbreviation": "PHYS 332", "name": "Quantum Mechanics", "info": "Basic postulates and applications, perturbation theory, angular momentum, scattering theory, relativistic effects. Prerequisites: PHYS 222 and MATH 211, or permission of the instructor."}, {"abbreviation": "PHYS 333", "name": "Electromagnetic Theory I", "info": "Classical electromagnetic theory, including scalar and vector potentials, electrostatics, magnetostatics, time-dependent fields, and culminating with Maxwell's equations. Prerequisites: PHYS 212 (or PHYS 212E) and MATH 211. Juniors and seniors only, except by permission."}, {"abbreviation": "PHYS 350", "name": "Undergraduate Research", "info": "Undergraduate research. Prerequisite: permission of the instructor."}, {"abbreviation": "POLS 140", "name": "American Politics", "info": "A critical examination of the principles, structures, and processes that shape American politics. An emphasis on political behavior and institutions with applications to contemporary political issues."}, {"abbreviation": "POLS 170", "name": "International Politics", "info": "Introduction to major dynamics of international politics; the international system, decision making, perceptions, cooperation, conflict, and policy instruments, such as diplomacy and war. Analysis is linked to specific international events and issues."}, {"abbreviation": "POLS 205", "name": "Comparative Politics", "info": "Politics and policy outside the United States; concepts for the comparison of political systems. Democracy, Third World politics, revolution, political stability and change, international effects on political processes."}, {"abbreviation": "POLS 210", "name": "Political Theory", "info": "Examination of the moral dimensions of politics. Authors include Plato, Aristotle, Milton, Hobbes, Locke, Rousseau, and Marx. Major concepts include justice, freedom, rights, and authority."}, {"abbreviation": "POLS 212", "name": "Politics of India/South Asia", "info": "This course provides an introduction to the major contemporary political issues and trends in the region of India/South Asia. Themes will include colonialism, nationalism, economic growth and development, democracy vs. authoritarianism, religious fundamentalism, and ethnic conflict."}, {"abbreviation": "POLS 219", "name": "Latin American Politics", "info": "The dynamics of politics in Latin American social, economic, and cultural context, with use of general comparative concepts of politics."}, {"abbreviation": "POLS 223", "name": "European Politics", "info": "Comparative analysis of institutions and policy-making in European political systems, including the European Union."}, {"abbreviation": "POLS 233", "name": "The Politics of College", "info": "A survey of higher education policy and campus politics in the United States. Ideas to be discussed include: national- and state-level education policy, college affordability and debt, student learning and the purposes of college education, new and non-traditional models of education, and controversies surrounding the political environment on college campuses."}, {"abbreviation": "POLS 258", "name": "States of Nature", "info": "Study of the conceptual connections between understandings of nature, society, and the good in historical and contemporary contexts."}, {"abbreviation": "POLS 261", "name": "Twentieth-century American Legal Thought", "info": "Analysis of dominant and critical trends through the century including legal realism, liberalism, law and morality, feminist legal theory, law and economics, and critical race theory."}, {"abbreviation": "POLS 267", "name": "Philosophy of Revolution", "info": "An exploration and analysis of the concept of revolution in political philosophy from modernity to the present day, examining ways that political philosophers have sought to make revolution unnecessary as well as how and why they have emphasized its necessity. Crosslisted as PHIL 276."}, {"abbreviation": "POLS 271", "name": "American Foreign Policy", "info": "Analysis of American foreign policy institutions and decision-making processes; examination of the history and of current issues and problems of U.S. foreign policy."}, {"abbreviation": "POLS 275", "name": "Global Governance", "info": "This course explores the rationales, processes, and institutions of multilateral governance in a globalized world. We examine the U.N. nongovernmental organizations, conflict resolution, economic development, environment, human rights, and international law. Not open to first-year students. Crosslisted as IREL 275."}, {"abbreviation": "POLS 276", "name": "Comparative Foreign Policy", "info": "This course has two over-arching objectives. Introduce students to the various ways foreign policy can be explained. The second objective is to acquaint students with the substantive foreign policies of specific international actors, notably the EU, Japan, India, Israel, United Kingdom, Brazil, China, and others. Crosslisted as IREL 276."}, {"abbreviation": "POLS 278", "name": "International Law", "info": "The nature, historical development, and sources of international law; substantive and procedural international law and its role in international relations. Crosslisted as IREL 255."}, {"abbreviation": "POLS 290", "name": "Topics in Politics", "info": "Attention will focus on specific thinkers, problems, concepts, or issues of recurring and continuing significance in political analysis. Topics will vary."}, {"abbreviation": "POLS 291", "name": "Environmental Policy and Politics", "info": "An introduction to understanding the role of political institutions, stakeholders, and policy processes (in the U.S. and internationally) in addressing environmental problems. Crosslisted as ENST 245."}, {"abbreviation": "POLS 292", "name": "Political Economy of Growth", "info": "We will study how institutions affect the immediate determinants of economic growth.  Topics include population growth, microfinance, democracy, geography, international trade, culture, and foreign aid."}, {"abbreviation": "POLS 297", "name": "Qualitative Methods", "info": "Introduction to various qualitative methods of inquiry and research design in Political Science, such as focus groups, case studies, interview techniques, interpretive approaches, and critical argumentation."}, {"abbreviation": "POLS 364", "name": "Justice and Public Policy", "info": "An examination of competing theories of justice and the application of these theories to various issues in public policy, such as taxation, welfare, health care, education, immigration, and foreign aid. Prerequisite: POLS 210 or permission of instructor."}, {"abbreviation": "POLS 371", "name": "Minority Politics", "info": "This course is designed to provide students with a comprehensive understanding of how minority groups operate within the U.S. political system."}, {"abbreviation": "POLS 381", "name": "Arab-Israeli Conflict, Peace Process", "info": "This course examines the failures/successes of the peace process among Israel, the Arab States, and the Palestinians.  Special focus is on Oslo peace process, outstanding issues, and the involvement of outside actors, particularly the role of the U.S. Prerequisite: POLS 170 or permission of instructor. Crosslisted as IREL 381."}, {"abbreviation": "PSYC 100", "name": "Introduction to Psychology", "info": "A survey of concepts, principles, and theories of an empirical science of behavior."}, {"abbreviation": "PSYC 204", "name": "Human Cognition", "info": "A survey of the theories and methods employed in studying human mental abilities. Issues include attention, memory, language, problem solving, and decision making. Prerequisite: NEUR 100 or PSYC 100 or permission of the instructor."}, {"abbreviation": "PSYC 209", "name": "Social Psychology", "info": "Theories of social influence and social interaction, their empirical foundations and implications for the individual and society. Prerequisite: PSYC 100 or permission of the instructor."}, {"abbreviation": "PSYC 213", "name": "Abnormal and Clinical Psychology", "info": "A critical introduction to psychological disorders, theories of their causes, and approaches to their treatments. Includes an observational practicum in a psychiatric facility. Prerequisite: PSYC 100 or permission of the instructor."}, {"abbreviation": "PSYC 215", "name": "Psychological Statistics", "info": "An introduction to basic statistical analyses in psychology. Prerequisite: PSYC 100, NEUR 100, or ANBE 266 or permission of the instructor."}, {"abbreviation": "PSYC 216", "name": "Research Methods in Psychology", "info": "An introduction to the methods used and issues faced by psychological researchers. Topics include ethics, study design (true-experimental, correlational, and quasi-experimental), data collection and analysis, and communication of empirical findings. A foundation for other research-based courses in Psychology. Prerequisites: PSYC 100 and PSYC 215 or MATH 216."}, {"abbreviation": "PSYC 228", "name": "Personality Psychology", "info": "Evaluation of theory and research on personality, including consideration of classic theories and their applications in current research. Prerequisite: PSYC 100 or permission of the instructor."}, {"abbreviation": "PSYC 229", "name": "Directed Study in Psycholoygy", "info": "An entry into psychological research or other independent study directed by a faculty member. Experiences might include library work, collecting data, entering and analyzing data, and other activities associated with engagement in research and in faculty-directed inquiry. Prerequisite: PSYC 100 and instructor permission."}, {"abbreviation": "PSYC 236", "name": "Drugs and Behavior", "info": "How drugs of abuse work in the brain and how they affect behavior. Theories of addiction and addiction treatment, and issues of how drug use impacts individuals, families, and societies will be discussed. Prerequisite: PSYC 100."}, {"abbreviation": "PSYC 237", "name": "Introduction to Language Development", "info": "Survey of the mechanisms involved in language development. Topics include the stages in language development, theoretical approaches to language development, the biological bases of language, and atypical language development. Prerequisite: PSYC 100, or LING 105, or LING 110, or LING 230. Crosslisted as LING 237."}, {"abbreviation": "PSYC 250", "name": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as NEUR 250."}, {"abbreviation": "PSYC 266", "name": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior, emphasizing both proximate and ultimate explanations for behavior. Crosslisted as ANBE 266 and BIOL 266."}, {"abbreviation": "PSYC 290", "name": "Research Methods in Biopsychology", "info": "Laboratory research to accompany PSYC 250 Biopsychology. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or PSYC 296 or ANBE 296, and prerequisite or corequisite PSYC 250."}, {"abbreviation": "PSYC 293", "name": "Research Methods in Learning", "info": "Laboratory and/or field research to accompany PSYC 203 Learning. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or PSYC/ANBE 296, and prerequisite or corequisite PSYC 203."}, {"abbreviation": "PSYC 296", "name": "Research Methods in Animal Behavior", "info": "Laboratory and/or field research to accompany ANBE 266, BIOL 266, or PSYC 266. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or BIOL 205 and prerequisite or corequisite ANBE 266, BIOL 266, or PSYC 266. Crosslisted as ANBE 296."}, {"abbreviation": "PSYC 298", "name": "Research Methods in Personality", "info": "Laboratory, field, or applied research to accompany PSYC 228 Personality Psychology. Prerequisites: PSYC 100 and PSYC 215 or MATH 216."}, {"abbreviation": "PSYC 305", "name": "Developmental Psychopathology", "info": "Addresses the behavioral phenotypes of a variety of neurodevelopmental and neuropsychiatric disorders in the context of theories and processes of normal development. Genetic and neurobiological underpinnings of disorders are discussed. Prerequisites: NEUR 248 or PSYC 248 or permission of the instructor. Crosslisted as NEUR 305 and PSYC 605."}, {"abbreviation": "PSYC 319", "name": "Topics in Psychology", "info": "Occasional seminars on selected topics of current interest in psychology. Prerequisite: permission of the instructor. Crosslisted as PSYC 619."}, {"abbreviation": "PSYC 325", "name": "Personality, Psychopaths, and Serial Killers", "info": "Considers personality disorders with a focus on psychopathy and serial murders. Biological and environmental causes of psychopathy are considered as well as the developmental course of the condition and ethics of treatment. Prerequisites: PSYC 228 or PSYC 209 or PSYC 210 or permission of the instructor. Crosslisted as PSYC 625."}, {"abbreviation": "PSYC 329", "name": "Undergraduate Research", "info": "Research or other independent study on any aspect of psychology. Research topics may be posed by students or faculty. Prerequisite: permission of the instructor."}, {"abbreviation": "PSYC 339", "name": "Psychology of Music", "info": "Seminar examining how musicians and non-musicians comprehend, remember, perform, and respond to music, including developmental aspects. Some background in music required.  Prerequisites: PSYC 204 or PSYC 252 and permission of the instructor. Crosslisted as PSYC 639."}, {"abbreviation": "PSYC 350", "name": "Culminating Research Experience+", "info": "This seminar, worth 1 credit, turns a research project into a Culminating Experience. Covers research, ethics, proposal writing, public speaking, data presentation, and other professional issues. Course meets only 1 hour a week most weeks. Students should not register for PSYC 329 or PSYC 360. Prerequisite: permission of the instructor."}, {"abbreviation": "PSYC 360", "name": "Honors Thesis", "info": "Prerequisites: permission of the department and permission of the instructor."}, {"abbreviation": "PSYC 368", "name": "Social Neuroscience", "info": "Study of the brain basis of social behaviors such as bonding and attachment, parental behavior, play, social cognition, and the benefits of social support. We will investigate what is known about social function in the brains of species that have evolved to be social species, including humans. Crosslisted as NEUR 368 and PSYC 668."}, {"abbreviation": "PSYC 369", "name": "Psychology of Beauty and Attraction", "info": "Examination of research on beauty and attraction from an evolutionary perspective. Prerequisites: PSYC 209, a Cluster C course and permission of the instructor. Crosslisted as PSYC 669."}, {"abbreviation": "PSYC 370", "name": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor.  Crosslisted as ANBE 370 and ANBE 670 and BIOL 370 and BIOL 670 and PSYC 670."}, {"abbreviation": "PSYC 372", "name": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition.  Prerequisites: PSYC 266, ANBE 266, and permission of the instructor. Crosslisted as PSYC 672 and ANBE 372 and ANBE 672."}, {"abbreviation": "PSYC 605", "name": "Developmental Psychopathology", "info": "Addresses the behavioral phenotypes of a variety of neurodevelopmental and neuropsychiatric disorders in the context of theories and processes of normal development. Genetic and neurobiological underpinnings of disorders are discussed. Prerequisite: permission of the instructor. Crosslisted as PSYC 305 and NEUR 305."}, {"abbreviation": "PSYC 619", "name": "Topics in Psychology", "info": "Occasional seminars on selected topics of current interest in psychology. Prerequisite: permission of the instructor. Crosslisted as PSYC 319."}, {"abbreviation": "PSYC 625", "name": "Personality, Psychopaths, and Serial Killers", "info": "Considers personality disorders with a focus on psychopathy and serial murderers. Biological and environmental causes of psychopathy are considered as well as the developmental course of the condition and the ethics of treatment. Prerequisite: permission of the instructor. Crosslisted as PSYC 325."}, {"abbreviation": "PSYC 639", "name": "Psychology of Music", "info": "Seminar examining how musicians and non-musicians comprehend, remember, perform, and respond to music, including developmental aspects. Some background in music required. Prerequisite: permission of the instructor. Crosslisted as PSYC 339."}, {"abbreviation": "PSYC 668", "name": "Social Neuroscience", "info": "Study of the brain basis of social behaviors such as bonding and attachment, parental behavior, play, social cognition, and the benefits of social support. We will investigate what is known about social function in the brains of species that have evolved to be social species, including humans. Crosslisted as NEUR 368 and PSYC 368."}, {"abbreviation": "PSYC 669", "name": "Psychology-Beauty/ Attraction", "info": "Examination of research on beauty and attraction from a evolutionary perspective. Prerequisite: permission of the instructor. Crosslisted as PSYC 369."}, {"abbreviation": "PSYC 670", "name": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 370 and BIOL 670 and PSYC 370."}, {"abbreviation": "PSYC 672", "name": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition.  Prerequisite: permission of the instructor. Crosslisted as PSYC 372 and ANBE 372 and ANBE 672."}, {"abbreviation": "PSYC 685", "name": "Graduate Research", "info": "Graduate research. Prerequisite: permission of the instructor."}, {"abbreviation": "RELI 100", "name": "Introduction to Religion", "info": "This course will introduce students to the academic study of religion to provide a foundation for religious literacy.  Multiple sections of this course are offered every semester, under a variety of titles."}, {"abbreviation": "RELI 200", "name": "Buddhism", "info": "An interdisciplinary introduction to Buddhism, including basic teachings of liberation from suffering, impermanence, no-self, ethics, and meditation. Also explores the historical development of various streams of Buddhism in Asia and the West, with attention to the mutual influence between Buddhism and society, politics, and material culture. Crosslisted as EAST 251."}, {"abbreviation": "RELI 201", "name": "Islam", "info": "An overview of the many cultural expressions of Islam, which emerged in the 6th century and spread from Arabia to the larger world. The course will cover Muhammad as prophet, Qur'an as scripture, Hadith as religious narrative, and tensions between law, modernity, and mysticism."}, {"abbreviation": "RELI 202", "name": "Hinduism", "info": "A historical survey of Hindu religious traditions. This course traces the development of Hindu scriptures, rituals, philosophies, and ethics from the ancient to the contemporary world. Concepts such as karma, yoga, and reincarnation will be put in the broader contexts of Hindu dharma (religious law), theism, and ritual."}, {"abbreviation": "RELI 234", "name": "Issues of Religion and Culture", "info": "Focus on interdependence of religion and cultural phenomena: ideology; alienation; formation of world view; understandings of time and space; relation between church and state; faith and science."}, {"abbreviation": "RELI 244", "name": "Ghosts, Gods, & Immortals: The Taoist Religion in China", "info": "To live as long as heaven and earth; to make the body indestructible; to master the transformations of the cosmos; to control legions of demons and deities. These are the aims of the Chinese religion known as Taoism. This course examines Taoist beliefs and practices from ancient to modern times. Crosslisted as EAST 244."}, {"abbreviation": "RELI 281", "name": "Religion and American Politics", "info": "This course explores the historical relationship of religion and American politics, focusing on the impact of religion in both domestic and foreign policy."}, {"abbreviation": "RELI 321", "name": "Introduction to Jewish Law", "info": "Jewish law:  function, ethical and philosophical principles. Major sources: Bible, Rabbinics, Interpretations (Commentaries & Codifications), science. Applications to contemporary legal issues. Prerequisite: sophomore, junior, or senior only. Open to others by permission of the instructor."}, {"abbreviation": "RESC 098", "name": "Foundation Seminar in Residential Colleges", "info": "Foundation seminar offered only through the individual Residential Colleges. Prerequisite: permission of the instructor."}, {"abbreviation": "RESC 220", "name": "Residential College Sophomore Program", "info": "Students will build on capacities achieved during the first year by constructing and then engaging in a set of learning experiences in a group."}, {"abbreviation": "RUSS 101", "name": "Elementary Russian I", "info": "Fundamentals of speaking, reading, writing, and comprehending Russian, and an introduction to Russian culture."}, {"abbreviation": "RUSS 103", "name": "Intermediate Russian I", "info": "Continued focus on all language skills combined with the study of cultural texts. Prerequisite: RUSS 101A or RUSS 102 or equivalent for RUSS 103; RUSS 103 is the prerequisite for RUSS 104."}, {"abbreviation": "RUSS 125", "name": "Topics in Russian Culture", "info": "An examination of everyday life in Russia, as a mirror of historical, ideological, sociological, and economic forces. In English."}, {"abbreviation": "RUSS 201", "name": "Advanced Russian I", "info": "Advanced topics of Russian grammar; review of intermediate grammar. Advanced reading, composition, and conversation. In Russian. Prerequisite: RUSS 104 or equivalent."}, {"abbreviation": "RUSS 204", "name": "Russian Conversation", "info": "Concentrated development of speaking skill. Conducted entirely in Russian by a native speaker. Intended for students enrolled in 200- and 300-level courses. This course cannot be taken more than twice."}, {"abbreviation": "RUSS 209", "name": "Russian Complementary Reading", "info": "Russian sources read in conjunction with English language courses. Independent course of study established by instructor and student. Prerequisite: the equivalent of four semesters of Russian. This course cannot be taken more than twice."}, {"abbreviation": "RUSS 390", "name": "Independent Study", "info": "Advanced independent research under the supervision of an instructor. Subject to be selected by student in consultation with the instructor. Prerequisite: permission of the instructor."}, {"abbreviation": "SIGN 101", "name": "Elementary American Sign Language I", "info": "An introduction to American Sign Language. Training and practice in signing together with approaches to communicating with deaf people."}, {"abbreviation": "SOCI 100", "name": "Introduction to Sociology", "info": "The concepts and methods sociologists use to investigate human groups. Focuses on the study of social organization, its variety and development."}, {"abbreviation": "SOCI 201", "name": "Field Research in Local Communities", "info": "Participant-observation, interviewing, and other field research methods. Students will devise and conduct their own ethnographic research projects in a local community. Crosslisted as ANTH 201."}, {"abbreviation": "SOCI 209", "name": "Analyzing the Social World", "info": "A course in sociological data analysis, using the General Social Survey and other data sets, promoting student research."}, {"abbreviation": "SOCI 210", "name": "Urban Condition", "info": "Geographic and sociological inquiry into pressing urban issues of advanced industrialized societies, including inequality, housing, employment and how cities fit into the American present and future. Crosslisted as GEOG 210."}, {"abbreviation": "SOCI 211", "name": "Classical Sociological Theory", "info": "A survey of major theories and theoretical traditions in sociology from roughly 1850 to 1920. The work of Karl Marx, Emile Durkheim, and Max Weber is often the centerpiece of the course."}, {"abbreviation": "SOCI 218", "name": "Health and Community", "info": "Explores how community, family, and experiences with health institutions shape and affect well being, physical problems, and health. Crosslisted as UNIV 218."}, {"abbreviation": "SOCI 225", "name": "Organizations in Society", "info": "This class will cover topics in organizational sociology including basic organization theory. Topics to be considered may include corporate social responsibility, sector, organizational networks, markets and organizations and work/occupations."}, {"abbreviation": "SOCI 234", "name": "Criminology", "info": "Theories and research in criminal behavior and the societal reaction to criminality. Causes and consequences of crime, including public policy formulations."}, {"abbreviation": "SOCI 245", "name": "Remaking America: Latin American Immigration", "info": "The processes and impacts of Latin American immigration on the U.S. and countries of origin. Special emphasis on how the immigration experience varies by ethnicity, location, and gender. Crosslisted as LAMS 245."}, {"abbreviation": "SOCI 265", "name": "Culture and Politics of the 1960s", "info": "This is a course on cultural and social movements (civil rights movement, New Left, student movement, anti-Vietnam War movement, counterculture), the change they produced in the U.S., and the consequences of that change for contemporary American society."}, {"abbreviation": "SOCI 309", "name": "How Holocausts Happen", "info": "A comparative-historical analysis of genocide, politicide, and the Holocaust, from premodern colonial regimes through Darfur, examining social, psychological, political and economic determinants. Prerequisite: seniors only; juniors by permission of the instructor."}, {"abbreviation": "SOCI 341", "name": "Seminar in Law and Society", "info": "Structure and process of legal institutions: police, courts, prisons, lawyers, juries, and extralegal mechanisms relevant to the legal system."}, {"abbreviation": "SPAN 101", "name": "Elementary Spanish I", "info": "Beginning language skills, with practice of points of grammar, through listening, speaking, reading and writing, in the context of Hispanic cultures. SPAN 101 is prerequisite to SPAN 102."}, {"abbreviation": "SPAN 103", "name": "Toward Intermediate Spanish", "info": "Through grammar review and the development of new linguistic skills, in the context of Hispanic cultures, students reach intermediate competency in Spanish. Prerequisite: SPAN 102 or three years of secondary school Spanish."}, {"abbreviation": "SPAN 105", "name": "Intermediate Spanish", "info": "Review of grammar and development of new linguistic skills and cultural competency to reach high-intermediate level in Spanish. Prerequisite: SPAN 103 or four years of secondary school Spanish."}, {"abbreviation": "SPAN 207", "name": "Toward Advanced Spanish", "info": "Students demonstrating high-intermediate skills progress toward advanced language proficiency. Reading, discussion and writing about brief literary or cultural texts advances cultural competency. Prerequisite: SPAN 105 or five years of secondary school Spanish."}, {"abbreviation": "SPAN 208", "name": "Advanced Conversation and Composition", "info": "Advanced study and practice to enhance oral and written proficiency. A variety of texts and media, including literature, film and internet sources provide a point of departure for class discussion and written assignments. Prerequisite: SPAN 207 or six years of Spanish."}, {"abbreviation": "SPAN 220", "name": "Introduction to Spanish Literature", "info": "Introduction to Spanish literature across major artistic and cultural periods: Middle Ages, Renaissance, Golden Age, Romanticism, Realism, and 20th-century literature in its cultural context."}, {"abbreviation": "SPAN 222", "name": "Introduction to Latin American Literature", "info": "Introduction to the authors, topics and genres that constitute the literary tradition of Latin America. Literary works are studied in their historical and cultural context."}, {"abbreviation": "SPAN 245", "name": "Topics in Spain", "info": "Guides students in their experience of life and culture in Spain, and fosters their reflection on the cross-cultural learning experience. Prerequisite: SPAN 207 or equivalent. Only given in the Bucknell en Espana program."}, {"abbreviation": "SPAN 270", "name": "Spanish Cultural Tradition", "info": "An introduction to the cultural tradition of Spain through the study of art, history, literature, and film. Prerequisite: SPAN 208."}, {"abbreviation": "SPAN 280", "name": "Latin American Cultural Traditions", "info": "An introduction to the cultural traditions of Latin America through the study of art, history, literature, and film. Prerequisite: SPAN 208."}, {"abbreviation": "SPAN 362", "name": "Topics in Hispanic Literature", "info": "These courses will deal with topics in Spanish or Latin American literature on an advanced level. Prerequisites: two 200-level courses beyond SPAN 208."}, {"abbreviation": "SPAN 364", "name": "Topics in Spanish Civilization", "info": "This course will deal with different topics in the civilization of Spain on an advanced level. In Spanish. Prerequisites: two 200-level courses beyond SPAN 208."}, {"abbreviation": "SPAN 365", "name": "Topics in Latin American Civilization", "info": "This course will deal with different topics in the civilization of Latin America on an advanced level. In Spanish. Prerequisites: two 200-level courses beyond SPAN 208."}, {"abbreviation": "THEA 101", "name": "Technical Theatre Practicum", "info": "Quarter-course credit for supervised participation in any one of several aspects of theatrical production of the Department of Theatre and Dance's major productions. Prerequisite: permission of the instructor."}, {"abbreviation": "THEA 102", "name": "Theatrical Rehearsal and Performance", "info": "Quarter-course credit for substantial participation in a major theatrical production; for example, as actor, stage manager, vocal coach, choreographer. Prerequisite: permission of the instructor."}, {"abbreviation": "THEA 145", "name": "Bucknell Backstage", "info": "Bucknell Backstage is an introductory course where craft, art and engineering intersect. Subject areas include Stage Management, Lighting, Sound, Properties, Painting, Stagecraft, Rigging and Wardrobe. Preference given to Theatre Majors. Prerequisite: permission of the instructor."}, {"abbreviation": "THEA 202", "name": "Dramatic Literature: Script Analysis", "info": "An introduction to the various methods of play analysis utilized by actors, directors, designers, dramaturgs, and other theatre artists. Special attention is given to the play as a blueprint for theatrical production and the playwright's use of dramatic structure, action, subtext, and symbolism. Writing Intensive (W2)."}, {"abbreviation": "THEA 240", "name": "Directing the Play", "info": "The critical and creative responsibilities of the director; the principles of directing and their application. Prerequisite: THEA 110 or THEA 220 or permission of the instructor."}, {"abbreviation": "THEA 249", "name": "Mask and Makeup Design", "info": "The study of stage makeup (including corrective and character) progresses to the design of makeup as mask and then to the design of three-dimensional masks for performance. Our study emphasizes the ways that the performance, ritual, and festival traditions of the Americas, Africa, Asia, Europe and Oceania have influenced present performance styles in theatre and dance."}, {"abbreviation": "THEA 250", "name": "Costume and Fashion", "info": "An overview of the history of costume from the Egyptian period to the present; stresses fashion as the mirror of the attitudes of each age."}, {"abbreviation": "THEA 256", "name": "Rituals, Festivals, Institutions", "info": "Investigates various theories concerning the origins of Western theatre in ritual performance and explores the development of theatrical institutions from the Greeks to Shakespeare in the context of social, philosophical, and religious values."}, {"abbreviation": "THEA 357", "name": "Performance Opus", "info": "The Performance Opus is an advanced theatre course that showcases the culmination of the Bucknell actor training experience. In addition, the class is a course in career preparation for performance. Prerequisite: permission of the instrucctor."}, {"abbreviation": "THEA 365", "name": "Independent Studies in Theatre", "info": "Independent special studies in theatre or dance performance, history, design, or technology. Prerequisite: permission of the instructor."}, {"abbreviation": "UNIV 200", "name": "Integrated Perspectives Course", "info": "Team-taught interdisciplinary course. Topics vary."}, {"abbreviation": "UNIV 218", "name": "Health and Community", "info": "Explores how community, family, and experiences with health institutions shape and affect well being, physical problems, and health. Crosslisted as SOCI 218."}, {"abbreviation": "UNIV 225", "name": "Introduction to Public Policy", "info": "Introduction to the study of public policy, including methods to identify social problems, analysis of the political process, policy analysis, and how individuals and institutions respond to policy using a variety of social science disciplines."}, {"abbreviation": "UNIV 230", "name": "Modernism and Crisis", "info": "An interdisciplinary study of major texts, figures, and concepts of the 20th century. Designed to follow HUMN 128 and HUMN 150. Crosslisted as HUMN 250 and ENGL 230."}, {"abbreviation": "UNIV 233", "name": "The Philosophy of Peace and Nonviolence", "info": "A course in Peace Studies that will investigate the arguments and spirit of Pacifism and nonviolent philosophies. Crosslisted as PHIL 233."}, {"abbreviation": "UNIV 262", "name": " The Modern Jewish Experience in Lit&Film;", "info": "The course explores modern Jewish life around the world through a variety of perspectives, including literature, film, history, and memoir. Emphasis is placed on Jews in Israel and the U.S., as well as on immigration and the Holocaust. Crosslisted as HEBR 252."}, {"abbreviation": "UNIV 264", "name": "Materials Science", "info": "Study of the behavior of materials and the relationships between structure and properties of materials including metals, ceramics, and polymers. With experimental laboratory including measurements, modifications, and fracture of materials. Discussions of how materials are selected for different applications based on properties, processing, and societal considerations."}, {"abbreviation": "UNIV 350", "name": "Engineering: A Humanist Enterprise", "info": "This course explores engineering as a human activity: undertaken by humans to meet human goals. The course explores how multiple disciplinary perspectives are required to undertake good engineering, and how our nature as humans affects engineering activities to help students transcend disciplinary boundaries. Crosslisted as ECEG 409 and ECEG 610."}, {"abbreviation": "UNIV 401", "name": "Leadership: Theory, History, and Practice", "info": "Leadership is a phenomenon studied by numerous social sciences and humanities. Their different perspectives are compared in a search for the determinants of successful leadership. Prerequisite: junior or senior status."}, {"abbreviation": "WMST 150", "name": "Introduction to Women's and Gender Studies", "info": "Interdisciplinary introduction to the major theories, themes, and issues of women's and gender studies."}, {"abbreviation": "WMST 220", "name": "Introduction to Feminist Theory in Practice", "info": "Explore the broad range of work that lays the intellectual and theoretical groundwork for contemporary feminist theory and politics, while providing student opportunities to experience such work critically through service learning experiences in the community. Prerequisite: WMST 150 or permission of the instructor."}, {"abbreviation": "WMST 225", "name": "Modernism on the Margins: Race, Class and Sexuality", "info": "Exploiting the exclusionary nature of \"High Modernism,\" this course highlights literature on the margins of modernism, revealing literature's political investment in race, class, and sexuality. Crosslisted as ENGL 239."}, {"abbreviation": "WMST 236", "name": "Gender, Race and Poverty", "info": "A study of concentrated poverty and unemployment in the United States and policies to generate full employment and eliminate poverty. Prerequisite: ECON 103 and/or permission of the instructor. Crosslisted as ECON 236."}, {"abbreviation": "WMST 320", "name": "Independent Studies", "info": "Independent study supervised by Women's and Gender Studies faculty member. Prerequisite: permission of the instructor."}, {"abbreviation": "WMST 325", "name": "History of Sexuality", "info": "A cross-cultural and interdisciplinary examination of the signification of sexuality in literature, philosophy, scientific discourse, and the visual arts. Prerequisite: permission of the instructor. Crosslisted as HUMN 320."}], "semester": "Fall 2018-2019", "ccc": [{"abbreviation": "ARHC", "name": "Arts and Humanities"}, {"abbreviation": "AHLG", "name": "Arts and Humanities Learning Goals"}, {"abbreviation": "CBL", "name": "Community Based Learning"}, {"abbreviation": "DUSC", "name": "Diversity in the U.S."}, {"abbreviation": "GLSP", "name": "Engineering Global and Societal Perspectives"}, {"abbreviation": "EGHU", "name": "Engineering Humanities"}, {"abbreviation": "EGSS", "name": "Engineering Social Science"}, {"abbreviation": "EVCN", "name": "Environmental Connections"}, {"abbreviation": "FRST", "name": "First year course"}, {"abbreviation": "CCFL", "name": "Foreign Language"}, {"abbreviation": "FOUN", "name": "Foundation Seminar"}, {"abbreviation": "GBCC", "name": "Global Connections"}, {"abbreviation": "CCIP", "name": "Integrated Perspectives"}, {"abbreviation": "LBSC", "name": "Lab Science"}, {"abbreviation": "NSMC", "name": "Natural Science and Mathematics"}, {"abbreviation": "NMLG", "name": "Natural Science and Mathematics Learning Goals"}, {"abbreviation": "CCQR", "name": "Quantitative Reasoning"}, {"abbreviation": "SL", "name": "Service Learning Course"}, {"abbreviation": "SLSC", "name": "Social Science"}, {"abbreviation": "SSLG", "name": "Social Science Learning Goals"}, {"abbreviation": "W1", "name": "Writing Level 1"}, {"abbreviation": "W2", "name": "Writing Level 2"}], "credit": [{"abbreviation": ".5", "name": "Half Credit"}, {"abbreviation": ".25", "name": "Quarter Credit"}]}