{"department": [{"abbreviation": "ACFM", "name": "Accounting & Financial Management"}, {"abbreviation": "AFST", "name": "Africana Studies"}, {"abbreviation": "ANBE", "name": "Animal Behavior"}, {"abbreviation": "ANTH", "name": "Anthropology"}, {"abbreviation": "ARBC", "name": "Arabic"}, {"abbreviation": "ARTH", "name": "Art History"}, {"abbreviation": "ARST", "name": "Art Studio"}, {"abbreviation": "ASTR", "name": "Astronomy"}, {"abbreviation": "BIOL", "name": "Biology"}, {"abbreviation": "BMEG", "name": "Biomedical Engineering"}, {"abbreviation": "CHEG", "name": "Chemical Engineering"}, {"abbreviation": "CHEM", "name": "Chemistry"}, {"abbreviation": "CHIN", "name": "Chinese"}, {"abbreviation": "CEEG", "name": "Civil & Environmental Engineering"}, {"abbreviation": "CLAS", "name": "Classics"}, {"abbreviation": "CSCI", "name": "Computer Science"}, {"abbreviation": "ENCW", "name": "Creative Writing"}, {"abbreviation": "DANC", "name": "Dance"}, {"abbreviation": "EAST", "name": "East Asian Studies"}, {"abbreviation": "ECON", "name": "Economics"}, {"abbreviation": "EDUC", "name": "Education"}, {"abbreviation": "ECEG", "name": "Electrical & Computer Engineering"}, {"abbreviation": "ENGR", "name": "Engineering"}, {"abbreviation": "ENGL", "name": "English"}, {"abbreviation": "ENST", "name": "Environmental Studies"}, {"abbreviation": "ENFS", "name": "Film/Media Studies"}, {"abbreviation": "FOUN", "name": "Foundation Seminar"}, {"abbreviation": "FREN", "name": "French"}, {"abbreviation": "GEOG", "name": "Geography"}, {"abbreviation": "GEOL", "name": "Geology"}, {"abbreviation": "GRMN", "name": "German"}, {"abbreviation": "GLBM", "name": "Global Management"}, {"abbreviation": "GREK", "name": "Greek"}, {"abbreviation": "HEBR", "name": "Hebrew"}, {"abbreviation": "HIST", "name": "History"}, {"abbreviation": "HUMN", "name": "Humanities"}, {"abbreviation": "IREL", "name": "International Relations"}, {"abbreviation": "ITAL", "name": "Italian"}, {"abbreviation": "JAPN", "name": "Japanese"}, {"abbreviation": "LATN", "name": "Latin"}, {"abbreviation": "LAMS", "name": "Latin American Studies"}, {"abbreviation": "LING", "name": "Linguistics"}, {"abbreviation": "ENLS", "name": "Literary Studies"}, {"abbreviation": "MGMT", "name": "Management"}, {"abbreviation": "MSUS", "name": "Managing for Sustainability"}, {"abbreviation": "MIDE", "name": "Markets, Innovation & Design"}, {"abbreviation": "MATH", "name": "Mathematics"}, {"abbreviation": "MECH", "name": "Mechanical Engineering"}, {"abbreviation": "MILS", "name": "Military Science"}, {"abbreviation": "MUSC", "name": "Music"}, {"abbreviation": "NEUR", "name": "Neuroscience"}, {"abbreviation": "PHIL", "name": "Philosophy"}, {"abbreviation": "PHYS", "name": "Physics"}, {"abbreviation": "POLS", "name": "Political Science"}, {"abbreviation": "PSYC", "name": "Psychology"}, {"abbreviation": "RELI", "name": "Religion"}, {"abbreviation": "RESC", "name": "Residential Colleges"}, {"abbreviation": "RUSS", "name": "Russian"}, {"abbreviation": "SIGN", "name": "Sign Language"}, {"abbreviation": "SOCI", "name": "Sociology"}, {"abbreviation": "SPAN", "name": "Spanish"}, {"abbreviation": "THEA", "name": "Theatre"}, {"abbreviation": "UNIV", "name": "University Course"}, {"abbreviation": "WMST", "name": "Women's and Gender Studies"}], "course": [{"courseNum": "ACFM 220", "courseName": "Business Law I", "info": "Introduction to business law using lecture and case method. Topics include contracts, the Uniform Commercial Code, agency, and business structures. Not open to first-year students."}, {"courseNum": "ACFM 261", "courseName": "Foundations of Accounting and Financial Management II", "info": "Covers general purpose financial statements, the theoretical framework that underlies the measurement of income, and asset and liability valuation. Prerequisite: MGMT 200 or permission of instructor."}, {"courseNum": "ACFM 310", "courseName": "Independent Study in Accounting and Financial Management", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "ACFM 340", "courseName": "Business Analytics and Financial Modeling", "info": "Decision making of individuals and groups in organizations, emphasizing the organization's financial dimension. Topics include linear and nonlinear optimization with applications in finance and accounting, fundamentals of portfolio and risk management, and the application of Monte Carlo methods to the pricing of financial derivatives."}, {"courseNum": "ACFM 351", "courseName": "Intermediate Accounting and Financial Management I", "info": "Accounting theory and practice applicable to income determination and asset valuation.  Develops students' understanding of the accounting and financial reporting environment. Prerequisite: ACFM 261."}, {"courseNum": "ACFM 352", "courseName": "Intermediate Accounting and Financial Management II", "info": "A continuation of ACFM 351.  Topics include: investments, debt, leases, pensions, deferred taxes, EPS, equity, and cash flows. Prerequisite: ACFM 351 or permission of instructor."}, {"courseNum": "ACFM 353", "courseName": "Advanced Accounting", "info": "Accounting theory and practice applicable to business combinations and additional advanced topics related to financial reporting.  Prerequisite: ACFM 352 or permission of the instructor."}, {"courseNum": "ACFM 354", "courseName": "Tax Accounting I", "info": "Survey of federal income taxes with emphasis on individual tax law, practice, and planning.  Prerequisite: junior or senior status or permission of the instructor."}, {"courseNum": "ACFM 357", "courseName": "Auditing and Assurance", "info": "Most CPA track students head to entry level positions as auditors in public accounting firms.  ACFM 357 helps students develop a strong foundation for quality professional judgments to support their future practice of auditing by examining professional and ethical standards and the audit process."}, {"courseNum": "ACFM 365", "courseName": "Advanced Managerial and Cost Accounting", "info": "Examines managerial accounting and cost behavior, specifically, how product cost information is recorded, reported, analyzed and used by managers in decision making. Prerequisite: ACFM 261."}, {"courseNum": "ACFM 370", "courseName": "Corporate Finance", "info": "Concepts, principles, and recent innovations in corporate finance: risk and return, valuation, capital budgeting and structure, dividend policy, financial planning, risk management."}, {"courseNum": "ACFM 375", "courseName": "Student Managed Investment Fund I", "info": "The first course of a two semester experiential learning exercise in which students manage a real dollar investment portfolio.  Prerequisites: ACFM 377 and permission of the instructor."}, {"courseNum": "ACFM 377", "courseName": "Investments", "info": "Principles of investment practice and theory.  Emphasis on the fundamentals of intangible investments (equities, debt and derivative instruments).  Prerequisites: MGMT 102 and ACFM 370 or permission of the instructor."}, {"courseNum": "ACFM 378", "courseName": "Investment Banking", "info": "An economic, historical, and social perspective on the industry from its origin to the present with emphasis on current practices.  Prerequisite: junior/senior economics or BSBA majors; others by permission."}, {"courseNum": "ACFM 476", "courseName": "Student Managed Investment Fund II", "info": "The second course of a two semester portfolio management course in which students manage a real dollar investment portfolio.  Prerequisite: ACFM 375 and permission of the instructor."}, {"courseNum": "AFST 155", "courseName": "Blacks in Latin America", "info": "By the early 19th century nearly 6 million Africans were forcibly transported to Spanish and Portuguese “New World” territories. Despite outnumbering US Blacks 3:1, Afro-Latin Americans have received little scholarly attention until recently. This course explores the history and impact of the Afro-Latin American experience from slavery to the present. Crosslisted as LAMS 155."}, {"courseNum": "AFST 199", "courseName": "Introduction to Africana Studies", "info": "The course introduces students to concepts, theories, and debates of the vibrant discipline of Africana Studies. It surveys major themes, questions, concerns, and events of African, African American, and other African diasporic communities. The course examines the making of the modern world through the lens of black global experience."}, {"courseNum": "AFST 201", "courseName": "Introduction to Black Performance Theory", "info": "This course will introduce students to the field of performance theory as it is engaged through the lens of the Black World. It will place scholars in Black performance theory in conversation with scholars working in the black radical tradition whose work raises important questions about performance, blackness, and more."}, {"courseNum": "AFST 221", "courseName": "Introduction to African American Literature", "info": "Provides a selection from across the vast array of examples collected under the inadequate rubric “African American Literature.” We'll read poetry, fiction, non-fiction, and drama in order to understand how a group of people who have been written out of American history and culture write themselves back into these stories. Crosslisted as ENLS 221."}, {"courseNum": "AFST 222", "courseName": "Caribbean Literature", "info": "Introduction to selected literatures, cultures, and histories of the Caribbean, with close analysis of text and context. When taught in the summer, the course is the core of the Bucknell in the Caribbean summer study abroad program. Crosslisted as ENLS 227."}, {"courseNum": "AFST 255", "courseName": "Radical Black Drama and Performance", "info": "This course presents an ensemble of playwrights from the 19th century into the present, whose dramatic works consider the predicament of the blackness in the world. This course pays particular attention to plays not just as artistic creations but also as political and performative gestures."}, {"courseNum": "AFST 399", "courseName": "Independent Study", "info": "Individual study or project, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "ANBE 266", "courseName": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior emphasizing both proximate and ultimate mechanisms and explanations for behavior. Crosslisted as BIOL 266 and PSYC 266."}, {"courseNum": "ANBE 296", "courseName": "Research Methods in Animal Behavior", "info": "Laboratory and/or field research to accompany ANBE 266, BIOL 266, or PSYC 266. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or BIOL 205 and prerequisite or corequisite ANBE 266, BIOL 266, or PSYC 266. Crosslisted as PSYC 296."}, {"courseNum": "ANBE 314", "courseName": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation. Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations. Prerequisites: BIOL 206, BIOL 208 and permission of the instructor. Crosslisted as BIOL 314 and BIOL 614 and ANBE 614."}, {"courseNum": "ANBE 320", "courseName": "Advanced Topics in Animal Behavior", "info": "Culminating Experience seminar for senior animal behavior majors covering selected topics of current interest in animal behavior. Crosslisted as ANBE 620. Prerequisites: senior animal behavior major status and permission of the instructor."}, {"courseNum": "ANBE 321", "courseName": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations.  Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood care.  Prerequisites: BIOL 208 and permission of the instructor.  Crosslisted as BIOL 321 and BIOL 621 and ANBE 621."}, {"courseNum": "ANBE 370", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor. Crosslisted as ANBE 670 and BIOL 370 and BIOL 670 and PSYC 370 and PSYC 670."}, {"courseNum": "ANBE 372", "courseName": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition. Prerequisites: PSYC 266 or ANBE 266, and permission of the instructor. Crosslisted as PSYC 372 and PSYC 672 and ANBE 672."}, {"courseNum": "ANBE 391", "courseName": "Research", "info": "Independent research, with faculty supervision, in the study of animal behavior.  Crosslisted as ANBE 691. Prerequisite: permission of the instructor."}, {"courseNum": "ANBE 399", "courseName": "Senior Thesis", "info": "Original research leading to a thesis presentation on a topic related to the study of animal behavior.  Prerequisite: permission of the instructor."}, {"courseNum": "ANBE 614", "courseName": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation. Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations. Prerequisite: permission of the instructor. Crosslisted as BIOL 614 and ANBE 314 and BIOL 314."}, {"courseNum": "ANBE 620", "courseName": "Advanced Topics in ANBE", "info": "Culminating Experience seminar for senior animal behavior majors covering selected topics of current interest in animal behavior. Prerequisites: senior animal behavior major status and permission of the instructor. Crosslisted as ANBE 320."}, {"courseNum": "ANBE 621", "courseName": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations.  Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood care. Prerequisite: permission of the instructor. Crosslisted as BIOL 321 and BIOL 621 and ANBE 321."}, {"courseNum": "ANBE 670", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and BIOL 370 and BIOL 670 and PSYC 370 and PSYC 670."}, {"courseNum": "ANBE 672", "courseName": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition.  Prerequisite: permission of the instructor. Crosslisted as PSYC 372 and PSYC 672 and ANBE 372."}, {"courseNum": "ANTH 109", "courseName": "Introduction to Cultural Anthropology", "info": "Nature and scope of the field: method and theory, institutions of human beings in cross-cultural perspective, case studies."}, {"courseNum": "ANTH 201", "courseName": "Field Research in Local Communities", "info": "Participant-observation, interviewing, and other field research methods. Students will devise and conduct their own ethnographic research projects in a local community. Crosslisted as SOCI 201."}, {"courseNum": "ANTH 202", "courseName": "Rainforests and Ecopolitics in Latin America", "info": "Focusing on Amazonia as a key region in global environmental politics, the course examines climate policy debates and recent shifts in global environmentalism. Crosslisted as LAMS 202 and ENST 209."}, {"courseNum": "ANTH 232", "courseName": "Gender and Sexuality in South Asia", "info": "Explores issues of gender and sexuality in South Asia, primarily India and Sri Lanka. Topics include marriage, family, life cycle, religion and nationalism. Crosslisted as WMST 232."}, {"courseNum": "ANTH 251", "courseName": "Women and Development", "info": "This course examines the relationship between women and development, and an ideological, economic, political, and social enterprise. Crosslisted as WMST 251."}, {"courseNum": "ANTH 290", "courseName": "Medical Anthropology", "info": "Health and illness are not solely determined by an individual's biology. Their social determinants are the focus of this course. An understanding of health requires an investigation into the cultural meanings of the body, social relations, and the systems of power in which they are embedded."}, {"courseNum": "ANTH 310", "courseName": "Culture, Nature and Place", "info": "We examine the intersection of place, nature and culture throughout the world, including our own backyard. Prerequisites: permission of the instructor and ANTH 109 or GEOG 101."}, {"courseNum": "ARBC 101", "courseName": "Beginning Arabic I", "info": "Beginning language skills. Practice in listening, speaking, reading and writing. Elementary grammar. Introduction to Arabic culture."}, {"courseNum": "ARBC 103", "courseName": "Intermediate Arabic I", "info": "A continuation and review of basic grammar, emphasizing all four language skills and culture. Prerequisite: ARBC 101A or ARBC 102 or equivalent."}, {"courseNum": "ARBC 201", "courseName": "Intermediate Arabic Conversation I", "info": "Concentration on development of speaking skills. Conducted entirely in Arabic by native speaker. Prerequisite: ARBC 102."}, {"courseNum": "ARST 112", "courseName": "Photography I", "info": "An introduction to the theory, practice, and criticism of fine art photography. Not open to seniors."}, {"courseNum": "ARST 120", "courseName": "Painting I", "info": "Studio course to introduce basic techniques and materials of painting, color theory and its application, image and composition. Not open to seniors."}, {"courseNum": "ARST 130", "courseName": "Printmaking I", "info": "An introduction to visual concepts and processes in intaglio, relief, and screen printing. Not open to seniors."}, {"courseNum": "ARST 131", "courseName": "Drawing I", "info": "The tradition of drawing, its practice and theory in various media. Not open to seniors."}, {"courseNum": "ARST 150", "courseName": "Sculpture I", "info": "Students will be introduced to a variety of sculptural materials and methods of fabrication, become familiar with the work of contemporary sculptors, and learn to interpret visual works. Prerequisite: seniors by permission of the instructor."}, {"courseNum": "ARST 231", "courseName": "Drawing II", "info": "A continuation of ARST 131 with emphasis on concept and refinement of image. Prerequisite: permission of the instructor."}, {"courseNum": "ARST 234", "courseName": "Digital Photography", "info": "Individual projects in digital photography with an emphasis on concept and refinement of image. Prerequisites: ARST 112, ARST 131 and permission of the instructor."}, {"courseNum": "ARST 243", "courseName": "Graphic Design", "info": "An introduction to the theory and practice of graphic design and the principles underlying the visual presentation of information, both verbal and pictorial. Prerequisites: one of the following: ARST 112, ARST 130, ARST 131, ARST 150, or ARST 234 and permission of the instructor."}, {"courseNum": "ARST 247", "courseName": "Photography II", "info": "This course builds upon skills and knowledge gained in ARST 112, including more complex technical and critical methods and development of a personal direction. Prerequisite: ARST 112 and permission of the instructor."}, {"courseNum": "ARST 336", "courseName": "Advanced Work in the Studio", "info": "Advanced projects in each studio area: painting, printmaking, photography, sculpture, or graphics. This course may be repeated for additional credit. Prerequisite: permission of the instructor."}, {"courseNum": "ARST 350", "courseName": "Honors Studio Art", "info": "Independent study or creative work leading either to the writing of a thesis or the completion of a significant studio project.  For courses in theatre production and design, see listings in Theatre and Dance.  Prerequisite: permission of the instructor."}, {"courseNum": "ARST 450", "courseName": "Senior Projects in Studio Art", "info": "Studio Art Culminating Experience: in the fall semester majors will take ARST 450 Senior Projects in Studio Art to work towards creating a portfolio of professional standards. In the spring semester, majors will install and exhibit the work created in ARST 450 in the Samek Art Gallery."}, {"courseNum": "ARTH 101", "courseName": "World Art I: Caves to Cathedrals", "info": "This course explores the art and architecture created throughout the world from the prehistoric period to roughly the 14th century. Visual analysis will be the main focus."}, {"courseNum": "ARTH 207", "courseName": "Birth of Modern Art: 1850-1915", "info": "Examination of artists and movements from 1850-1915, including Realism, Impressionism, Post-impressionism, Symbolism, Expressionism, Fauvism, Cubism and Abstraction. Focus on innovations in French painting and urban experience."}, {"courseNum": "ARTH 210", "courseName": "Special Topics in Art History", "info": "Topics will vary each semester."}, {"courseNum": "ARTH 242", "courseName": "Archaeology of Greece", "info": "Survey of the material culture of the Greek world from the Bronze Age through the Hellenistic period. Crosslisted as CLAS 242."}, {"courseNum": "ARTH 260", "courseName": "Art, Museums, and New Media", "info": "This course explores the impact of new media and networked society on art and museums in the 21st century. The course introduces students to the professional practices and functional areas of art museums (exhibitions, education, collections) and to institutional changes driven by new digital art and contemporary culture."}, {"courseNum": "ARTH 319", "courseName": "Independent Study in Art History", "info": "Advanced problems in art history.  Prerequisite: permission of the instructor."}, {"courseNum": "ARTH 373", "courseName": "The West Encounters the Rest: Cultural Encounters Around the Globe", "info": "This course will examine the many ways European artists represented different cultures from around the world sometimes with little knowledge about them. Beginning with the art of the early modern era, class will explore the ways Chinese, Japanese, Muslims, and people from tribal cultures served as the subjects of works"}, {"courseNum": "ARTH 380", "courseName": "Honors Art History", "info": "Independent study leading to the writing of a thesis. Prerequisite: permission of the instructor."}, {"courseNum": "ARTH 402", "courseName": "Culminating Experience", "info": "Required for all art history majors. Students will explore individual research projects independently and workshop them in class. The class will culminate in a departmental art history conference where students will present their work. Prerequisite: senior status. Juniors by permission only."}, {"courseNum": "ASTR 101", "courseName": "Our Solar System", "info": "An introduction to astronomy concentrating on our evolving understanding of the solar system. Designed for non-science majors. No prerequisite."}, {"courseNum": "ASTR 337", "courseName": "Independent Study  in Astronomy/Astrophysics", "info": "Seminar or independent study in areas of current interest in the astronomy/astrophysics community.  Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 121", "courseName": "Biology for Non-majors", "info": "Introductory course primarily for the non-biology major. Focuses on life at the cellular and biochemical levels, genetics, and biotechnology. This course is not appropriate preparation for the majority of pre-health graduate programs. Please consult with the Pre-health Adviser for more information."}, {"courseNum": "BIOL 150", "courseName": "Plants, People, and the Environment", "info": "The diversity and evolution of plants, fungi, and related organisms with special emphasis on flowering plants; their importance for food, fiber, medicine, and psychoactive compounds; origins of agriculture; domestication of plants; and the role of plants in the environment."}, {"courseNum": "BIOL 205", "courseName": "Introduction to Molecules and Cells", "info": "An introductory course which focuses on the molecular biology of cells. Basic biochemical processes, cellular and subcellular structure and function are emphasized. First core course."}, {"courseNum": "BIOL 207", "courseName": "Genetics", "info": "A comprehensive survey of genetic mechanisms and methodologies, including classical genetics, recombinational analysis in bacteria, fungi, and higher eukaryotes, molecular genetics and populational and quantitative genetics. Third core course. Prerequisite: BIOL 205."}, {"courseNum": "BIOL 220", "courseName": "Human Anatomy", "info": "A course that focuses on the anatomy of and relationship between human muscles, bones, and organs. Lab involves dissection, with the cat as the primary specimen. Does not count toward the biology major.  Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 266", "courseName": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior emphasizing both proximate and ultimate mechanisms and explanations for behavior. Crosslisted as ANBE 266 and PSYC 266."}, {"courseNum": "BIOL 304", "courseName": "Biology of Cancer", "info": "The study of the molecular and cellular mechanisms that create cancer.  Prerequisites: BIOL 205, BIOL 207, and permission of the instructor. Crosslisted as BIOL 604."}, {"courseNum": "BIOL 309", "courseName": "Wildlife and Emerging Diseases", "info": "Biology of wildlife diseases, especially zoonoses (infections that jump to humans). Course will integrate popular and scientific sources. Prerequisites: BIOL 206 and permission of the instructor. Crosslisted as BIOL 609."}, {"courseNum": "BIOL 312", "courseName": "Comparative Vertebrate Anatomy", "info": "Gross morphology with emphasis on functional and evolutionary modifications of animal structure. Gross dissection and techniques used in morphology.  Prerequisites: BIOL 122 or BIOL 206 and permission of the instructor. Crosslisted as BIOL 612."}, {"courseNum": "BIOL 313", "courseName": "Mammalogy", "info": "Biology of mammals, including evolution, classification, biodiversity, behavior, anatomy, physiology, ecology, and conservation. Lab will include specimen identification, preparation, and field studies.  Prerequisite: permission of the instructor. Crosslisted as BIOL 613."}, {"courseNum": "BIOL 314", "courseName": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation.  Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations.   Prerequisites: BIOL 206, BIOL 208 or 208E and permission of the instructor. Crosslisted as ANBE 314 and BIOL 614 and ANBE 614."}, {"courseNum": "BIOL 318", "courseName": "Principles of Physiology", "info": "Emphasizes the breadth of physiology and explores physiological principles of animals from a cellular, organismal, medical, and ecological framework. Laboratory focuses on experimental design and independent research.  Prerequisites: BIOL 205, BIOL 206 and permission of the instructor. Crosslisted as BIOL 618."}, {"courseNum": "BIOL 321", "courseName": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations. Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood care.  Prerequisites: BIOL 208 and permission of the instructor. Crosslisted as BIOL 621 and ANBE 321 and ANBE 621."}, {"courseNum": "BIOL 328", "courseName": "Endocrinology", "info": "Regulation and function of hormones and their receptors from molecular to organismal levels. Role of hormones in development, physiology, and behavior; endocrine disease.  Prerequisites: BIOL 205 and BIOL 206 and permission of the instructor. Crosslisted as BIOL 628."}, {"courseNum": "BIOL 351", "courseName": "Field Botany", "info": "Outdoor field experience in plant diversity and ecology. Excursions to natural areas focused on identification, community dynamics, and ecological interactions/adaptations. Prerequisites: BIOL 208 and permission of the instructor. Crosslisted as BIOL 651."}, {"courseNum": "BIOL 352", "courseName": "Cell Biology", "info": "Covers biomembranes, cell growth patterns, cell signaling, the cytoskeleton, cell organelles, and microscopic techniques. Laboratory includes experience with cell culture.  Prerequisites: BIOL 205 and permission of the instructor. Crosslisted as BIOL 652."}, {"courseNum": "BIOL 358", "courseName": "Invertebrate Zoology", "info": "A survey of the invertebrate phyla covering phylogenetic relationships, functional morphology, ecology, life histories, symbiosis, ontogeny, and behavior. Includes hands-on study of organisms in lab and field.  Prerequisites: BIOL 206, BIOL 208, and permission of the instructor. Crosslisted as BIOL 658."}, {"courseNum": "BIOL 363", "courseName": "Receptors of Biological Membranes", "info": "A course focused on the receptors and channels that function in biological membranes. The primary research literature will be used to explore the molecular bases of cellular communication, neuronal connectivity, and sensory transduction. Prerequisites: BIOL 205 and either BIOL 206 or NEUR 253. Crosslisted as BIOL 663 and NEUR 363."}, {"courseNum": "BIOL 365", "courseName": "Introduction to Microscopy", "info": "This course is designed as an overview of light and electron microscopy, with emphasis placed on the use of instrumentation. Prerequisite: Permission of the instructor. Crosslisted as BIOL 665."}, {"courseNum": "BIOL 370", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 670 and PSYC 370 and PSYC 670."}, {"courseNum": "BIOL 399", "courseName": "Undergraduate Research", "info": "Undergraduate research.  Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 604", "courseName": "Biology of Cancer", "info": "The study of the molecular and cellular mechanisms that create cancer. Prerequisite: permission of the instructor. Crosslisted as BIOL 304."}, {"courseNum": "BIOL 609", "courseName": "Wildlife and Emerging Diseases", "info": "Biology of wildlife diseases, especially zoonoses (infections that jump to humans). Course will integrate popular and scientific sources. Prerequisite: permission of the instructor. Crosslisted as BIOL 309."}, {"courseNum": "BIOL 612", "courseName": "Comparative Vertebrate Anatomy", "info": "Gross morphology with emphasis on functional and evolutionary modifications of animal structure. Gross dissection and techniques used in morphology. Prerequisites: introductory biology course and permission of the instructor. Crosslisted as BIOL 312."}, {"courseNum": "BIOL 613", "courseName": "Mammalogy", "info": "Biology of mammals, including evolution, classification, biodiversity, behavior, anatomy, physiology, ecology, and conservation. Lab will include specimen identification, preparation, and field studies. Prerequisite: permission of the instructor. Crosslisted as BIOL 313."}, {"courseNum": "BIOL 614", "courseName": "Amphibian Biology and Conservation", "info": "The biology of amphibians, including classification, physiology, reproduction, ecology, evolution, and conservation.  Laboratory section will include identification of amphibians and field work to identify conservation issues surrounding local amphibian populations.  Prerequisite: permission of the instructor. Crosslisted as ANBE 614 and BIOL 314 and ANBE 314."}, {"courseNum": "BIOL 618", "courseName": "Principles of Physiology", "info": "Emphasizes the breadth of physiology and explores physiological principles of animals from cellular, organismal, medical, and ecological framework. Laboratory focuses on experimental design and independent research. Prerequisite: permission of the instructor. Crosslisted as BIOL 318."}, {"courseNum": "BIOL 621", "courseName": "Behavioral Ecology", "info": "The consideration of behavioral adaptations to various ecological situations. Topics include habitat choice, foraging behavior, defenses against predation, mate choice, and brood behavior.  Prerequisite: permission of the instructor. Crosslisted as BIOL 321 and ANBE 321 and ANBE 621."}, {"courseNum": "BIOL 628", "courseName": "Endocrinology", "info": "Regulation and function of hormones and their receptors from molecular to organismal levels. Role of hormones in development, physiology, and behavior; endocrine disease. Prerequisite: permission of the instructor. Crosslisted as BIOL 328."}, {"courseNum": "BIOL 651", "courseName": "Field Botany", "info": "Outdoor field experience in plant diversity and ecology. Excursions to natural areas focused on identification, community dynamics, and ecological interactions/adaptations. Prerequisite: permission of the instructor. Crosslisted as BIOL 351."}, {"courseNum": "BIOL 652", "courseName": "Cell Biology", "info": "Covers biomembranes, cell growth patterns, cell signaling, the cytoskeleton, cell organelles, and microscopic techniques. Laboratory includes experience with cell structure. Prerequisite: permission of the instructor. Crosslisted as BIOL 352."}, {"courseNum": "BIOL 658", "courseName": "Invertebrate Zoology", "info": "A survey of the invertebrate phyla covering phylogenetic relationships, functional morphology, ecology, life histories, symbiosis, ontogeny, and behavior. Includes hands-on study of organisms in lab and field. Prerequisite: permission of the instructor. Crosslisted as BIOL 358."}, {"courseNum": "BIOL 660", "courseName": "Graduate Research", "info": "Graduate research. Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 663", "courseName": "Receptors of Biological Membranes", "info": "A course focused on the receptors and channels that function in biological membranes. The primary research literature will be used to explore the molecular bases of cellular communication, neuronal connectivity, and sensory transduction. Crosslisted as BIOL 363 and NEUR 363."}, {"courseNum": "BIOL 665", "courseName": "Introduction to Microscopy", "info": "This course is designed as an overview of light and electron microscopy, with emphasis placed on the use of instrumentation. Prerequisite: permission of the instructor. Crosslisted as BIOL 365."}, {"courseNum": "BIOL 670", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 370 and PSYC 370 and PSYC 670."}, {"courseNum": "BIOL 680", "courseName": "Thesis", "info": "Thesis. Prerequisite: permission of the instructor."}, {"courseNum": "BIOL 690", "courseName": "Graduate Seminar", "info": "This course will cover topics related to being a professional scientist, including ethics, presentation skills, grant and paper writing and reviewing, and effective mentoring and teaching. Prerequisites: graduate standing and permission of the instructor."}, {"courseNum": "BMEG 250", "courseName": "Fundamentals of Biomechanics", "info": "Application of mechanical analyses to solve biomechanical problems including: equilibrium of rigid bodies, anthropometric analysis, link segment analysis, internal loads, combined loading, failure theory. Prerequisites: PHYS 211 and MATH 201. Not open to students who have taken ENGR 220, ENGR 221 or MECH 220. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 350", "courseName": "Fundamental of Biomedical Signals and Systems", "info": "Time and frequency analysis, filter design and feedback control as applied to biomedical signals and systems. Prerequisites: BMEG 205 and MATH 212. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 400", "courseName": "Biotransport II", "info": "Second biotransport course focusing on the advanced application of fundamental heat and mass transport concepts to biological systems and medical devices. Conduction, convection, thermal properties of materials, mass diffusion, compartmental modeling. Prerequisite: BMEG 300. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 401", "courseName": "Biomedical Engineering Capstone I", "info": "Senior design course emphasizing the biomedical engineering design process including problem identification and medical motivation, background research, medical regulations and ethics, design and project proposal presentation. Prerequisite: BMEG 408. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 409", "courseName": "Fabrication and Experimental Design", "info": "A hands-on course focusing on skills relevant to biomedical engineers, such as computer-aided design and documentation, fabrication, materials, selection and biocompatibility. Cell culture and experimental design. Class will be a mixture of lectures and hands-on activities. Prerequisite: BMEG 226. Open to biomedical engineering majors only."}, {"courseNum": "BMEG 471", "courseName": "Advanced Topics in Biomedical Engineering", "info": "Advanced, in-depth course developed from areas of biomedical engineering. Topics will vary.  Prerequisite: permission of the instructor."}, {"courseNum": "BMEG 480", "courseName": "Biomedical Engineering Project", "info": "Individual work with a faculty adviser on development, design, or research project beginning with a written plan and culminating with a written or oral presentation.  Prerequisite: permission of the instructor."}, {"courseNum": "BMEG 490", "courseName": "Biomedical Engineering Research", "info": "Independent study with a faculty adviser on a research or design project. Submit a proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group.  Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 300", "courseName": "Introduction to Structural Engineering", "info": "Introduction to behavior, analysis and design of structures; including design criteria, loads, modeling of structural systems, design with various material types (e.g. steel, concrete, timber, masonry). Discussion of the design process, and societal/global  context of structural design. Case studies used throughout the course. Prerequisites: ENGR 230 and ENGR 242."}, {"courseNum": "CEEG 320", "courseName": "Water Resources Engineering", "info": "Planning, design, and operation of water resources projects with emphasis on hydrology, hydraulic structures, and open and closed conduits; applications in stormwater management and water supply. Prerequisite: ENGR 222."}, {"courseNum": "CEEG 340", "courseName": "Environmental Engineering", "info": "Introduction to fundamentals of environmental engineering and science including chemistry, microbiology, mass balance, and reactor theory. Application of concepts to environmental engineering includes water quality, water and waste-water treatment, solid and hazardous waste, air pollution, greenhouse gases and climate change. Includes hands-on lab."}, {"courseNum": "CEEG 350", "courseName": "Geotechnical Engineering I", "info": "Origin, composition, structure, and properties of soils. Identification, classification, strength, permeability, and compressibility characteristics. Introduction to foundation engineering. Laboratory determination of soil properties. Prerequisites: ENGR 222 and ENGR 230 or permission of the instructor."}, {"courseNum": "CEEG 401", "courseName": "Structural Analysis", "info": "Analysis of structures including: review of essential mechanics; sketching deflection, moment, and force diagrams for indeterminate systems; influence lines; application of virtual force and displacement principles; and a comprehensive study of the direct stiffness method with a focus on matrix analysis.  Prerequisites: CEEG 300 and ENGR 212 or permission of the instructor."}, {"courseNum": "CEEG 406", "courseName": "Design of Concrete Structures", "info": "Introduction to behavior and design of concrete elements and structures: beams, columns, slabs, footings, bridges. Reinforced and prestressed concrete. Material properties and behavior, flexural and shear strength, serviceability and deflections.  Use of relevant codes and specifications including ACI and ASSHTO. Design loads according to contemporary standards and international building codes. Prerequisites: CEEG 300 and permission of the instructor."}, {"courseNum": "CEEG 421", "courseName": "Hydrology", "info": "The interrelation of meteorological conditions, precipitation, surface runoff, and groundwater storage. Prerequisites: CEEG 320 and permission of the instructor."}, {"courseNum": "CEEG 435", "courseName": "Fundamentals of Transportation Safety Data Analysis", "info": "Application of statistical techniques to analyze transportation safety data and predict crash events/characteristics; topics include crash data availability, data manipulation techniques, statistical model selection/implementation, use of safety performance functions, and advanced network screening methods."}, {"courseNum": "CEEG 441", "courseName": "Environmental Engineering Biotechnology", "info": "Theory and design of biological waste treatment systems for industrial, municipal and hazardous pollutants and natural biotransformation of pollutants in the environment. Laboratory experience on startup, operation, and analysis of systems that biodegrade pollutants and produce useful forms of energy. Prerequisite: CEEG 340 or instructor permission. Crosslisted as CEEG 641."}, {"courseNum": "CEEG 445", "courseName": "Environmental Engineering Chemistry", "info": "Principles of aquatic chemistry and applications with emphasis on acid-base reactions, metal speciation and solubility, and oxidation-reduction reactions in water.  Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 481", "courseName": "Undergraduate Research", "info": "Original investigations in structural engineering, transportation engineering, environmental engineering, geotechnical engineering, or water resource engineering."}, {"courseNum": "CEEG 490", "courseName": "Engineering Planning and Project Management", "info": "Exploration and application of the civil engineering planning process including feasibility study, decision making,  engineering economic analysis, and project management skills. Prerequisite: senior status."}, {"courseNum": "CEEG 495", "courseName": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications.  Prerequisite: permission of the instructor. Crosslisted as CHEG 495 and ECEG 495 and MECH 495 and ENGR 695."}, {"courseNum": "CEEG 601", "courseName": "Structural Analysis", "info": "Analysis of structures, including: review of essential mechanics; sketching deflection, moment, and force diagrams for indeterminate systems; influence lines; application of virtual force and displacement principles; and a comprehensive study of the direct stiffness method with a focus on a matrix analysis. Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 606", "courseName": "Design of Concrete Structures", "info": "Introduction to behavior and design of concrete elements and structures: beams, columns, slabs, footings, bridges. Reinforced and prestressed concrete. Material properties and behavior, flexural and shear strength, serviceability and deflections. Use of relevant codes and specifications including ACI and AASHTO. Design loads according to contemporary standards, and international building codes. Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 621", "courseName": "Hydrology", "info": "The interrelation of meteorological conditions, precipitation, surface runoff, and groundwater storage. Prerequisite: CEEG 320 and permission of the instructor."}, {"courseNum": "CEEG 641", "courseName": "Environ Engr Biotechnology", "info": "Theory and design of biological waste treatment systems for industrial, municipal and hazardous pollutants and natural biotransformation of pollutants in the environment. Laboratory experience on startup, operation, and analysis of systems that biodegrade pollutants and produce useful forms of energy. Prerequisite: CEEG 340 or permission of the instructor. Crosslisted as CEEG 441."}, {"courseNum": "CEEG 645", "courseName": "Environmental Engineering Chemistry", "info": "Principles of aquatic chemistry and applications with emphasis on acid-base reactions, solubility, precipitation, and oxidation reduction reactions in water.  Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 681", "courseName": "Graduate Research", "info": "Original investigations in any discipline of civil engineering. Prerequisite: permission of the instructor."}, {"courseNum": "CEEG 699", "courseName": "Thesis", "info": "Research on the graduate level under the direction of a faculty member."}, {"courseNum": "CHEG 300", "courseName": "Heat and Mass Transfer", "info": "Conductive, convective and radiation heat transfer; analytical and numerical solutions of heat transfer problems, estimation of heat transfer coefficients, and heat exchanger design. Fundamentals of mass transfer (diffusion and convection) with applications to unit operations. With experimental laboratory. Prerequisites: ENGR 233, CHEG 200 and CHEG 210 or MATH 212."}, {"courseNum": "CHEG 302", "courseName": "Equilibrium Stage Processes", "info": "Analysis of binary and multicomponent separations by analytical, graphical, and computer methods. Topics include gas absorption, distillation, liquid-liquid extraction as well as selected novel separation processes. With computational laboratory. Prerequisite: CHEG 200. Corequisite: CHEG 300."}, {"courseNum": "CHEG 320", "courseName": "Chemical Reaction Engineering", "info": "Rate forms for homogeneous, catalytic, and biological reactions; isothermal and nonisothermal reactor design and analysis; interpretation of laboratory data; introduction to nonideal flow and residence-time distributions. With experimental laboratory. Prerequisites: CHEM 341 or CHEM 343, CHEG 210, and CHEG 310."}, {"courseNum": "CHEG 400", "courseName": "Process Engineering", "info": "Applications of engineering, economic, environmental, and ethical principles in preliminary process design using computer aids such as process simulators. Problem definition literature survey, flowsheet development, material and energy balances, equipment design, profitability analysis, oral and written communication. With design laboratory. Prerequisites: CHEG 310 and CHEG 315. Crosslisted as CHEG 600."}, {"courseNum": "CHEG 430", "courseName": "Chemical Engineering Project", "info": "Individual work with a faculty adviser on a development or design project beginning with a written plan and culminating with a deliverable product and a written report. Problem analysis involving information synthesis, experimentation, mathematical modeling or software development.  Prerequisite: permission of the instructor. Crosslisted as CHEG 630."}, {"courseNum": "CHEG 440", "courseName": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group.  Prerequisite: permission of the instructor. Crosslisted as CHEG 441 and CHEG 640 and CHEG 641."}, {"courseNum": "CHEG 450", "courseName": "Polymer Science", "info": "Structure, characterization and properties of polymeric materials. Chemistry and kinetics of polymerization. Processing and application of polymers. Prerequisite: CHEM 341 or CHEM 343. Crosslisted as CHEG 650."}, {"courseNum": "CHEG 465", "courseName": "Advanced Materials Science and Engineering", "info": "Advanced, in-depth exploration of processing - structure - property - performance relationships of materials through real-world examples and case studies. Prerequisite: ENGR 240, ENGR 242, or equivalent. Crosslisted as CHEG 665."}, {"courseNum": "CHEG 483", "courseName": "Topics in Chemical Engineering Thermodynamics", "info": "Advanced study of thermodynamics applied to fluid flow, heat transfer, gas compression, air conditioning, refrigeration, and chemical equilibria. Prerequisite: CHEG 310. Only open to seniors.  Crosslisted as CHEG 683."}, {"courseNum": "CHEG 495", "courseName": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications. Prerequisite: junior or senior status. Crosslisted as CEEG 495 and ECEG 495 and ECEG 695 and MECH 495 and ENGR 695."}, {"courseNum": "CHEG 600", "courseName": "Process Engineering", "info": "Applications of engineering, economic, environmental, and ethical principles in preliminary process design using computer aids such as process simulators. Problem definition literature survey, flowsheet development, material and energy balances, equipment design, profitability analysis, oral and written communication. With design laboratory. Crosslisted as CHEG 400."}, {"courseNum": "CHEG 640", "courseName": "Chemical Engineering Research", "info": "Independent study with a faculty adviser on a research project. Submit a project proposal for group review, conduct the work, and culminate with a written report and an oral presentation before a faculty group. Prerequisite: permission of the instructor. Crosslisted as CHEG 440 and CHEG 441 and CHEG 641."}, {"courseNum": "CHEG 650", "courseName": "Polymer Science", "info": "The chemistry and kinetics of polymerization. Polymerization processes and polymer processing. Properties and application of polymers. Prerequisites: CHEM 212 and CHEM 341. Crosslisted as CHEG 450."}, {"courseNum": "CHEG 665", "courseName": "Adv. Materials Sci. & Eng.", "info": "Advanced, in-depth exploration of processing - structure - property - performance relationships of materials through real-world examples and case studies. Crosslisted as CHEG 465."}, {"courseNum": "CHEG 680", "courseName": "Graduate Research and Thesis", "info": "Individual graduate-level investigations culminating in a thesis. Required for the master of science in chemical engineering degree."}, {"courseNum": "CHEG 683", "courseName": "Topics in Cheg Thermodynamics", "info": "Advanced study of thermodynamics applied to fluid flow, heat transfer, gas compression, air conditioning, refrigeration, and chemical equilibria. Prerequisite: permission of the instructor. Crosslisted as CHEG 483."}, {"courseNum": "CHEM 105", "courseName": "Introduction to Chemistry", "info": "A terminal elementary course covering in-depth selected topics, which may vary from year to year. Satisfies science requirement for Bachelor of Arts students not majoring in science or engineering. Not open to students who have taken CHEM 160. Prerequisite: seniors by permission only."}, {"courseNum": "CHEM 201", "courseName": "General Chemistry I", "info": "Fundamental principles in inorganic chemistry including aqueous reactions, atomic and molecular structure, coordination compounds, solids, liquids, and gases, and basic equilibrium. Laboratory experiments are both qualitative and quantitative. Credit not given for both CHEM 201 and CHEM 221."}, {"courseNum": "CHEM 205", "courseName": "Principles of Chemistry", "info": "First college chemistry course for most students. Introduction to chemical principles. Prerequisite: high school chemistry or equivalent."}, {"courseNum": "CHEM 221", "courseName": "Inorganic Chemistry I", "info": "Introduction to structures and reactivity of inorganic systems. Introductory thermodynamics and kinetics. Emphasizes hands-on, experiential learning in workshops and laboratory. Prerequisite: CHEM 212 or permission of the instructor."}, {"courseNum": "CHEM 231", "courseName": "Analytical Chemistry", "info": "Chemical equilibrium and modern analysis with an emphasis on acid-base systems, solubility, metal ion determinations, electroanalytical chemistry, spectrophotometry, and separation methods. Prerequisite: CHEM 221 or CHEM 222."}, {"courseNum": "CHEM 313", "courseName": "Synthetic Organic Chemistry", "info": "Modern synthetic organic chemistry, with examples involving complex natural products. Application of organic mechanism, synthetic strategy, and advanced transformations to total synthesis. Prerequisite: CHEM 212. Crosslisted as CHEM 613."}, {"courseNum": "CHEM 332", "courseName": "Analytical Chemistry II", "info": "Theory and practice of techniques of instrumental analysis including spectrophotometry, fluorescence, mass spectrometry, atomic absorption, chromatography, capillary electrophoresis, and dynamic electrochemistry. Prerequisite: CHEM 231. Crosslisted as CHEM 632."}, {"courseNum": "CHEM 340", "courseName": "Biological Physical Chemistry", "info": "Introduction to physical chemistry for life science students, with emphasis on thermodynamics, hydrodynamics and spectroscopy. Not open to B.S. chemistry majors. Prerequisites: CHEM 231, MATH 201, and PHYS 211. MATH 202 and PHYS 212 are recommended. Crosslisted as CHEM 640."}, {"courseNum": "CHEM 341", "courseName": "Physical Chemistry I", "info": "Introductory physical chemistry with emphasis on thermodynamics, kinetics and electrochemistry. Prerequisites: CHEM 231, MATH 211, and PHYS 212. Not open to engineering majors. Crosslisted as CHEM 641."}, {"courseNum": "CHEM 343", "courseName": "Physical Chemistry for Engineers", "info": "Introductory physical chemistry for engineers, with emphasis on thermodynamics, chemical kinetics and electrochemistry. Prerequisites: CHEM 231, MATH 211, PHYS 211. Only open to engineering majors."}, {"courseNum": "CHEM 351", "courseName": "Biochemistry I", "info": "Introduction to biological chemistry with emphasis on the structure and function of proteins, lipids, carbohydrates and nucleic acids, kinetics and mechanisms of enzymes, bioenergetics, and metabolism. Prerequisites: CHEM 212 and either CHEM 231 or CHEM 202. Crosslisted as CHEM 651."}, {"courseNum": "CHEM 360", "courseName": "Advanced Environmental Chemistry", "info": "Chemistry of the atmosphere, hydrosphere, and lithosphere. Natural processes and anthropogenic effects will be discussed. Prerequisite: CHEM 231 or permission of the instructor. Crosslisted as CHEM 660."}, {"courseNum": "CHEM 371", "courseName": "Chemistry Lecture Series", "info": "Formal oral presentations on current research will be given by students, faculty and visiting scientists. Prerequisites: participation in an approved research project or independent study for seniors or second term juniors only."}, {"courseNum": "CHEM 375", "courseName": "Undergraduate Research", "info": "Original investigations in analytical, biological, organic, physical, environmental or inorganic chemistry."}, {"courseNum": "CHEM 385", "courseName": "Seminar", "info": "Topics vary. Crosslisted as CHEM 685."}, {"courseNum": "CHEM 613", "courseName": "Synthetic Organic Chemistry", "info": "Modern synthetic organic chemistry, with examples involving natural products and compounds of theoretical interest, and also demonstrating the applicability of organic chemical theory.  Prerequisite: permission of the instructor. Crosslisted as CHEM 313."}, {"courseNum": "CHEM 632", "courseName": "Analytical Chemistry II", "info": "Theory and practice of techniques of instrumental analysis including spectrophotometry, fluorescence, mass spectrometry, atomic absorption, chromatography, capillary electrophoresis, and dynamic electrochemistry. Prerequisite: CHEM 231. Crosslisted as CHEM 332."}, {"courseNum": "CHEM 640", "courseName": "Biological Physical Chemistry", "info": "Introduction to physical chemistry for life science students, with emphasis on thermodynamics, hydrodynamics and spectroscopy. Crosslisted as CHEM 340."}, {"courseNum": "CHEM 641", "courseName": "Physical Chemistry I", "info": "Introductory physical chemistry with emphasis on thermodynamics and kinetics. Prerequisites: permission of the instructor. Crosslisted as CHEM 341."}, {"courseNum": "CHEM 651", "courseName": "Biochemistry I", "info": "Introduction to biological chemistry with emphasis on the structure and function of proteins, lipids, carbohydrates and nucleic acids, kinetics and mechanisms of enzymes, bioenergetics, and metabolism. Crosslisted as CHEM 351."}, {"courseNum": "CHEM 660", "courseName": "Adv Environmental Chemistry", "info": "Environmental chemodynamics, transport, abiotic transformation, biotransformation, environmental toxicology, pollutants, the environmental fate/effects of chemicals will be discussed. Prerequisite: CHEM 231 or permission of the instructor. Crosslisted as CHEM 360."}, {"courseNum": "CHEM 675", "courseName": "Graduate Research", "info": "Graduate research."}, {"courseNum": "CHEM 685", "courseName": "Seminar", "info": "Topics vary. Crosslisted as CHEM 385."}, {"courseNum": "CHIN 101", "courseName": "Chinese I", "info": "Intensive introduction to spoken and written \"Mandarin\" Chinese, the puutonghuah (common language) of modern China."}, {"courseNum": "CHIN 103", "courseName": "Chinese II", "info": "Continued rigorous study of spoken and written \"Mandarin\" Chinese now called puutonghuah (the common language). Prerequisite: CHIN 102 or equivalent."}, {"courseNum": "CHIN 201", "courseName": "Chinese III", "info": "Continued study of modern \"Mandarin.\"  Contemporary essays, movie scripts, short stories and newspaper articles.  Equal emphasis on reading and speaking.  Conducted in Chinese. Prerequisite: CHIN 104 or equivalent."}, {"courseNum": "CHIN 203", "courseName": "Chinese IV", "info": "Reading and discussion of selected modern Chinese texts: newspaper and magazine articles, essays, short stories, and film scripts.  Conducted in Chinese. Prerequisite: CHIN 202 or equivalent."}, {"courseNum": "CHIN 319", "courseName": "Independent Studies in Chinese", "info": "Independent projects conducted in Chinese in the student's area of special interest.  Prerequisite: permission of the instructor."}, {"courseNum": "CLAS 132", "courseName": "Roman Civilization", "info": "Introduction to Roman Civilization from Romulus to Constantine. Emphasis on social and cultural history, including literature, art, architecture, religion, and historiography in their cultural context."}, {"courseNum": "CLAS 215", "courseName": "Classical Myth", "info": "Study of the traditional tales of Greece and, to a lesser extent, the Near East and Rome; consideration and application of myth theory."}, {"courseNum": "CLAS 221", "courseName": "Heroic Epic", "info": "Interpretive study of Homer's Iliad and Odyssey and other epics chosen by the instructor (e.g., the Argonautica and Aeneid).  Study may include epic works of later traditions."}, {"courseNum": "CLAS 242", "courseName": "Archaeology of Greece", "info": "Survey of the material culture of the Greek world from the Bronze Age through the Hellenistic period. Crosslisted as ARTH 242."}, {"courseNum": "CLAS 311", "courseName": "Independent Study in Classics", "info": "Topics in classical civilization, to be chosen by the student.  Prerequisite: permission of the instructor."}, {"courseNum": "CLAS 321", "courseName": "Honors Tutorial and Thesis", "info": "Independent study and research leading to the writing of a thesis.  Prerequisite: permission of the instructor."}, {"courseNum": "CLAS 350", "courseName": "Seminar on a Classical Topic", "info": "Study of a topic of importance in classics.  Examples: a current problem, an important figure, a historical period. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 203", "courseName": "Introduction to Computer Science I", "info": "Overview of computing that explores relationships between computer organization, various programming approaches, limits to computing, and computing in society. Students solve computational problems using Python."}, {"courseNum": "CSCI 204", "courseName": "Introduction to Computer Science II", "info": "Introduction to data structures and algorithms using an object-oriented approach. Topics include software-engineering principles, object-oriented programming, recursion, basic data structures, algorithm analysis, and team programming. Prerequisite: CSCI 203 or permission of the instructor. Corequisite: MATH 201 or equivalent."}, {"courseNum": "CSCI 205", "courseName": "Software Engineering and Design", "info": "Fundamentals of software design and software engineering. Students will participate in large-scale, team-based software development project. Prerequisite: CSCI 204 or permission of the instructor."}, {"courseNum": "CSCI 311", "courseName": "Algorithms and Data Structures", "info": "Introduction to the algorithms and data structures used in implementing abstract data types including priority queues, dictionaries, and graphs. Includes complexity analysis of various implementations. Prerequisites: MATH 241 and CSCI 205 or permission of the instructor."}, {"courseNum": "CSCI 315", "courseName": "Operating Systems Design", "info": "Introduction to operating system design including processor management, scheduling, memory management, resource allocation, file systems, and concurrency. Prerequisite: CSCI 206."}, {"courseNum": "CSCI 320", "courseName": "Computer Architecture", "info": "Use hardware description language to describe and design digital systems. Processor design, pipelining, cache and storage systems. Instruction and thread level parallelism, speculation, branch prediction. Prerequisite: CSCI 315 or permission of the instructor."}, {"courseNum": "CSCI 340", "courseName": "Mobile Computing", "info": "Mobile computing ecosystem including apps, devices, wireless networks, and back-end systems. Includes at least one major project; the specific course content will vary based on projects, student interest, and current technology trends. This course typically includes a considerable amount of software development. Prerequisite: CSCI 206 or permission of instructor. Crosslisted as ECEG 430."}, {"courseNum": "CSCI 341", "courseName": "Theory of Computation", "info": "Finite automata, regular sets, pushdown automata, context-free grammars. Turing machines, recursive functions and undecidability. Prerequisite: MATH 241 or MATH 280."}, {"courseNum": "CSCI 376", "courseName": "Computer Science Honors Thesis", "info": "Independent work on computer science honors thesis. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 378", "courseName": "Individual Study in Computer Science", "info": "Independent study in computer science. Recent areas include graph algorithms, computer security, distributed computing, graphics, programming languages, software engineering, web retrieval. Prerequisites: junior standing and permission of the instructor."}, {"courseNum": "CSCI 379", "courseName": "Topics in Computer Science", "info": "Current topics of interest. Course may/may not require laboratory depending upon the topic. Prerequisite: permission of the instructor."}, {"courseNum": "CSCI 475", "courseName": "Senior Design I", "info": "A recognized software engineering methodology will be used with all phases of a senior design project. Written work will include a technical report about the project, a feasibility report, and a requirements specification document."}, {"courseNum": "CSCI 479", "courseName": "Computer Science Design Project", "info": "Students in teams use software engineering methodology to design and implement a semester-long project. Written reports and oral presentations are required. Prerequisites: CSCI 205 and senior standing in the College of Arts and Sciences and permission of the instructor."}, {"courseNum": "DANC 105", "courseName": "Jazz Dance Technique I", "info": "Beginning level course on jazz as an American vernacular dance form emphasizing its roots in African and Latin cultural rhythms, as well as contemporary technique. Crosslisted as AFST 105."}, {"courseNum": "DANC 120", "courseName": "Modern Dance Technique I", "info": "Beginning level technique emphasizing the basic principles of different modern dance styles, dynamics and alignment through floorwork, locomotor patterns, improvisation and movement combinations."}, {"courseNum": "DANC 220", "courseName": "Modern Dance Technique II", "info": "Intermediate level technique exploring the basic principles of different modern dance styles, alignment, dynamics, and musicality through floorwork, locomotor patterns and movement combinations. Prerequisite: DANC 120."}, {"courseNum": "DANC 240", "courseName": "Ballet Technique II", "info": "Intermediate level ballet course emphasizing the development of technique and performance aesthetics."}, {"courseNum": "DANC 250", "courseName": "History of Dance", "info": "Survey of Western and non-Western dance forms both as reflective of cultural history and as an art form from ancient times to the present."}, {"courseNum": "DANC 360", "courseName": "Rehearsal and Performance", "info": "Quarter-course credit for substantial participation in dance production. Prerequisite: permission of the instructor."}, {"courseNum": "EAST 213", "courseName": "Chinese Literature in Translation", "info": "Great works of modern and contemporary Chinese literature."}, {"courseNum": "EAST 234", "courseName": "China Since 1800", "info": "China from the eve of its modern confrontation with the West to the present through years of traumatic challenge and change. Crosslisted as HIST 294."}, {"courseNum": "EAST 252", "courseName": "Marketing Chinese Religions", "info": "Focus on the economies of Chinese religious institutions in modern and contemporary periods, with attention also paid to premodern precedents. Economics here indicates not only mechanisms of monetary exchange, but also negotiations of spiritual capital (ledgers of [de]merit) and of religious identities amidst rampant consumerism and commodification of sanctity. Crosslisted as RELI 245."}, {"courseNum": "EAST 255", "courseName": "Modern Japanese History", "info": "Japanese economy, society, politics, war, and diplomacy from 1868 to World War II; successes, crises, and conflicts in building a modern nation-state. Crosslisted as HIST 296."}, {"courseNum": "EAST 256", "courseName": "Contemporary Japanese History", "info": "Political and cultural history of post-World War II Japan using various sources including film, anime, art, political cartoon, popular song. Crosslisted as HIST 286."}, {"courseNum": "EAST 269", "courseName": "Chinese Politics", "info": "This examines China's rich political history, its dynamic economic and social changes, its lasting political culture, it enduring struggle for modernization, and its evolving relations with the rest of the world. Crosslisted as IREL 225 and POLS 225."}, {"courseNum": "EAST 321", "courseName": "Independent Study", "info": "Individual program of reading, research, or writing.  Prerequisite: permission of the instructor."}, {"courseNum": "EAST 322", "courseName": "Independent Study", "info": "Individual programs of reading, research, or writing.  Prerequisite: permission of the instructor."}, {"courseNum": "ECEG 101", "courseName": "Electrical and Computer Engineering Analysis", "info": "Introduction to concepts, voltage, current, signals, network elements, and Kirchhoff's laws. Electrical measurements, energy and information generation, storage and transmission. Introduction to logic circuits and switching theory. Not for majors in electrical and computer engineering. Students must have had or be taking MATH 202."}, {"courseNum": "ECEG 205", "courseName": "Electrical and Computer Engineering Fundamentals", "info": "Electrical measurement and physical quantities, sensors, sensor dynamics, and filters. Corequisite: MATH 202."}, {"courseNum": "ECEG 225", "courseName": "Circuit Theory I", "info": "DC circuits, steady-state analysis, impedance concepts, operational amplifiers, power calculations. Corequisite: MATH 211. Prerequisite: ECEG 120 or permission of the instructor."}, {"courseNum": "ECEG 308", "courseName": "Independent Study", "info": "Independent study for first-year students, sophomores, and juniors. Prerequisite: permission of the instructor."}, {"courseNum": "ECEG 320", "courseName": "Linear Systems and Signal Processing", "info": "Discrete and continuous signals; differential and difference equations; state equations; transform techniques (Z, Laplace, Fourier); analog and digital filter designs. Prerequisites: ECEG 226 and MATH 212."}, {"courseNum": "ECEG 350", "courseName": "Electronics I", "info": "Introduction to semiconductor components and circuits. Device physics, operation, and modeling; design applications of operational amplifiers, diodes, and transistors; PN junctions; digital logic gates. Prerequisite: ECEG 210 or ECEG 226 or permission of the instructor."}, {"courseNum": "ECEG 400", "courseName": "ECE Capstone Design I", "info": "Engineering capstone design focusing on problem identification, project planning and logistics, and learning the divergent/convergent engineering design process in Electrical & Computer Engineering. Year long capstone experience that concludes with ECEG 401. Prerequisite: ECEG 301 or permission of instructor."}, {"courseNum": "ECEG 430", "courseName": "Mobile Computing", "info": "Mobile computing ecosystem including apps, devices, wireless networks, and back-end systems. Includes at least one major project; the specific course content will vary based on projects, student interest, and current technology trends. This course typically includes a considerable amount of software development. Prerequisite: CSCI 206 or permission of instructor. Crosslisted as CSCI 340."}, {"courseNum": "ECEG 471", "courseName": "Applications of Probability in Electrical and Computer Engineering", "info": "Probability theory, random variables, probability mass/density functions, expected value, Gaussian distribution, detection, estimation, applications in electrical and computer engineering. Prerequisite: ECEG 320 or permission of the instructor. Crosslisted as ECEG 671."}, {"courseNum": "ECEG 480", "courseName": "Electrical Control Systems", "info": "System components: closed loop systems; stability from Nyquist and root locus viewpoints: performance, compensation techniques, sampled systems, Z-Transforms. Prerequisites: ECEG 320 and ECEG 350."}, {"courseNum": "ECEG 492", "courseName": "Solid State Optoelectronic Devices", "info": "Basic principles of solid-state devices. Semiconductor device equations developed from fundamental concepts. PN junction theory developed and applied to the analysis of devices such as solar cells and light emitting diodes. Emphasis on device physics rather than circuit applications. Prerequisite: PHYS 212 or permission of instructor. Crosslisted as ECEG 692."}, {"courseNum": "ECEG 495", "courseName": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical computation techniques for solving ordinary and partial differential equations relevant to engineering applications. Prerequisite: permission of the instructor.Crosslisted as CEEG 495 and CHEG 495 and MECH 495 and ENGR 695."}, {"courseNum": "ECEG 608", "courseName": "Advanced Independent Study", "info": "Advanced independent study for qualified graduate students. Prerequisite: Permission of the instructor."}, {"courseNum": "ECEG 630", "courseName": "Mobile Computing", "info": "This courses focuses on the mobile computing ecosystem including apps, devices, wireless networks, and back-end systems. The course includes at least one major project and the specific course content will vary based on projects, student interest, and current technology trends. This course typically includes a considerable amount of software development."}, {"courseNum": "ECEG 671", "courseName": "Applications of Probability in Electrical and Computer Engineering", "info": "Probability theory, random variables, probability mass/density functions, expected value, Gaussian distribution, detection, estimation, applications in electrical and computer engineering. Corequisite: ECEG 320 or permission of the instructor. Crosslisted as ECEG 471."}, {"courseNum": "ECEG 695", "courseName": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications."}, {"courseNum": "ECON 103", "courseName": "Economic Principles and Problems", "info": "General introduction to both macroeconomics and microeconomics, along with an introduction to economic history, international economics, and political economy. The course also examines the origin of economic ideas in the works of Adam Smith, John Maynard Keynes, Karl Marx, and others."}, {"courseNum": "ECON 201", "courseName": "Independent Study", "info": "Individual product or project supervised by a member of the economics department typically resulting in the production of a long research paper.  Prerequisite: permission of the instructor."}, {"courseNum": "ECON 222", "courseName": "Economic Topics", "info": "Selected issues in economic theory or policy.  Prerequisite: permission of the instructor."}, {"courseNum": "ECON 224", "courseName": "African Women & Social Action", "info": "Analysis of topics in films and novels by Ousmane Sembene: pre-colonial history, colonialism, post-colonial independence, racial and gender oppression, worker exploitation, religious conflict, and modernization. Prerequisite: ECON 103. Crosslisted as WMST 224."}, {"courseNum": "ECON 256", "courseName": "Intermediate  Microeconomic", "info": "Intermediate economic theory of the consumer, the firm, market structures, and resource allocation. Not open to students who have completed ECON 259. Prerequisite: ECON 103 and ACFM majors or permission of the instructor."}, {"courseNum": "ECON 257", "courseName": "Intermediate Macroeconomic", "info": "The study of national income, employment, inflation, interest rates, and the impact of monetary and fiscal policy on the economy. Prerequisite: ECON 103 and MATH 192 or MATH 201."}, {"courseNum": "ECON 258", "courseName": "Intermediate Political Economy", "info": "Intermediate study of Marxist and institutionalist political economy. The ideas of Marx and Veblen applied to such matters as the distribution of income and power, the environment, working conditions, consumerism, and race and gender issues. Prerequisite: ECON 103."}, {"courseNum": "ECON 259", "courseName": "Intermediate Mathematical Microeconomics", "info": "Intermediate microeconomic theory of the consumer, the firm, market structures, and resource allocation. Topics are introduced using differential calculus. Not open to students who have completed ECON 256. Prerequisites: ECON 103 and MATH 192 or MATH 201."}, {"courseNum": "ECON 273", "courseName": "Latin American Economic Development", "info": "The course deals with historic and contemporary economic problems, starting from colonial times and reaching the present integration into world economy. Crosslisted as LAMS 273."}, {"courseNum": "ECON 303", "courseName": "Game Theory", "info": "“Game Theory” is a set of ideas that help in analyzing strategic situations: situations in which multiple players — individual, groups, nations, organizations, even flora and fauna — interact and pursue their goals in situations of cooperation and conflict. Game theory has been applied to study strategic conflict and cooperation"}, {"courseNum": "ECON 304", "courseName": "Financial Economics", "info": "The course is focused on theory of finance and asset pricing. Topics include state pricing theory, capital asset pricing model, portfolio theory and risk aversion."}, {"courseNum": "ECON 337", "courseName": "International Monetary and Financial Economics", "info": "The course covers balance of payments, foreign exchange markets, international monetary systems, the adjustment mechanism, macroeconomic policy in an open economy and monetary integration. Prerequisites: ECON 256 or ECON 259 or permission of the instructor. Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 341", "courseName": "Econometrics", "info": "The application of statistical methods to quantify and test economic theories, analyze government policies, and forecast economic variables."}, {"courseNum": "ECON 357", "courseName": "Economic Development", "info": "The main theories of development; economic and social dualism; agricultural, industrial, and trade strategies; and the role of less developed countries in the emerging global economy. Prerequisites: ECON 256 or ECON 259 and ECON 257 and permission of the instructor. Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 418", "courseName": "American Economic History", "info": "An examination of the development and influence of American economic institutions from colonial to current times. Prerequisites: ECON 256 or ECON 259 and ECON 257, or permission of the instructor. Preference given to ECON and ECMA majors."}, {"courseNum": "ECON 420", "courseName": "The British Economic Miracle", "info": "This course examines the early British economy and the role it played and continues to play in influencing the modern world. Prerequisites: ECON 256 or ECON 259 and ECON 257."}, {"courseNum": "ECON 441", "courseName": "Advanced Econometrics", "info": "Advanced panel data methods, instrumental variables and two stage least squares, simultaneous equations, limited dependent variables, sample selection bias, advanced time series, and writing and presenting an empirical research project. Prerequisite: ECON 341."}, {"courseNum": "ECON 444", "courseName": "Senior Seminar in Economic Topics", "info": "Topics to be announced at the time of preregistration."}, {"courseNum": "EDUC 101", "courseName": "Social Foundation of Education", "info": "Historical, economic, philosophical, and social foundations of education, and their implications for present-day education in America. Provides a background of information for the prospective teacher and citizen. Not open to seniors."}, {"courseNum": "EDUC 201", "courseName": "Educational Psychology", "info": "Role of psychological concepts in educational practices. Nature, sources of individual differences in development and readiness. Learning theory, motivation, and emotion in learning.  Issues in identifying and supporting the learning of all students. Measurement and evaluation of learning."}, {"courseNum": "EDUC 290", "courseName": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Crosslisted as WMST 290 and EDUC 690."}, {"courseNum": "EDUC 312", "courseName": "Counseling Techniques", "info": "This course provides an introduction to counseling theory and basic micro-skills of counseling. Students will practice basic techniques of therapeutic interviewing. Crosslisted as EDUC 612."}, {"courseNum": "EDUC 315", "courseName": "Senior Thesis", "info": "Senior thesis.  Prerequisites: permission of the instructor and department."}, {"courseNum": "EDUC 317", "courseName": "Problems in Education", "info": "Research on a problem not involved in a student thesis. Upperclass students. Prerequisite: permission of the instructor. Crosslisted as EDUC 617."}, {"courseNum": "EDUC 318", "courseName": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education. Crosslisted as EDUC 618."}, {"courseNum": "EDUC 322", "courseName": "Psychology of the Exceptional Child", "info": "Understanding the psychology of the exceptional child from childhood through adolescence. Focused involvement in building an understanding of the diverse ways cognitive disabilities are manifested in children and adolescents with an emphasis on prevention, intervention and remediation. Optional fieldwork. Crosslisted as EDUC 622."}, {"courseNum": "EDUC 323", "courseName": "Education of Young Children", "info": "A conceptual-development overview of the social, emotional, cognitive, and physical characteristics of the early childhood years (to age 9) stressing extrapolation from developmental theory to educational practice for teachers and parents who function as the earliest educators. Crosslisted as EDUC 623."}, {"courseNum": "EDUC 335", "courseName": "Child & Adolescent Development", "info": "Social, emotional, cognitive, and physical development from age 6 to 21 in relation to the educational environment, including the interaction of the child with family, adults, and peers. Requires field work. Prerequisite: EDUC 201 is strongly recommended, but not required. Not open to students who have taken EDUC 334."}, {"courseNum": "EDUC 339", "courseName": "Inclusive Practices", "info": "Students will explore the unique instructional needs of L2 learners and students with disabilities and learn how to modify and adjust content, process, and product to enhance their development in inclusive classrooms. Required fieldwork."}, {"courseNum": "EDUC 344", "courseName": "Science as Inquiry", "info": "This course reflects best practices for the teaching of science as inquiry outlined by the National Science Education Standards and the PA State Standards. This course provides instructional methods and curricular materials appropriate for teaching science concepts, processes, and skills to young children. Prerequisites: EDUC 101 and EDUC 201. Crosslisted as EDUC 644."}, {"courseNum": "EDUC 349", "courseName": "Student Teaching: Elementary", "info": "Supervised practice in the design and implementation of instruction in elementary school classrooms. Emphasis on professional conduct and use of theory to inform practice. Students must be accepted into the Pre-CIP program, must have enrolled in all certification courses or obtain permission of the instructor.  Corequisite: EDUC 449. Crosslisted as EDUC 649."}, {"courseNum": "EDUC 351", "courseName": "Learning and Development in Postsecondary Education", "info": "Investigation of contemporary theories pertaining to the processes of learning and development that occur from later adolescence through old age. Crosslisted as EDUC 651."}, {"courseNum": "EDUC 355", "courseName": "Teaching of Science in Secondary School", "info": "Principles and practices of teaching biology, chemistry, physics, earth and space science, and environmental science in grades 7-12. Prerequisites: EDUC 101, EDUC 201, and EDUC 334 or EDUC 335 (EDUC 335 required for environmental science). Crosslisted as EDUC 655."}, {"courseNum": "EDUC 364", "courseName": "Qualitative Research Methods", "info": "This is an introduction to the foundations of qualitative design in education, including: history, philosophy, nature, types, examples, and the challenges associated with data collection and its interpretation. Crosslisted as EDUC 664."}, {"courseNum": "EDUC 425", "courseName": "Internship in Education", "info": "Supervised practice in an educational setting including a structured reflection component. This course may be used to fulfill the Culminating Experience course requirement for the B.A. in education."}, {"courseNum": "EDUC 449", "courseName": "Professional Seminar in Elementary Education", "info": "Systematic approach to the observation, interpretation, verification, and remediation of problems affecting student learning. Psychological and sociological theory informing teaching practice. Implications of student diversity for adaptation of instruction.  Prerequisites: EDUC 342, senior status, and permission of the instructor. Corequisite: EDUC 349."}, {"courseNum": "EDUC 612", "courseName": "Counseling Techniques", "info": "This course provides an introduction to counseling theory and basic micro-skills of counseling. Students will practice basic techniques of therapeutic interviewing. Crosslisted as EDUC 312."}, {"courseNum": "EDUC 618", "courseName": "Multiculturalism and Education", "info": "This course combines social science and educational research with narrative accounts to explore the historical, philosophical, sociological, and political foundations of the multicultural movement in American education. The course will examine and critique contemporary issues such as the educational experiences of minority groups, inclusive pedagogy, and bilingual education. Crosslisted as EDUC 318."}, {"courseNum": "EDUC 622", "courseName": "Psyc of  the Exceptional Child", "info": "Understanding the psychology of the exceptional child from childhood through adolescence. Focused involvement in building an understanding of the diverse ways cognitive disabilities are manifested in children and adolescents with an emphasis on prevention, intervention and remediation. Optional fieldwork. Crosslisted as EDUC 322."}, {"courseNum": "EDUC 623", "courseName": "Education of Young Children", "info": "A conceptual-developmental overview of the social, emotional cognitive, and physical characteristics of the early childhood years (to age 9) stressing extrapolation from developmental theory to educational practice for teachers and parents who function as the earliest educators. Crosslisted as EDUC 323."}, {"courseNum": "EDUC 639", "courseName": "Inclusive Practices", "info": "Students will explore the unique instructional needs of L2 learners and students with disabilities and learn how to modify and adjust content, process, and product to enhance their development in inclusive classrooms. Required fieldwork."}, {"courseNum": "EDUC 644", "courseName": "Science as Inquiry", "info": "This course reflects best practices for the teaching of science as inquiry outlined by the National Science Education Standards and the PA State Standards. This course provides instructional methods and curricular materials appropriate for teaching science concepts, processes, and skills to young children. Prerequisite: permission of instructor. Crosslisted as EDUC 344."}, {"courseNum": "EDUC 651", "courseName": "Learning and Development in Postsecondary Education", "info": "Investigation of contemporary theories pertaining to the processes of learning and development that occur from later adolescence through old age. Crosslisted as EDUC 351."}, {"courseNum": "EDUC 664", "courseName": "Qualitative Research Methods", "info": "This is an introduction to the foundations of qualitative design in education, including: history, philosophy, nature, types, examples, and the challenges associated with data collection and its interpretation. Crosslisted as EDUC 364."}, {"courseNum": "EDUC 680", "courseName": "Thesis", "info": "Independent study."}, {"courseNum": "EDUC 681", "courseName": "Master's Treatise", "info": "Master's Treatise. Prerequisite: permission of the instructor."}, {"courseNum": "EDUC 690", "courseName": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Prerequisite: permission of the instructor. Crosslisted as EDUC 290 and WMST 290."}, {"courseNum": "EDUC 697", "courseName": "College Stdnt Personnel Intern", "info": "Supervised practice in student affairs, together with group reflection. May be repeated for up to two credits. Prerequisite: permission of the instructor."}, {"courseNum": "ENCW 101", "courseName": "Creative Writing", "info": "Introduction to creative writing through the reading and writing of poetry and prose (fiction or creative nonfiction). Does not count toward the creative writing concentration or minor. Prerequisite: seniors by permission of the instructor."}, {"courseNum": "ENCW 102", "courseName": "Writing Fiction", "info": "In this introductory fiction workshop, students will read and discuss contemporary and classic texts with a writer’s eye. Completing fiction exercises and revisions as well as responding to one another’s work, they will use the techniques and habits of successful writers to enhance their own writing and creativity."}, {"courseNum": "ENCW 202", "courseName": "Fiction Workshop", "info": "Principles of writing fiction, with constant practice. Designed for students planning to concentrate or minor in creative writing. Preference given to juniors, sophomores, and first-year students. Restrictions: seniors by permission of the instructor."}, {"courseNum": "ENCW 204", "courseName": "Poetry Workshop", "info": "Principles of writing poetry, with constant practice. Designed for students planning to concentrate or minor in creative writing. Preference given to juniors, sophomores, and first-year students. Prerequisite: seniors by permission of the instructor."}, {"courseNum": "ENCW 210", "courseName": "Special Topic in Creative Writing", "info": "Studies in such topics as prosody, stylistics, characterization, or narrative theory. Course emphasizes formal or structural elements within particular genres and an appreciation of craft from a writer's perspective. Prerequisite: permission of the instructor."}, {"courseNum": "ENCW 237", "courseName": "Internship", "info": "Two competitive internships are offered: Stadler Center Internship provides practical experience in and insight into arts management; West Branch Internship provides practical experience in and insight into literary publishing. Prerequisite: permission of the instructor."}, {"courseNum": "ENCW 240", "courseName": "Ecopoetics", "info": "An exploration of poetry as site-specific ecological practice. Intended for students interested in both Creative Writing and Environmental Studies. Prerequisite: permission of the instructor. Crosslisted as ENST 227."}, {"courseNum": "ENCW 302", "courseName": "Advanced Fiction Workshop", "info": "Advanced workshop in the writing of fiction. Prerequisites: Any 200-level Creative Writing (ENCW) course in creative nonfiction or fiction and permission of the instructor. Crosslisted as ENCW 602."}, {"courseNum": "ENCW 304", "courseName": "Advanced Poetry Workshop", "info": "Advanced workshop in the writing of poetry. Prerequisites: Any 200-level Creative Writing (ENCW) course in poetry  and permission of the instructor. Crosslisted as ENCW 608."}, {"courseNum": "ENCW 319", "courseName": "Individual Projects in Creative Writing", "info": "Individual special projects supervised by instructor; honors thesis. Prerequisite: permission of the instructor."}, {"courseNum": "ENFS 130", "courseName": "Introduction to Film/Media Studies", "info": "Introduction to film grammar, history, genres, and movements using theoretical text and primary source films. Emphasis on critical thinking skills through video essay projects."}, {"courseNum": "ENFS 238", "courseName": "Special Topics in Film Studies", "info": "Examination of a specialized topic in film studies. Weekly screenings."}, {"courseNum": "ENFS 242", "courseName": "Film and Media History", "info": "This course examines major industrial, technical, and cultural milestones in the history of the cinema, radio, television, and new media industries. Weekly screenings."}, {"courseNum": "ENFS 245", "courseName": "Televisual Culture", "info": "This course focuses on non-cinematic moving image culture including the television industry, video art, and new media technologies. The course examines the subject from a variety of theoretical viewpoints—industrial practices, stylistic modes, and audience reception."}, {"courseNum": "ENFS 248", "courseName": "Intermediality: Italy, Film, and the Arts", "info": "This IP course will focus on intermediality, film, and Italy. It seeks to examine the relationships of cinema with the other arts, in particular the arts of Italy. Crosslisted as ITAL 248 and UNIV 248."}, {"courseNum": "ENFS 253", "courseName": "Introduction to Film/Media Production", "info": "An introductory level, studio-based course covering the basics of moving image practice, from pre-visualization to principles and techniques of cinematography, editing, lighting and sound. Students produce individual projects, developing both technical skills and personal vision. In-class screenings further students’ awareness of cinema’s expressive potential. Prerequisite: ENFS 130"}, {"courseNum": "ENFS 338", "courseName": "Seminar in Film and Digital Media Studies", "info": "A seminar in film and digital media studies. Topics may include the history of digital media, their relation to other media forms, the relations between critical reflection and media practice/production, and other relevant topics. Prerequisite: ENFS 130 or permission of the instructor. Crosslisted as HUMN 338."}, {"courseNum": "ENFS 340", "courseName": "Film/Media Production Practicum", "info": "The Film/Media Production Practicum provides students with advanced and specialized study in a particular area of Film/Media production. Possible practicum topics might include advanced sound design, color grading, visual effects works, or specialized cinematography techniques."}, {"courseNum": "ENGR 100", "courseName": "Exploring Engineering", "info": "Introduction to the study and practice of engineering, including overviews of specific disciplines. Participatory focus involves group design projects, hands-on learning, computer work, team building, and engineering ethics discussions. Permission of instructor required for non-first-year students."}, {"courseNum": "ENGR 211", "courseName": "Introduction to Chemical Engineering Computing", "info": "Programming fundamentals and introductory numerical methods. Problems drawn from mathematics and chemical engineering. With computational laboratory. Prerequisites: CHEG 200 and MATH 202. Not open to students who have taken ENGR 212 or ENGR 214."}, {"courseNum": "ENGR 230", "courseName": "Solid Mechanics II", "info": "Behavior of deformable systems: analysis for forces/stresses and deformation/strains due to axial, torsional, flexural, shear, and combined effects. Analysis of indeterminate systems and basic concepts of stability of compression member. Prerequisite: ENGR 229 (minimum grade of D)."}, {"courseNum": "ENGR 240", "courseName": "Science of Materials", "info": "Study of the relationships between atomic structure and observable properties of materials. Properties of metallic, ceramic, and polymeric materials. Selection of materials for engineering applications. Measurement and modification of material properties. With experimental laboratory. Pre/Corequisite: one of the following: CHEM 201, 211, 221, 222, or equivalent, or instructor permission."}, {"courseNum": "ENGR 248", "courseName": "Engineering Problems", "info": "Problems in engineering adapted to the needs of the students.  Prerequisite: permission of the instructor."}, {"courseNum": "ENGR 375", "courseName": "Should We Start This Company?", "info": "Project-centered course in entrepreneurship, generating new business ideas, and product or service design and development through business planning. Crosslisted as MIDE 375 and UNIV 375."}, {"courseNum": "ENGR 452", "courseName": "Interdisciplinary Senior Design I", "info": "Capstone design course emphasizing realization of engineered design solutions in interdisciplinary teams. Focus areas include problem definition, background research, solution generation, team skills, communication, and professional development. Emphasis placed on articulating, addressing, and validating customer-appropriate value proposition."}, {"courseNum": "ENGR 695", "courseName": "Adv Topics in Engr Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering application. Crosslisted as CHEG 495 and ECEC 495 and ECEG 695 and MECH 495 and CEEG 495."}, {"courseNum": "ENLS 101", "courseName": "Literature and Composition", "info": "Introduction to the critical study of literature and instruction in composition. First-year students only; others by permission of the instructor."}, {"courseNum": "ENLS 109", "courseName": "Public Speaking in the 21st Century", "info": "Introduction to public speaking with a focus on historical speeches. Study and practice of speech writing and organization, verbal and nonverbal communication."}, {"courseNum": "ENLS 199", "courseName": "Survey of Literatures in English", "info": "A survey of major authors, texts, concepts, and developments in English and American literature with participation of weekly guest lecturers from the English department."}, {"courseNum": "ENLS 212", "courseName": "Contemporary American Literature", "info": "Study of selected texts by American writers from 1950 to the present."}, {"courseNum": "ENLS 215", "courseName": "Asian American Literature and Film", "info": "This course introduces students to significant 20th-century Asian American literary texts, plus recent work by emerging writers and filmmakers that may suggest new directions for the field. May include Miné Okubo, Maxine Hong Kingston, David Henry Hwang, Jhumpa Lahiri, Bao Phi, Ang Lee, Jennifer Phang, others. No prior knowledge necessary."}, {"courseNum": "ENLS 216", "courseName": "Studies in American Literary Genres", "info": "Study of a selected genre of texts in American Literature."}, {"courseNum": "ENLS 218", "courseName": "Studies in Children's Literature", "info": "Fairy tales, fantasy, animal fables, and tales of adventure from 19th - 20th centuries, with a sampling of contemporary films, primarily American."}, {"courseNum": "ENLS 220", "courseName": "Young Adult Fiction", "info": "Study of literature that appeals to adolescent and young adult readers, with particular emphasis on British and American fiction and non-fiction prose from the 19th century to the present."}, {"courseNum": "ENLS 221", "courseName": "Introduction to African American Literature", "info": "Provides a selection from across the vast array of examples collected under the inadequate rubric “African American Literature.” We'll read poetry, fiction, non-fiction, and drama in order to understand how a group of people who have been written out of American history and culture write themselves back into these stories. Crosslisted as AFST 221."}, {"courseNum": "ENLS 222", "courseName": "Ethnic Comedy in the United States", "info": "History, theory, and practice of comedy in the United States, focused on works by comedians of many ethnicities. The course explores how comedy contributes to the national conversation on race, sometimes soothing social tensions with laughter and at other times sparking ethnic conflict."}, {"courseNum": "ENLS 227", "courseName": "Caribbean Literature", "info": "Introduction to selected literatures, cultures, and histories of the Caribbean, with close analysis of text and context. When taught in the summer, the course is the core of the Bucknell in the Caribbean summer study abroad program. Crosslisted as AFST 222."}, {"courseNum": "ENLS 258", "courseName": "Studies in Shakespeare", "info": "Studies in such special topics as \"Shakespeare and Film\", \"Shakespeare's History Plays,\" \"Psychoanalysis and Shakespeare\"."}, {"courseNum": "ENLS 270", "courseName": "Romantic Literature, 1780-1832", "info": "Examination of selected authors in poetry and prose, read in relationship to contemporary political and cultural influences."}, {"courseNum": "ENLS 286", "courseName": "The Modern Novel", "info": "Selected major novelists (English, Irish, continental, American)."}, {"courseNum": "ENLS 290", "courseName": "Special Topics", "info": "Flexible in subject matter and in method. Topics such as Literature and Psychology, Literature and Myth, Science Fiction."}, {"courseNum": "ENLS 297", "courseName": "The Teaching of English", "info": "Discussion and practice related to the teaching of English in secondary schools. Required for 7 - 12 certification in English."}, {"courseNum": "ENLS 300", "courseName": "Seminar in Literary Theory and Criticism", "info": "Introduction to graduate study, including literary and critical theory, research, and other elements of literary scholarship. Open to advanced undergraduates. Crosslisted as ENLS 600."}, {"courseNum": "ENLS 319", "courseName": "Individual Projects in Literary Studies", "info": "Individual special projects supervised by instructor. Prerequisite: permission of the instructor. Crosslisted as ENLS 619."}, {"courseNum": "ENLS 326", "courseName": "Seminar in Irish Literature", "info": "Advanced topics in Irish literature including Irish Women Writers, Nationalism and Literature, and Contemporary Irish Writers. Prerequisite: permission of the instructor. Crosslisted as ENLS 626."}, {"courseNum": "ENLS 341", "courseName": "The Hidden God of Nature: Christian Ecopoetics from Chaucer to Dostoevsky", "info": "Explores how great works of European and American literature related nature and culture in Christian traditions from the Middle Ages to today. Analyzes their legacy for environmental ethics and sustainable cultures. Includes non-Christian and secular critiques in considering poetic, rhetorical, symbolic, philosophical, and spiritual approaches to ecology. Crosslisted as ENST 341 and ENLS 641."}, {"courseNum": "ENLS 378", "courseName": "Thesis Workshop", "info": "A colloquium on problems arising from the writing of a scholarly thesis. Prerequisite: permission of the instructor. Crosslisted as ENLS 678."}, {"courseNum": "ENLS 380", "courseName": "Honors Thesis", "info": "The writing of a scholarly or creative honors thesis. Students must confer with and submit a proposal to a departmental adviser and to the University Honors Council for approval. Prerequisites: senior status."}, {"courseNum": "ENLS 394", "courseName": "History of Sexuality", "info": "A cross-cultural and interdisciplinary examination of the signification of sexuality in literature, philosophy, scientific discourse, and the visual arts. Crosslisted as ENLS 694 and HUMN 320 and WMST 325."}, {"courseNum": "ENLS 397", "courseName": "Seminar in Special Topics", "info": "Topics such as comparative literature, literature and the arts, queer theory, or satire. Crosslisted as ENLS 697."}, {"courseNum": "ENLS 600", "courseName": "Seminar in Literary Theory", "info": "Introduction to graduate study, including literary and critical theory, research, and other elements of literary scholarship. Prerequisite: permission of the instructor. Crosslisted as ENLS 300."}, {"courseNum": "ENLS 619", "courseName": "Individual Projects in Literary Studies", "info": "Individual special projects supervised by instructor; honors thesis. Prerequisite: permission of the instructor. Crosslisted as ENLS 319."}, {"courseNum": "ENLS 626", "courseName": "Seminar in Irish Literature", "info": "Advanced topics in Irish literature, including Irish Women Writers, Nationalism and Literature, and Contemporary Irish Writing. Prerequisite: permission of the instructor. Crosslisted as ENLS 326."}, {"courseNum": "ENLS 641", "courseName": "The Hidden God of Nature: Christian Ecopoetics from Chaucer to Dostoevsky", "info": "Explores how great works of European and American literature related nature and culture in Christian traditions from the Middle Ages to today. Analyzes their legacy for environmental ethics and sustainable culture. Includes non-Christian and secular critiques in considering poetic, rhetorical, symbolic, philosophical, and spiritual approaches to ecology. Crosslisted as ENLS 341 and ENST 341."}, {"courseNum": "ENLS 678", "courseName": "Thesis Workshop", "info": "A colloquium on the writing of a scholarly thesis. Prerequisite: permission of the instructor. Crosslisted as ENLS 378."}, {"courseNum": "ENLS 697", "courseName": "Seminar in Special Topics", "info": "Topics such as comparative literature, literature and the arts, queer theory, or satire. Prerequisite: permission of the instructor. Crosslisted as ENLS 397."}, {"courseNum": "ENST 100", "courseName": "Introduction to Environmental Studies", "info": "A survey of environmental issues intended for non-majors. Students will understand the cultural, political, historical, economic and ethical complexities of environmental problems and their responses. Intended for first-year students and sophomores. Does not count toward either the Environmental Studies or Environmental Science major."}, {"courseNum": "ENST 113", "courseName": "Human Impact on Environment", "info": "Causes and effects of major environmental changes induced by humans, challenges to our future well-being, and opportunities for future sustainability. Prerequisite: open to first-year students only. Crosslisted as GEOG 113."}, {"courseNum": "ENST 201", "courseName": "Environmental Problems-Sustainable Futures", "info": "Develops a working understanding of the core concepts linked to ENST & introduces skills such as posing researchable questions, gathering data, presenting oral arguments, & applying these skills in group projects. For 1st & 2nd yr. students majoring/intending to major in ENST or ENSC. Jr & Sr by permission."}, {"courseNum": "ENST 208", "courseName": "Environmental Biology", "info": "Introduction to ecology and evolutionary biology, organism interactions with environment, biodiversity, energy flow, and nutrient cycling, with emphasis on human influences on living systems and applications of evolutionary biology and ecology to solving environmental problems. This course is intended primarily for students majoring in environmental studies."}, {"courseNum": "ENST 209", "courseName": "Rainforests and Ecopolitics in Latin America", "info": "Focusing on Amazonia as a key region in global environmental politics, the course examines climate policy debates and recent shifts in global environmentalism. Crosslisted as ANTH 202 and LAMS 202."}, {"courseNum": "ENST 215", "courseName": "Environmental Planning", "info": "Explores the main approaches to planning theory and their environmental applications. Considers how environmental planning can promote the socio-ecological health and sustainability of democratic communities. Crosslisted as GEOG 215."}, {"courseNum": "ENST 221", "courseName": "Hazardous Waste and Society", "info": "Hazardous waste regulation, risk assessment and toxicology, overview of treatment technologies and site investigation, environmental audits, facilities siting and public participation, pollution prevention. Not open to engineering students, and also not open to students who have taken CEEG 444."}, {"courseNum": "ENST 227", "courseName": "Ecopoetics", "info": "An exploration of poetry as site-specific ecological practice. Intended for students interested in both Creative Writing and Environmental Studies. Prerequisite: permission of the instructor. Crosslisted as ENCW 240."}, {"courseNum": "ENST 230", "courseName": "Introduction to Sustainable Design", "info": "The application of basic sustainability principles to multiple design scales, including consumer products, buildings, communities, and landscapes. Emphasis is placed on the campus and its surrounding community as a living laboratory for design experimentation. Open to first year, sophomore, and junior students. Seniors by permission only."}, {"courseNum": "ENST 240", "courseName": "Sustainable Resource Management", "info": "Focuses on problem-oriented policy analysis of domestic and international environmental issues including ecosystem management, endangered species, protected areas, and community-based conservation."}, {"courseNum": "ENST 245", "courseName": "Environmental Policy and Politics", "info": "An introduction to understanding the role of political institutions, stakeholders and policy processes (in the U.S. and internationally) in addressing environmental problems. Crosslisted as POLS 291."}, {"courseNum": "ENST 254", "courseName": "Environmental Humanities", "info": "Explores humanistic perspectives on the environment--from history, ethics, literature, religion, and the arts--including how these perspectives complement or unsettle knowledge about nature from the sciences."}, {"courseNum": "ENST 302", "courseName": "Community-Based Research Design", "info": "Students will learn quantitative and qualitative research methods related to environmental studies including research design, data collection, and analysis. Prerequisite: junior or senior status. Preference to Environmental Studies majors, others by permission of the instructor."}, {"courseNum": "ENST 325", "courseName": "Nature, Wealth and Power", "info": "A seminar in political ecology that explores the historical, social political and economic dimensions of environmental change in developing regions. First-year students and sophomores by permission only.  Prerequisite: permission of the instructor.  Crosslisted as GEOG 325."}, {"courseNum": "ENST 341", "courseName": "The Hidden God of Nature: Christian Ecopoetics from Chaucer to Dostoevsky", "info": "Explores how great works of European literature related nature and culture in Christian traditions from the 14th to the 19th century. Analyzes their legacy for environmental ethics and cultural creativity as part of sustainability today. Includes non-Christian  and secular critiques in considering poetic, rhetorical, symbolic,  and spiritual  approaches to ecology. Crosslisted as ENLS 341 and ENLS 641."}, {"courseNum": "ENST 345", "courseName": "Food and the Environment", "info": "Nothing from the environment is more important than food production, nothing affects the environment more; we'll study both environmental and social circumstances. Laboratory science course. Crosslisted as GEOG 345."}, {"courseNum": "ENST 349", "courseName": "Senior Thesis", "info": "Independent thesis work under adviser's supervision.  Prerequisite: permission of the instructor."}, {"courseNum": "ENST 356", "courseName": "Nationalism, Identity and Nature", "info": "This course explores: the politics and geographies of nationalism; how nature is nationalized; the various ways ethnocentrism, racism, and sexism become part of national identity construction; ideas about and representations of nature in environmental contestations and in reactions to nationalism; and the intersection of nationalism with other social constructions. Crosslisted as POLS 356 and IREL 356."}, {"courseNum": "FOUN 098", "courseName": "Foundation Seminar", "info": "A small writing-intensive first-year seminar. Also see RESC 098."}, {"courseNum": "FREN 101", "courseName": "Discovering French", "info": "Beginning language skills. Practice in listening, speaking, reading, and writing; elementary grammar; and introduction to French civilization. Prerequisite: no more than two years of secondary school French or permission of the instructor."}, {"courseNum": "FREN 102", "courseName": "Exploring French", "info": "Continuation of language skills. Practice in listening, speaking, reading, and writing; grammar; readings in literature and civilization. Prerequisite: FREN 101 or one year of secondary school French."}, {"courseNum": "FREN 103", "courseName": "Building Proficiency in French", "info": "A review of basic grammar emphasizing all four language skills and culture. Prerequisite: FREN 102 or equivalent (three years of secondary school French)."}, {"courseNum": "FREN 104", "courseName": "Communicating in Context", "info": "Continuing review of basic grammar emphasizing all four language skills and culture. Prerequisite: FREN 103 or four years of secondary school French."}, {"courseNum": "FREN 201", "courseName": "Intermediate French Conversation I", "info": "Concentration on development of speaking skill. Conducted entirely in French by native speaker. Not open to students who have studied in France or other French-speaking countries. Intended for students enrolled in 200-level courses. Prerequisite: FREN 104 or FREN 150 or equivalent. (Cannot be applied toward the French major or minor)"}, {"courseNum": "FREN 230", "courseName": "French Literature I", "info": "Introduction to history of French literature from the Middle Ages to the French Revolution. Provides an introduction to literary history and methods of critical reading. A comprehensive survey. Prerequisite: FREN 104."}, {"courseNum": "FREN 236", "courseName": "Topics in Francophone Literature and Culture", "info": "Study of the literature, language, geography, history, music, and film of a particular Francophone region (French Caribbean, Quebec, West Africa, Maghreb, etc.). Prerequisite: FREN 104."}, {"courseNum": "FREN 301", "courseName": "Advanced French Conversation I", "info": "Advanced conversation for students who have studied in France or other French-speaking countries. Conducted entirely in French by native speaker. May not be taken by native speakers of French.(Cannot be applied toward the French major or minor)"}, {"courseNum": "FREN 327", "courseName": "Twentieth-Century Studies", "info": "Topics vary and could focus on a period, a genre, a group of writers, or a theme from the 20th or 21st century. Prerequisite: FREN 104 or FREN 150."}, {"courseNum": "FREN 380", "courseName": "Eating Ethics in Translation", "info": "Study of translation theory and practice through contemporary texts dealing with food politics and ethics in the French and Francophone world."}, {"courseNum": "FREN 390", "courseName": "Independent Study", "info": "Subject to be selected by student in consultation with the instructor.  Prerequisite: permission of the instructor."}, {"courseNum": "GEOG 101", "courseName": "Globalization, People, and Place", "info": "Investigates the world from a spatial perspective to understand the complexity of places and the dynamic relationship between peoples and the world they inhabit. Open to first-years and sophomores."}, {"courseNum": "GEOG 113", "courseName": "Human Impact on Environment", "info": "Causes and effects of major environmental changes induced by humans, challenges to our future well-being, and opportunities for future sustainability. Prerequisite: open to first-year students only. Crosslisted as ENST 113."}, {"courseNum": "GEOG 210", "courseName": "Urban Condition", "info": "Geographic and sociological inquiry into pressing urban issues of advanced industrialized societies, including inequality, housing, employment, and how cities fit into the American present and future. Crosslisted as SOCI 210."}, {"courseNum": "GEOG 215", "courseName": "Environmental Planning", "info": "Explores the main approaches to planning theory and their environmental applications. Considers how environmental planning can promote the socio-ecological health and sustainability of democratic communities. Crosslisted as ENST 215."}, {"courseNum": "GEOG 216", "courseName": "Borders and Politics of Mobility", "info": "Explores the politics of contemporary nation state borders, issues of territory, sovereignty, mobility, migration, identity, citizenship, statelessness, and focuses on borders at other scales. Crosslisted as IREL 216."}, {"courseNum": "GEOG 218", "courseName": "Geographies of Justice", "info": "This course will focus on  the role  of space for questions of justice  and social change.  Drawing on scholarship in geography and cognate disciplines, students will examine how social structures that privilege dominant groups embed to produce spatial inequality and marginality across the globe."}, {"courseNum": "GEOG 228", "courseName": "Media, Space and Place", "info": "This course will explore the power implications of the connections between media and place. Media is shaped by places and society just as much as it shapes them. In the context of “fake news” and social media echo chambers, this course will query the continued relevance of media's \"where\"."}, {"courseNum": "GEOG 324", "courseName": "Geographies of Identity", "info": "Who are \"we\"? Seminar considers role of space in constituting society around the world. Explores nationalism, globalization, multiculturalism, citizenship, race, ethnicity, gender, sexuality, age, disability. Prerequisite: first-year students by permission only. Crosslisted as WMST 324."}, {"courseNum": "GEOG 325", "courseName": "Nature, Wealth and Power", "info": "A seminar in political ecology that explores the historical, social political and economic dimensions of environmental change in developing regions. First-year students and sophomores by permission only. Crosslisted as ENST 325."}, {"courseNum": "GEOG 345", "courseName": "Food and the Environment", "info": "Nothing from the environment is more important than food production, nothing affects the environment more; we'll study both environmental and social circumstances. Laboratory science course. Crosslisted as ENST 345."}, {"courseNum": "GEOG 350", "courseName": "Classical Marxism", "info": "The goal is to develop an understanding of Marx's analysis of capitalism by reading mainly original texts by Marx and consider its applications to disciplinary thinking. Crosslisted as ECON 350."}, {"courseNum": "GEOL 203", "courseName": "Physical/Environmental Geology", "info": "Introduction to Earth's dynamic systems, plate tectonic processes that make Earth a unique planet, and human interaction with Earth. Geologic factors and limitations that affect use or management of the environment. Not open to students who have taken GEOL 250. Prerequisite: first- or second-year status, others by permission."}, {"courseNum": "GEOL 230", "courseName": "Environmental GIS", "info": "Geographic Information Systems (GIS) in geologic mapping, environmental monitoring, and hydrologic modeling. Introduction to global positioning,(GPS), environmental databases, spatial analyses, and terrain modeling."}, {"courseNum": "GEOL 309", "courseName": "Sedimentology and Stratigraphy", "info": "Principles and techniques of the study of depositional processes and environments. Emphasis on semester-long sedimentary basin analysis project including analysis of Paleozoic outcrops near campus. Prerequisite: GEOL 204."}, {"courseNum": "GEOL 316", "courseName": "Geomorphology", "info": "Physical processes shaping the Earth's surface and evolution of resulting landforms. Emphasis on linkages between landscape components and understanding complex relationships between process and form. Prerequisite: GEOL 203 or GEOL 250 or permission of the instructor. Crosslisted as GEOL 616."}, {"courseNum": "GEOL 319", "courseName": "Undergraduate Research", "info": "Research course for qualified students in any branch of geology.  Prerequisite: permission of the instructor."}, {"courseNum": "GEOL 321", "courseName": "Special Topics in Geology", "info": "Investigation, report, or discussion on currently significant topics in geology.  Prerequisite: permission of the instructor."}, {"courseNum": "GEOL 340", "courseName": "Igneous and Metamorphic Petrology", "info": "This class examines the mineralogy, petrography, geochemistry, origin and tectonic significance of igneous and metamorphic rocks. Prerequisite: GEOL 304."}, {"courseNum": "GLBM 301", "courseName": "Global Supply Chain Management", "info": "In this course students will learn the concepts and tools to model, analyze and improve global supply chain operations under a variety of contexts. Prerequisite: MGMT 102 or MATH 216 or permission of the instructor."}, {"courseNum": "GLBM 302", "courseName": "The Global Flow of Capital", "info": "This course will explore the challenges of financial management in a global context. Prerequisite: MGMT 203 or ACFM 370 or permission of the instructor."}, {"courseNum": "GLBM 310", "courseName": "Independent Study in Global Management", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of instructor."}, {"courseNum": "GREK 101", "courseName": "Introductory Ancient Greek", "info": "An introduction to the classical and koine forms of the language.  Emphasis upon forms and grammar, and rapid development of facility in reading."}, {"courseNum": "GREK 151", "courseName": "Intermediate Greek", "info": "Study of selected works in Greek, including such authors as Homer, Euripides, Herodotus, Lysias, Plato, Xenophon. Review of forms and grammar. Prerequisite: GREK 102 or equivalent."}, {"courseNum": "GREK 221", "courseName": "Studies in Greek Literature", "info": "Study of a topic or author focusing on original Greek texts (e.g., Herodotus, Homer, Sophocles, Plato, New Testament). Highly recommended for students anticipating application to graduate programs in classics or divinity. Prerequisite: GREK 151 or equivalent."}, {"courseNum": "GRMN 101", "courseName": "Exploring Your World", "info": "Beginning language skills. Practice in listening, speaking, reading, and writing; elementary grammar; and introduction to German culture."}, {"courseNum": "GRMN 103", "courseName": "Building Proficiency in German", "info": "A continuation and review of basic grammar, emphasizing all four language skills and culture. Prerequisite: GRMN 102 or equivalent."}, {"courseNum": "GRMN 201", "courseName": "Strategies in Speaking German", "info": "Concentration on development of speaking skills. Conducted in German by native speaker. Intended for students enrolled in 200 and 300-level courses. Co/prerequisite: GRMN 103 or equivalent."}, {"courseNum": "GRMN 204", "courseName": "German Conversation and Composition", "info": "Intensive practice in speaking and writing German. Prerequisite: GRMN 104 or equivalent."}, {"courseNum": "GRMN 230", "courseName": "Genre and History: Introduction to German Studies", "info": "Examination of a genre and its historical development with an emphasis on developing a critical approach to the reading of texts. Prerequisite: GRMN 204 or equivalent."}, {"courseNum": "GRMN 390", "courseName": "Independent Projects in German Studies", "info": "Subject to be selected by the student in consultation with the instructor.  Prerequisite: permission of the instructor."}, {"courseNum": "GRMN 419", "courseName": "Culminating Experience", "info": "Independent study with a faculty member to prepare an oral presentation for annual German Studies Mini-Conference. Prerequisite: permission of the instructor."}, {"courseNum": "HEBR 101", "courseName": "Beginning Modern Hebrew", "info": "Introduction to modern Hebrew. Practice in listening, speaking, reading, and writing, elementary grammar and introduction to Israeli culture."}, {"courseNum": "HEBR 390", "courseName": "Independent Study", "info": "Modern Hebrew at the intermediate level. Prerequisites: HEBR 102 and permission of the instructor."}, {"courseNum": "HIST 100", "courseName": "Thinking about History", "info": "Focus and content vary. An introductory history course for the development of informed historical analysis among its students. Primarily for first-year students."}, {"courseNum": "HIST 204", "courseName": "American Identities", "info": "This course challenges you to think about what it means to claim an American identity and who gets to determine that status. It covers issues related to notions of race, immigration, nationalization, deportation, and citizenship."}, {"courseNum": "HIST 207", "courseName": "U.S. and the World since 1945", "info": "This course examines the history of United States foreign relations since 1945. Course themes include the effort to construct a stable, prosperous world following World War II, the global Cold War, the evolving significance of the developing world, and the challenges of the post-Cold War world."}, {"courseNum": "HIST 208", "courseName": "Human Rights", "info": "This course examines the changing relationship between human rights in U.S. foreign policy during World War II, the Cold War, the early post-Cold War era, and the War on Terror. We will examine U.S. foreign policy and non-state actors, transnational advocacy networks, and international organizations."}, {"courseNum": "HIST 214", "courseName": "Topics in American History", "info": "Topics vary."}, {"courseNum": "HIST 220", "courseName": "American Civil War and Reconstruction", "info": "The period is studied in depth as a revolutionary era through attention to political, economic, social, constitutional/legal, intellectual trends, events, personae, movements, and institutions."}, {"courseNum": "HIST 222", "courseName": "U.S. History from the 1940s to the Present", "info": "This course examines the creation of modern America from World War II to the present."}, {"courseNum": "HIST 224", "courseName": "Eighteenth-century North America", "info": "A course that explores how different peoples (British, French, and American) claimed and fought over the environments of North America, shaping today's national borders."}, {"courseNum": "HIST 237", "courseName": "The Renaissance", "info": "This course focuses upon the major religious, social, artistic, literary, and political constructs of the influential thinkers of the European Renaissance, 1300-1600."}, {"courseNum": "HIST 247", "courseName": "Topics in European History", "info": "Intensive study of leading themes in European history since 1400. Topics will vary but may include economic and political structures, intellectual movements, or social and cultural history."}, {"courseNum": "HIST 250", "courseName": "Medieval and Early Modern Russia", "info": "This course provides a survey of the principal events and themes in Russian history from the ninth through the early 18th century."}, {"courseNum": "HIST 265", "courseName": "20th Century World Wars", "info": "Offers a global perspective in examining the causes, events and consequences of World War I and World War II."}, {"courseNum": "HIST 286", "courseName": "Contemporary Japanese History", "info": "Political and cultural history of post-World War II Japan using various sources including film, anime, art, political cartoon, popular song. Crosslisted as EAST 256."}, {"courseNum": "HIST 294", "courseName": "China since 1800", "info": "China from the eve of its modern confrontation with the West to the present through years of traumatic challenge and change. Crosslisted as EAST 234."}, {"courseNum": "HIST 296", "courseName": "Modern Japanese History", "info": "Japanese economy, society, politics, war, and diplomacy from 1868 to World War II; successes, crises, and conflicts in building a modern nation-state. Crosslisted as EAST 255."}, {"courseNum": "HIST 321", "courseName": "American Immigrants", "info": "This course explores the history and consequences of American immigration. The cultural practices, work, political activism and nativist challenges to various immigrant groups will be covered. Not open to first-year students."}, {"courseNum": "HIST 330", "courseName": "European History", "info": "Intensive study of selected issues. Topics vary."}, {"courseNum": "HIST 350", "courseName": "Honors Thesis", "info": "Credit may be taken either in one semester of the senior year or throughout the senior year."}, {"courseNum": "HUMN 100", "courseName": "The Humanities Now!", "info": "A multi-section course in the humanities that introduces students to the humanities world through use of latest tools and methods of analysis. Open to first-years and sophomores only."}, {"courseNum": "HUMN 128", "courseName": "Myth, Reason, Faith", "info": "An introduction to the most significant works (literature, poetry, theatre, philosophy, religious texts) in the Western and Asian intellectual traditions, extending from ancient Mesopotamia and Greece through late medieval Europe and/or East Asia. Not open to students who have completed RESC 098 \"Myth, Reason, Faith\". Seniors by permission only."}, {"courseNum": "HUMN 250", "courseName": "Modernism and Crisis", "info": "Traces the development of \"modernity\" (and its discontents) by looking at selected interdisciplinary texts and documents - from philosophy, literature, psychology, film, art, and other related disciplinary fields - that reflect or directly address cultural transformation during the 20th century. Crosslisted as ENLS 230 and UNIV 230."}, {"courseNum": "HUMN 319", "courseName": "Independent Study", "info": "Individual project of study supervised by instructor.  Prerequisite: permission of the instructor. Crosslisted as HUMN 619."}, {"courseNum": "HUMN 320", "courseName": "History of Sexuality", "info": "A cross-cultural and interdisciplinary examination of the signification of sexuality in literature, philosophy, scientific discourse, and the visual arts.  Prerequisite: permission of the instructor.  Crosslisted as ENLS 394 and WMST 325."}, {"courseNum": "HUMN 350", "courseName": "Senior Thesis Workshop", "info": "A colloquium on issues arising from the writing of a scholarly thesis.  Prerequisite: permission of the instructor."}, {"courseNum": "IREL 200", "courseName": "International Relations: Topics/Issues", "info": "Selected topics in international relations."}, {"courseNum": "IREL 216", "courseName": "Borders and Politics of Mobility", "info": "Explores the politics of contemporary nation state borders, issues of territory, sovereignty, mobility, migration, identity, citizenship, statelessness, and focuses on borders at other scales. Crosslisted as GEOG 216."}, {"courseNum": "IREL 222", "courseName": "Indigenous Americas: Environment, Development, and Change", "info": "With a focus on the region we now call Latin America, this course examines historical struggles over indigenous identity and land, and contemporary alternatives to colonial development. Crosslisted as LAMS 222."}, {"courseNum": "IREL 225", "courseName": "Chinese Politics", "info": "This course examines China's rich political history, its dynamic economic and social changes, its lasting political changes, its enduring struggle for modernization, and its evolving relations with the rest of the world. Crosslisted as EAST 269 and POLS 225."}, {"courseNum": "IREL 229", "courseName": "Middle East Conflict and Revolution", "info": "This course explores some of the most significant controversies, conflicts, revolutions, and resolutions, both historical and contemporary, that define the Middle East as a region."}, {"courseNum": "IREL 240", "courseName": "Human Security", "info": "Explores emerging debates around human vulnerability and: conflict, climate change, displacement, development, and other forms of \"security.\""}, {"courseNum": "IREL 250", "courseName": "Theories of International Relations", "info": "Analysis and evaluation of main theories of international relations, including realist, neo-realist, liberal, neo-liberal, Gramscian, Marxist, feminist, and post-modernist approaches. Theories are related to the major dimensions of international relations. Prerequisites: POLS 170. Preference given to second semester sophomores and junior IREL majors."}, {"courseNum": "IREL 265", "courseName": "Culture, Identity, and Power", "info": "Students will learn a range of theories and concepts that explain how gender, race, ethnicity, sexuality, class, nationality, religion, and other forms of difference shape and are shaped by international affairs."}, {"courseNum": "IREL 276", "courseName": "Comparative Foreign Policy", "info": "This course is designed to introduce students to the theories that have been developed to explain foreign policy processes and foreign policy behavior. The course will also examine and discuss the foreign policies of specific international actors. Crosslisted as POLS 276."}, {"courseNum": "IREL 356", "courseName": "Nationalism, Identity and Nature", "info": "This course explores the geographies and politics of nationalism, the ways in which nature is nationalized, the construction of nature in environmental contestations and reactions to nationalism, and the intersection of nationalism with other social constructions. Crosslisted as ENST 356 and POLS 356."}, {"courseNum": "IREL 381", "courseName": "Arab-Israeli Conflict, Peace Process", "info": "This course examines the failures and successes of the peace process among Israel, Arab States, and Palestinians. Special focus is on Oslo peace process, outstanding issues, and the involvement of outside actors, particularly the role of the US. Prerequisite: POLS 170 or permission from instructor. Crosslisted as POLS 381."}, {"courseNum": "IREL 415", "courseName": "Human Rights", "info": "The seminar will study human rights, primarily from an international perspective, including self-determination, cultural rights, ethnic and racial rights, women's rights, religious rights, and lesbian and gay rights. Prerequisite: permission of the instructor. Preference given to international relations majors. Crosslisted as POLS 389."}, {"courseNum": "IREL 444", "courseName": "Global Natures", "info": "This course engages debates about the politics of nature and natural resources in a global context. We examine struggles over how to define nature and how to organize human relationships with their environment, raising questions of environmental governance, sustainability, and justice."}, {"courseNum": "ITAL 101", "courseName": "Elementary Italian I", "info": "Beginning language skills, practice listening, speaking, reading, and writing; elementary grammar; and introduction to Italian culture."}, {"courseNum": "ITAL 102", "courseName": "Elementary Italian II", "info": "Continuation of language skills. Practice in listening, speaking, reading and writing. Introduction to Italian culture. Prerequisite: ITAL 101 or equivalent."}, {"courseNum": "ITAL 103", "courseName": "Intermediate Italian I", "info": "Review and expansion of language skills and cultural knowledge of Italy. Prerequisite: ITAL 102 or equivalent."}, {"courseNum": "ITAL 104", "courseName": "Intermediate Italian II: Italian Civilization", "info": "Continuing review of grammar emphasizing all four skills. Focus on civilization. Prerequisite: ITAL 103 or equivalent."}, {"courseNum": "ITAL 201", "courseName": "Intermediate Italian Conversation I", "info": "Concentration on development of speaking skills. Conducted in Italian by native speaker. This course can be counted only once toward the minor. Prerequisite or corequisite: ITAL 104 or equivalent."}, {"courseNum": "ITAL 205", "courseName": "Discovering Italy", "info": "Introduction to Italian culture. Intensive practice in speaking and writing Italian. Prerequisite: ITAL 104 or equivalent."}, {"courseNum": "ITAL 248", "courseName": "Intermediality: Italy, Film, and the Arts", "info": "This IP course will focus on intermediality, film, and Italy. It seeks to examine the relationships of cinema with the other arts, in particular the arts of Italy. Crosslisted as ENFS 248 and UNIV 248."}, {"courseNum": "JAPN 101", "courseName": "Japanese I", "info": "Beginning language skills.  Training in speaking and comprehending the basic sentence patterns of modern Japanese.  Introduction to reading and writing."}, {"courseNum": "JAPN 103", "courseName": "Japanese II", "info": "Continued training in the four language skills.  Review of basic and introduction to complex sentence patterns. Reading of texts in basic Japanese. Prerequisite: JAPN 102 or the equivalent."}, {"courseNum": "JAPN 201", "courseName": "Japanese III", "info": "Application of the four language skills.  Reading of texts written in standard Japanese and exercises in content-controlled conversation. Prerequisite: JAPN 104 or equivalent."}, {"courseNum": "JAPN 203", "courseName": "Japanese IV", "info": "Continued application of the four language skills.  Reading and guided discussion of texts related to a variety of topics. Prerequisite: JAPN 202 or the equivalent."}, {"courseNum": "JAPN 301", "courseName": "Japanese V", "info": "Reading and discussion of selected materials.  Exercises in the research skills of writing and presenting reports in Japanese. Prerequisite: JAPN 204 or the equivalent."}, {"courseNum": "JAPN 319", "courseName": "Independent Studies in Japanese", "info": "Independent projects conducted in Japanese in the student's area of special interest.  Prerequisite: permission of the instructor."}, {"courseNum": "LAMS 150", "courseName": "Latin America: An Introduction", "info": "Introduction to the history, cultures, and societies of Latin America."}, {"courseNum": "LAMS 155", "courseName": "Blacks in Latin America", "info": "By the early 19th century nearly 6 million Africans were forcibly transported to Spanish and Portuguese “New World” territories. Despite outnumbering US Blacks 3:1, Afro-Latin Americans have received little scholarly attention until recently. This course explores the history and impact of the Afro-Latin American experience from slavery to the present. Crosslisted as AFST 155."}, {"courseNum": "LAMS 202", "courseName": "Rainforests and Ecopolitics in Latin America", "info": "Focusing on Amazonia as a key region in global environmental politics, the course examines climate policy debates and recent shifts in global environmentalism. Crosslisted as ENST 209 and ANTH 202."}, {"courseNum": "LAMS 222", "courseName": "Indigenous Americas: Environment, Development, and Change", "info": "With a focus on the region we now call Latin America, this course examines historical struggles over indigenous identity and land, and contemporary alternatives to colonial development. Crosslisted as IREL 222."}, {"courseNum": "LAMS 273", "courseName": "Latin American Economic Development", "info": "The course deals with historic and contemporary economic problems, starting from colonial times and reaching the present integration into world economy. Crosslisted as ECON 273."}, {"courseNum": "LATN 101", "courseName": "Introductory Latin", "info": "Introduction to the language.  Emphasis upon forms and grammar, and rapid development of facility in reading."}, {"courseNum": "LATN 151", "courseName": "Intermediate Latin", "info": "Review of the grammar necessary for the introductory reading of selected Roman authors.  Authors may include Plautus, Cicero, Catullus, and Vergil. Prerequisite: LATN 102 or equivalent."}, {"courseNum": "LATN 221", "courseName": "Studies in Latin Literature", "info": "Advanced readings in Latin authors. Authors vary by semester; prose and poetry offered in alternate semesters. May be repeated as topic varies. Prerequisite: LATN 151 or equivalent."}, {"courseNum": "LING 105", "courseName": "Linguistic Analysis: Sounds and Words", "info": "One semester of a two-semester introduction to linguistics. Topics include: phonetics, phonology, word forms, language change, language acquisition."}, {"courseNum": "LING 216", "courseName": "Semantics", "info": "An introduction to the fundamental notions, arguments, and techniques of linguistic semantics. Focus on how meaning is structured and represented by the human mind. Prerequisite: LING 110 or permission of the instructor."}, {"courseNum": "LING 220", "courseName": "Bilingualism", "info": "An examination of the psychological and social factors involved in the acquisition and use of two or more languages across the lifespan. Topics will also include language contact and bilingual education."}, {"courseNum": "LING 319", "courseName": "Undergraduate Research", "info": "Research in psycholinguistics. Research topics may be posed by students or faculty. Prerequisite: LING 230 and permission of the instructor."}, {"courseNum": "MATH 118", "courseName": "Elementary Geometry and Statistics", "info": "Investigation of geometric, probabilistic, and statistical concepts related to Pre-K to 4 mathematics and how children learn and make sense of these concepts. Prerequisite: permission of the instructor. Prerequisite: MATH 117 or permission of the instructor."}, {"courseNum": "MATH 192", "courseName": "Topics in Calculus", "info": "Elementary calculus and applications taken primarily from economics.  Topics include algebraic, exponential, and logarithmic functions, graphs, limits, derivatives and integration. Not open to students who have taken MATH 201."}, {"courseNum": "MATH 201", "courseName": "Calculus I", "info": "An introduction to the calculus of algebraic, trigonometric and transcendental functions. Interpretation, significance and calculations of a derivative. Applications to geometry, biology, physics, economics, and other subjects. Introduction to the definite integral, including the Fundamental Theorem of Calculus. Not open to students who have taken MATH 192."}, {"courseNum": "MATH 202", "courseName": "Calculus II", "info": "Methods of integration including substitution, integration by parts, numerical approximations, and improper integrals. Series, including Taylor series. Complex numbers, polar coordinates, differential equations, and applications. Prerequisite: MATH 201."}, {"courseNum": "MATH 208", "courseName": "Mathematical Explorations", "info": "An exploration of topics from pure mathematics, applied mathematics and statistics, illustrating the power and beauty of mathematical reasoning. For students considering a major in mathematics.  Corequisites: MATH 201 or MATH 202 or MATH 211 or MATH 212 or MATH 216. Open to first-year students only."}, {"courseNum": "MATH 211", "courseName": "Calculus III", "info": "Calculus of vector-valued functions and functions of several variables. Multiple, line, and surface integrals; applications, and extrema. Green's, Stokes' and Divergence Theorems. Prerequisite: MATH 202."}, {"courseNum": "MATH 212", "courseName": "Differential Equations", "info": "Basic methods of solving ordinary differential equations. Systems of linear differential equations, Laplace transform, applications and selected topics. Prerequisite: MATH 211. Not open to students who have taken MATH 222."}, {"courseNum": "MATH 216", "courseName": "Statistics I", "info": "Exploratory data analysis, sampling distributions, regression, sampling designs, confidence intervals, hypothesis testing, ANOVA. Statistical software is used and applications, including projects, are undertaken. Not open to students who have taken MATH 226 or PSYC 215."}, {"courseNum": "MATH 217", "courseName": "Statistics II", "info": "Exploratory data analysis, design of experiments and inference emphasizing applications to a range of disciplines. Includes multiple linear regression, analysis of variance, categorical data analysis, nonparametric statistics. Prerequisite: MATH 216 or equivalent. Students who have taken MATH 305/405 need instructors permission to enroll in MATH 217. Crosslisted as MATH 617."}, {"courseNum": "MATH 226", "courseName": "Probability and Statistics for Engineers", "info": "Descriptive modeling and statistics, sampling and experimental design, discrete and continuous random variables, central limit theorem, and elementary inference. Prerequisite: MATH 202. Open only to engineering students and students in computer science. Not open to students who have taken MATH 216."}, {"courseNum": "MATH 245", "courseName": "Linear Algebra", "info": "Linear equations, matrices, vector spaces, linear transformations, determinants, eigenvalues. Prerequisite: MATH 202."}, {"courseNum": "MATH 280", "courseName": "Logic, Sets, and Proofs", "info": "Logic, sets; proof techniques; relations, functions, sequences and convergence; cardinality. Skills and tools for independent reading, problem solving and exploration. Prerequisite: MATH 211 or MATH 245."}, {"courseNum": "MATH 291", "courseName": "Undergraduate Readings", "info": "Readings and research in special topics at an intermediate level. Prerequisites: permission of the instructor, adviser, and department chair."}, {"courseNum": "MATH 303", "courseName": "Probability", "info": "Elementary probability, random variables, moments, central limit theorem, conditional expectation, statistical distributions derived from the normal distribution. Probability simulations and applications from various fields. Prerequisite: MATH 211. Crosslisted as MATH 603."}, {"courseNum": "MATH 304", "courseName": "Statistical Inference Theory", "info": "Point and interval estimation, hypothesis testing, Fisher's likelihood theory, frequentist versus Bayesian approach, computational statistics. Prerequisites: MATH 216 and MATH 303, or permission of the instructor. Crosslisted as MATH 604."}, {"courseNum": "MATH 308", "courseName": "Real Analysis I", "info": "Real numbers and elementary topology of Cartesian spaces, convergence, continuity, differentiation, and history of the development of analysis. Prerequisites: MATH 211, MATH 245, and MATH 280."}, {"courseNum": "MATH 320", "courseName": "Abstract Algebra I", "info": "Groups and rings; homomorphisms and isomorphism theorems; history of the development of algebra. Additional selected topics. Prerequisites: MATH 245 and MATH 280."}, {"courseNum": "MATH 333", "courseName": "Topology", "info": "Topological spaces, connectedness, compactness, continuity, separation, and countability axioms. Metric, product, function, and uniform spaces. Prerequisites: MATH 211 and MATH 280, or permission of the instructor. Crosslisted as MATH 633."}, {"courseNum": "MATH 335", "courseName": "Geometry", "info": "Historical and axiomatic foundations of geometry. Euclidean and non-Euclidean geometries.  Prerequisite: MATH 280 or permission of the instructor. Crosslisted as MATH 635."}, {"courseNum": "MATH 343", "courseName": "Numerical Analysis", "info": "Floating point arithmetic, development of computational algorithms and error estimates for root approximation, interpolation and approximation by polynomials, numerical differentiation and integration, cubic splines, least-squares, linear systems, lab component. Prerequisites: MATH 211,  CSCI 203, and one  of MATH 241, MATH 245, or MATH 280; or permission of the instructor. Crosslisted as MATH 643."}, {"courseNum": "MATH 391", "courseName": "Reading and Research", "info": "Reading and research in various topics for qualified undergraduate students. Prerequisite: permission of the instructor."}, {"courseNum": "MATH 405", "courseName": "Statistical Modeling", "info": "Regression and analysis of (co)variance. Model diagnosis and remediation. Model selection, multicollinearity, logistic regression. R or SAS will be used. Prerequisites: MATH 245 and MATH 304. Crosslisted as MATH 605."}, {"courseNum": "MATH 416", "courseName": "Modern Applied Mathematics", "info": "Possible topics include wavelets, harmonic analysis, computational mathematics, nonlinear dynamics, dynamical systems, scientific computing, or cryptography. Prerequisites: MATH 212 and MATH 308, or permission of the instructor. Crosslisted as MATH 616."}, {"courseNum": "MATH 604", "courseName": "Statistical Inference Theory", "info": "Continuation of MATH 303/603. The two courses together constitute an introduction to mathematical statistics. Point and interval estimation, hypothesis testing, theory of least squares and its relation to the design and analysis of experiments. Prerequisite: MATH 303 or MATH 603. Crosslisted as MATH 304."}, {"courseNum": "MATH 605", "courseName": "Statistical Modeling", "info": "Regression and analysis of (co)variance. Model diagnosis and remediation. Generalized linear models and nonlinear regression. Multicollinearity and ridge regression. Use of advanced statistical software. Crosslisted as MATH 305."}, {"courseNum": "MATH 617", "courseName": "Statistics-Biological Science", "info": "Exploratory data analysis, design of experiments and inference emphasizing applications from a range of disciplines. Includes multiple linear regression, analysis of variance, categorical data analysis, nonparametric statistics. Prerequisite: MATH 216 and permission of the instructor. Crosslisted as MATH 217."}, {"courseNum": "MATH 633", "courseName": "Topology", "info": "Topological spaces, connectedness, compactness, continuity, separation, and countability axioms.  Metric, product, function, and uniform spaces. Crosslisted as MATH 333."}, {"courseNum": "MATH 635", "courseName": "Geometry", "info": "Historical and axiomatic foundations of geometry. Euclidean and non-Euclidean geometries. Crosslisted as MATH 335."}, {"courseNum": "MATH 643", "courseName": "Numerical Analysis", "info": "Floating point arithmetic, development of computational algorithms and error estimates for root approximation, interpolation and approximation by polynomials, numerical differentiation and integration, cubic splines, least-squares, linear systems, lab component. Prerequisite: permission of the instructor. Crosslisted as MATH 343."}, {"courseNum": "MECH 151", "courseName": "Machining for Manufacturing Technology", "info": "Develop an understanding of the processes needed to produce manufactured parts. Emphasis on hands-on machining and fabrication."}, {"courseNum": "MECH 213", "courseName": "Thermodynamics I", "info": "Thermodynamic principles including properties of substances, the first and second laws of thermodynamics, efficiencies, power and refrigeration cycles. Prerequisites: MATH 201 and ENGR 214 or permission of the department. Not open to students who have taken ENGR 200 or CHEG 310."}, {"courseNum": "MECH 222", "courseName": "Introduction to Mechanical Engineering Lab Practice", "info": "Sensors, measurement techniques for static and dynamic measurements, data processing, statistical data analysis, propagation of error, technical report preparation. Corequisite: ECEG 205 and MECH 222L or permission of the department. Prerequisites: MATH 202 and MECH 220."}, {"courseNum": "MECH 252", "courseName": "Dynamics", "info": "Kinematic and kinetic analysis of rigid bodies in planar and/or three-dimensional motion. Absolute and relative analysis of displacements, velocities, and accelerations; force, energy, and momentum methods; analysis of mechanical vibrations; analytical and computer-simulated solution techniques. Prerequisites: MECH 220 and MATH 212."}, {"courseNum": "MECH 285", "courseName": "Independent Study for Sophomores", "info": "Independent investigation under the direction of a faculty member for students who have completed their first year. Sophomore standing in mechanical engineering and permission of the instructor."}, {"courseNum": "MECH 313", "courseName": "Fluid Dynamics", "info": "Fundamentals of fluid dynamics including integral and differential control volume analysis, conservation equations, dimensional analysis, incompressible inviscid flows, internal and external viscous flows. Prerequisites: MATH 212, MECH 213, MECH 222, or permission of the department. Not open to students who have taken ENGR 222 or ENGR 233."}, {"courseNum": "MECH 355", "courseName": "Manufacturing Processes", "info": "Analytical and technological study of manufacturing processes including metal deformation, casting, and cutting. Introduction to numerical control and CAD/CAM. Laboratory fabrication project and field trips. Co-Requisite: MECH 355L. Prerequisites: ENGR 240 and MECH 202."}, {"courseNum": "MECH 385", "courseName": "Independent Study for Juniors", "info": "Independent investigation under the direction of a faculty member for students who have completed two years of study. Junior standing in mechanical engineering and permission of the instructor."}, {"courseNum": "MECH 401C", "courseName": "Senior Design I-Project Advising and Group Meeting Time", "info": "Required MECH 401 Senior Design common time; Project advising and group meetings;"}, {"courseNum": "MECH 403", "courseName": "Thermal Design", "info": "Design of thermal-fluid energy conversion systems; equipment selection; codes and standards; and economic analysis. Mini-design laboratories and group design project. Co-Requisites: MECH 403L Prerequisites: MECH 312"}, {"courseNum": "MECH 405", "courseName": "System Dynamics", "info": "Modeling and analysis of dynamic systems consisting of mechanical, electrical, fluid, and thermal elements. Frequency response methods. Sampled data systems. Experimental system identification. Co-Requisites: MECH 405L Prerequisites: MATH 212, MECH 252 and ECEG 205"}, {"courseNum": "MECH 476", "courseName": "Biomechanics", "info": "Principles of mechanics applied to biological systems. Background in anatomy, physiology, and cell biology will be presented. Mechanical behavior of hard and soft biological materials. Topics in cellular, cardiovascular, musculoskeletal, implant, and sport/motion biomechanics. Prerequisite: permission of the instructor. Crosslisted as MECH 676."}, {"courseNum": "MECH 484", "courseName": "Artificial Intelligence for Engineering Systems", "info": "Engineering system modeling and optimization using artificial intelligence methods such as neural networks and genetic algorithms. MATLAB based. Prerequisites: ENGR 214 or equivalent or permission of the instructor. Crosslisted as MECH 684."}, {"courseNum": "MECH 485", "courseName": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course. Prerequisite: permission of the instructor. Crosslisted as MECH 685."}, {"courseNum": "MECH 495", "courseName": "Advanced Topics in Engineering Mathematics", "info": "Linear algebra and analytical/computational techniques for solving ordinary and partial differential equations relevant to engineering applications. Crosslisted as CEEG 495 and CHEG 495 and MECH 495 and ENGR 695 and ECEG 495 and ECEG 695. Prerequisite: permission of the instructor."}, {"courseNum": "MECH 676", "courseName": "Biomechanics", "info": "Principles of mechanics applied to biological systems. Background in anatomy, physiology, and cell biology will be presented. Mechanical behavior of hard and soft biological materials. Topics in cellular, cardiovascular, musculoskeletal, implant, and sport/motion biomechanics. Prerequisite: permission of the instructor. Crosslisted as MECH 476."}, {"courseNum": "MECH 684", "courseName": "Artificial Intelligence for Engineering Systems", "info": "Engineering system modeling and optimization using artificial intelligence methods such as neural networks and genetic algorithms. MATLAB based. Prerequisites: ENGR 214 or equivalent. Crosslisted as MECH 484."}, {"courseNum": "MECH 685", "courseName": "Advanced Engineering Problems", "info": "An investigation under the direction of a staff member. Topics not covered in other courses may be studied in this course. Prerequisite: permission of the instructor. Crosslisted as MECH 485."}, {"courseNum": "MECH 697", "courseName": "Graduate Thesis Research", "info": "Thesis-related research in mechanical engineering. Prerequisite: permission of the instructor."}, {"courseNum": "MGMT 100", "courseName": "Management Past, Present and Future", "info": "Explores the historical context from which complex organizations have arisen, their evolution, and the emerging areas of inquiry necessary to understanding the future of organizations, management, and business."}, {"courseNum": "MGMT 101", "courseName": "Introduction to Organization and Management", "info": "Each section of 28 students learns management theories, concepts, and models, putting them into practice by designing and managing their own multi-divisional hybrid organizations that conduct major service projects funded by selling business products they created. Storytelling and writing are key pedagogies. Not open to first semester first-year students."}, {"courseNum": "MGMT 102", "courseName": "Quantitative Reasoning for Managers", "info": "This course serves as a student's introduction to quantitative modeling and basic statistical analysis in a spreadsheet-based environment, especially as they apply to managerial decision making."}, {"courseNum": "MGMT 200", "courseName": "Foundations Accounting and Financial Management I", "info": "Introduction to accounting and financial management including financial statement preparation and analysis, financial forecasting, cost relationships, time value of money and capital budgeting."}, {"courseNum": "MGMT 201", "courseName": "Marketing", "info": "Introduction to principles of marketing.  Examines how organizations facilitate exchange relationships by customers' needs and wants.  Explores the intricacies of identifying and establishing market positions and understanding consumer behavior.  Prerequisite: MGMT 101 or permission of the instructor."}, {"courseNum": "MGMT 202", "courseName": "Operations", "info": "This course introduces students to the ways in which to model, analyze, and improve processes for producing services and goods. Prerequisite: MGMT 102. MATH 216 accepted with permission of the instructor."}, {"courseNum": "MGMT 203", "courseName": "Managerial Finance", "info": "Financial analysis, forecasting, and valuation of projects and companies incorporating risk-return tradeoffs and capital structure and dividend decisions.  Employs 10-K research and presentations.  Prerequisite: MGMT 200. Intended ACFM majors must take ACFM 370 instead of MGMT 203."}, {"courseNum": "MGMT 302", "courseName": "The Stakeholder Organization", "info": "Students explore the moral and ethical challenges associated with complex organizational decisions in a variety of contexts.  Prerequisite: MGMT 101. Juniors and seniors only."}, {"courseNum": "MGMT 303", "courseName": "The Technological Organization", "info": "Organizations solve a variety of problems by deploying information systems.  This course explores a range of technological impacts on organizations from their behavior to survival."}, {"courseNum": "MGMT 304", "courseName": "The Strategic Organization", "info": "Students learn strategic concepts and explore the challenges of formulating and implementing organizational strategies. Prerequisites: MGMT 101. Senior BSBA and MGEG sub-seniors, others by permission."}, {"courseNum": "MGMT 310", "courseName": "Independent Study in Management", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "MGMT 315", "courseName": "Special Topics in Management", "info": "A seminar on selected topics in management. Prerequisite: permission of the instructor. Crosslisted as MGMT 615."}, {"courseNum": "MIDE 300", "courseName": "Markets, Innovation, and Design", "info": "A survey of the relationships among marketing, innovation, and design. Students will practice various approaches to creative and innovative thinking. Prerequisite: MGMT 201 or permission of the instructor."}, {"courseNum": "MIDE 301", "courseName": "Understanding Consumers", "info": "A toolbox of research methods for understanding consumer behavior with appropriate exposure to philosophical and theoretical underpinnings of various approaches. Prerequisite: MGMT 201 or permission of instructor."}, {"courseNum": "MIDE 302", "courseName": "Design Realization", "info": "Implementation of creative techniques for exploring ideas and transforming ideas into appropriate mediums for communication. Includes creative ideation, sketching, digital and physical modeling. Prerequisites: MGMT 201 and MIDE 300."}, {"courseNum": "MIDE 375", "courseName": "Should We Start This Company?", "info": "Project centered course in entrepreneurship, generating new business ideas, and product or service design and development through business planning. Crosslisted as UNIV 375 and ENGR 375."}, {"courseNum": "MILS 101", "courseName": "Foundation of Officership", "info": "Focuses on developing comprehension of Army leadership dimensions, attributes and core leader competencies within the U.S. Army, and the Army's role in American society and government."}, {"courseNum": "MILS 201", "courseName": "Individual Leadership Studies", "info": "Builds upon student development of the leadership attributes and core leader competencies through the understanding of Army organizational structures and its duty in American society."}, {"courseNum": "MILS 301", "courseName": "Adaptive Team Leadership", "info": "Develops critical thinking skills through practical application of the fundamentals of Army leadership at the lowest organizational levels in the United States Army."}, {"courseNum": "MILS 401", "courseName": "Developing Adaptive Leaders", "info": "Transitions the student learning from being trained to becoming a leader. Students study the U.S. Constitution and how it relates to their role as an Army officer."}, {"courseNum": "MSUS 200", "courseName": "Managing for Sustainability I", "info": "This course explores how organizations manage toward social, environmental, and economic sustainability goals. Prerequisites: sophomores, juniors, or seniors only."}, {"courseNum": "MSUS 301", "courseName": "Managing for Sustainability II", "info": "Advanced topics in sustainability, including triple-bottom line performance management and integrating other sustainability themes."}, {"courseNum": "MSUS 310", "courseName": "Independent Study in Managing for Sustainability", "info": "Individual study or projects, supervised by instructor. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 114", "courseName": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 121", "courseName": "Introduction to Music Fundamentals", "info": "The study of the fundamentals of music, including standard notation, simple and compound meter, spelling triads, and simple harmonic progressions.  The skills in this course are required for MUSC 200. Does not fulfill the requirements for the music major or music minor."}, {"courseNum": "MUSC 135", "courseName": "Introduction to Music Teaching", "info": "This course provides  basic foundations in the discipline of music teaching, learning and pedagogy to students in music education, music performance, or BA in music majors. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 144", "courseName": "Brass Methods", "info": "Intended for music education majors.  An introductory course in brass instruments."}, {"courseNum": "MUSC 146", "courseName": "Voice Methods", "info": "Intended for instrumental music education majors.  An introductory course in voice."}, {"courseNum": "MUSC 152", "courseName": "Functional Keyboard", "info": "A requirement for all, and open only to Bachelor of Music majors. Functional keyboard skills including harmonization, transposition, and improvisation. Students will register for the course each semester until it is completed successfully. Failure to complete the requirement will prevent a student from continuing in the degree program."}, {"courseNum": "MUSC 170", "courseName": "Piano Lessons", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 171", "courseName": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 172", "courseName": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 174", "courseName": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 175", "courseName": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 176", "courseName": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 178", "courseName": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 179", "courseName": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 181", "courseName": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 183", "courseName": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 185", "courseName": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 187", "courseName": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 188", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 189", "courseName": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 191", "courseName": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 192", "courseName": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 193", "courseName": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 194", "courseName": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 196", "courseName": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 197", "courseName": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 198", "courseName": "Harp", "info": "Harp lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 199", "courseName": "Improvisation I", "info": "Studio lessons in improvisation. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 201", "courseName": "Chromatic Theory", "info": "Chromatic harmony, modulations, a study of basic classical and romantic forms.  Includes ear training, keyboard harmony, and sight singing. Prerequisite: MUSC 200."}, {"courseNum": "MUSC 214", "courseName": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 230", "courseName": "Music for Exceptional Children", "info": "This course prepares prospective teachers for teaching students with diverse needs through the exploration of the ways in which curriculum, instruction, and assessment may be adapted."}, {"courseNum": "MUSC 232", "courseName": "Music Technology", "info": "A survey of music technology.  Topics include recording technology, digital audio, spectral analysis and synthesis, MIDI/OSC, sequencing, sampling, computer music languages, and synthesis techniques."}, {"courseNum": "MUSC 241", "courseName": "Instrumental Methods and Literature", "info": "Intended for music education majors having an instrumental emphasis. Orchestral, concert, marching, and jazz band repertoire.  Elementary and secondary school methods and materials. Program administration."}, {"courseNum": "MUSC 253", "courseName": "Music and Culture: Beethoven to Virtual Music", "info": "A survey of western European art music from the early 19th century to the present. When possible, MUSC 252 should be taken before enrolling in MUSC 253."}, {"courseNum": "MUSC 259", "courseName": "Conducting I", "info": "Standard beat patterns, basic conducting problems, analysis of instrumental and choral scores. Prerequisite: MUSC 200."}, {"courseNum": "MUSC 260", "courseName": "Ensemble", "info": "Non music majors may receive 1/4 credit per ensemble (maximum of 1/2 credit per semester, limit of two full-course credits in all). Music majors audit ensembles. Audition or permission of the instructor required for first-time members. 01-Symphonic Band, 02-Orchestra, 03-University Choir, 04-Camerata, 05-Opera Theatre, 06-Handbells, 07-Jazz Band, 08-Gamelan."}, {"courseNum": "MUSC 270", "courseName": "Piano", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 271", "courseName": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 272", "courseName": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 274", "courseName": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 275", "courseName": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 276", "courseName": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 278", "courseName": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 279", "courseName": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 281", "courseName": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 283", "courseName": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 285", "courseName": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 287", "courseName": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 288", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 289", "courseName": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 291", "courseName": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 292", "courseName": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 293", "courseName": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 294", "courseName": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 296", "courseName": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 297", "courseName": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 299", "courseName": "Improvisation II", "info": "Studio lessons in improvisation."}, {"courseNum": "MUSC 314", "courseName": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 350", "courseName": "Studies in Music", "info": "Special projects (typically independent studies) undertaken with the approval of a Music faculty member and the Department Chair."}, {"courseNum": "MUSC 369", "courseName": "Conducting II", "info": "Advanced baton technique, rehearsal methods, and score analysis. Prerequisites: MUSC 259 or permission of the instructor."}, {"courseNum": "MUSC 370", "courseName": "Piano", "info": "Piano lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 371", "courseName": "Organ", "info": "Organ lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 372", "courseName": "Voice", "info": "Voice lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 374", "courseName": "Violin", "info": "Violin lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 375", "courseName": "Viola", "info": "Viola lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 376", "courseName": "Violoncello", "info": "Violoncello lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 378", "courseName": "String Bass", "info": "String bass lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 379", "courseName": "Flute", "info": "Flute lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 381", "courseName": "Clarinet", "info": "Clarinet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 383", "courseName": "Oboe", "info": "Oboe lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 385", "courseName": "Bassoon", "info": "Bassoon lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 387", "courseName": "Saxophone", "info": "Saxophone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 388", "courseName": "Balinese Gamelan", "info": "Lessons in advanced techniques for Balinese music. Students may study gender wayang, reyong, kendang, and/or suling. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 389", "courseName": "Trumpet", "info": "Cornet/trumpet lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 391", "courseName": "French Horn", "info": "French horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 392", "courseName": "Trombone", "info": "Trombone lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 393", "courseName": "Tuba", "info": "Tuba lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 394", "courseName": "Euphonium", "info": "Baritone horn lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 396", "courseName": "Guitar", "info": "Guitar lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 397", "courseName": "Percussion", "info": "Percussion lessons. Prerequisite: permission of the instructor."}, {"courseNum": "MUSC 399", "courseName": "Improvisation III", "info": "Studio lessons in improvisation."}, {"courseNum": "MUSC 414", "courseName": "Composition Studio", "info": "Analytical and creative study of contemporary musical composition.  Prerequisite: permission of the instructor."}, {"courseNum": "NEUR 100", "courseName": "Introduction to Neuroscience", "info": "A survey of the study of the nervous system and its structure and function, ranging from molecular analyses of neurons to electrical and other correlates of human cognition."}, {"courseNum": "NEUR 250", "courseName": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as PSYC 250."}, {"courseNum": "NEUR 253", "courseName": "Neural Cell Biology", "info": "A core course for neuroscience focused on structure/function relationships in neural cells. Basic protein biochemistry, ion channel activity, protein receptors, cell signaling, electrical properties and response patterns will be emphasized. Recommended for sophomores. Prerequisites: BIOL 205 and PSYC 250 and permission of the instructor."}, {"courseNum": "NEUR 312", "courseName": "Biopsychology of Appetite and Obesity", "info": "Reading and discussion of scholarly research on the neural, physiological, and endocrine signals that influence the psychology of appetite, food reward, eating behavior, and obesity in humans and animal models. Prerequisite: PSYC 250 or NEUR 250. Crosslisted as PSYC 312."}, {"courseNum": "NEUR 348", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as PSYC 348 and PSYC 648."}, {"courseNum": "NEUR 360", "courseName": "Honors Thesis", "info": "Prerequisite: permission of the department and permission of the instructor."}, {"courseNum": "NEUR 363", "courseName": "Receptors of Biological Membranes", "info": "A course focused on the receptors and channels that function in biological membranes. The primary research literature will be used to explore the molecular bases of cellular communication, neuronal connectivity, and sensory transduction. Prerequisites: BIOL 205 and either BIOL 206 or NEUR 253. Crosslisted as BIOL 363 and BIOL 663."}, {"courseNum": "NEUR 399", "courseName": "Undergraduate Research", "info": "Research on any aspect of neuroscience. Research topics may be posed by students or faculty. Prerequisite: permission of the instructor."}, {"courseNum": "NEUR 400", "courseName": "Senior Seminar in Neuroscience", "info": "NEUR majors may elect to attend a lecture series in the spring semester to satisfy the Culminating Experience requirement. Students will prepare written reactions to each seminar, graded as pass/fail. Prerequisites: senior status and NEUR majors and permission of the instructor."}, {"courseNum": "PHIL 100", "courseName": "Introduction to Philosophy", "info": "An introduction to the main topics, fields and figures of philosophy. Multiple sections of this course are offered every semester, under a variety of titles."}, {"courseNum": "PHIL 103", "courseName": "Logic", "info": "An introduction to informal and formal ways of reasoning. The structures and general forms of argument as well as the standards and criteria needed to evaluate arguments, and the historical development of logical reasoning, will be studied."}, {"courseNum": "PHIL 205", "courseName": "Greek Philosophy", "info": "Studies of the ancient Greek notions of kosmos, society, and soul, through readings of the Presocratics, Plato, and Aristotle. Some attention will also be paid to the mythic/poetic background from which philosophy arises for the ancient Greeks. Prerequisite: PHIL 100 or PHIL 103 or PHIL 201 or permission of instructor."}, {"courseNum": "PHIL 225", "courseName": "Metaphysics", "info": "An inquiry into the nature of being/reality. Topics may include the ontological status of universals, mind, personal identity, freedom, time and God. Readings in such thinkers as Plato, Aristotle, Ockham, Descartes, Leibniz, Berkeley, Kant, Bergson and Heidegger. Prerequisite: PHIL 100 or permission of the instructor."}, {"courseNum": "PHIL 230", "courseName": "Feminist Philosophy", "info": "An examination of feminist philosophy primarily as it occurs in the U.S. from the late 18th century to the present. Crosslisted as WMST 230."}, {"courseNum": "PHIL 271", "courseName": "Eating Animals: Philosophical Perspectives", "info": "This course examines traditional philosophical justifications for using nonhuman animals to satisfy human needs and desires, particularly using animals as food. The course also examines leading philosophical challenges to the human use of animals as instrumentalities. This course counts toward the Food Systems minor. Prerequisite: PHIL 100."}, {"courseNum": "PHIL 276", "courseName": "Philosophy of Revolution", "info": "An exploration and analysis of the concept of revolution in political philosophy from modernity to the present day, examining ways that political philosophers have sought to make revolution unnecessary as well as how and why they have emphasized its necessity. Crosslisted as POLS 267."}, {"courseNum": "PHIL 311", "courseName": "Seminar in Philosophical Problems", "info": "A selected problem of philosophy as this occurs historically in the ancient, medieval, or modern periods, or in contemporary thought. In recent years: \"Philosophy of Mind,\" \"Environmental Aesthetics,\" \"Perception,\" \"Philosophical Heretics,\" \"Friendship,\" \"Doubt, Disagreement and Dogmatism.\" Prerequisites: two courses in philosophy and permission of the instructor."}, {"courseNum": "PHIL 319", "courseName": "Individual Studies in Philosophy", "info": "Open to advanced students who wish to pursue individual programs of study under the supervision of a professor, or of a committee of professors if the subject falls within two or more departments. May be conducted as a seminar for three or more students pursuing similar programs."}, {"courseNum": "PHIL 320", "courseName": "Individual Studies in Philosophy", "info": "Open to advanced students who wish to pursue individual programs of study under the supervision of a professor, or of a committee of professors if the subject falls within two or more departments. May be conducted as a seminar for three or more students pursuing similar programs."}, {"courseNum": "PHIL 321", "courseName": "Honors Thesis", "info": "Substantial independent work on some problem or topic approved by the department of philosophy as honors work. Prerequisite: permission of the instructor."}, {"courseNum": "PHIL 323", "courseName": "Senior Thesis", "info": "Independent research on a philosophical issue, in consultation with staff members. The thesis should show integrative and creative abilities. Prerequisite: major in philosophy or permission of the instructor."}, {"courseNum": "PHYS 147", "courseName": "Energy and Sustainability", "info": "Examination of energy, its transformations, its effects on resource depletion, and environmental degradation. Models of sustainability for transportation, architecture, waste management, and personal lifestyle choices. Designed for non-science majors. No prerequisite. Not open to students who have successfully completed a 200-level physics course."}, {"courseNum": "PHYS 211", "courseName": "Classical and Modern Physics I", "info": "The first course in a two-course sequence that surveys major areas of physics. Topics include Newtonian mechanics, relativity, thermodynamics and statistical mechanics, and gravity. Corequisite: MATH 201."}, {"courseNum": "PHYS 221", "courseName": "Classical Mechanics", "info": "Newtonian mechanics including conservation laws, rotational dynamics, forced damped harmonic motion, and coupled oscillations. Prerequisites: PHYS 211 and MATH 202."}, {"courseNum": "PHYS 317", "courseName": "Thermodynamics and Statistical Mechanics", "info": "The laws of thermodynamics, thermodynamic functions, kinetic theory of gases, statistical mechanics. Prerequisites: PHYS 212 (or PHYS 212E) and either PHYS 221 or PHYS 222, or permission of the instructor."}, {"courseNum": "PHYS 331", "courseName": "Advanced Classical Mechanics", "info": "Kinematics and dynamics of particles, systems, and rigid bodies. Hamilton's principles, Lagrange's equations, theory of small vibrations, orbital mechanics, accelerated frames, and nonlinear dynamics. Prerequisites: PHYS 221 and MATH 212, or permission of the instructor."}, {"courseNum": "PHYS 332", "courseName": "Quantum Mechanics", "info": "Basic postulates and applications, perturbation theory, angular momentum, scattering theory, relativistic effects. Prerequisites: PHYS 221, PHYS 222 and MATH 211, or permission of the instructor."}, {"courseNum": "PHYS 333", "courseName": "Electromagnetic Theory I", "info": "Classical electromagnetic theory, including scalar and vector potentials, electrostatics, magnetostatics, time-dependent fields, and culminating with Maxwell's equations. Prerequisites: PHYS 212 (or PHYS 212E) and MATH 211."}, {"courseNum": "PHYS 350", "courseName": "Undergraduate Research", "info": "Undergraduate research. Prerequisite: permission of the instructor."}, {"courseNum": "POLS 140", "courseName": "American Politics", "info": "A critical examination of the principles, structures, and processes that shape American politics. An emphasis on political behavior and institutions with applications to contemporary political issues."}, {"courseNum": "POLS 170", "courseName": "International Politics", "info": "Introduction to major dynamics of international politics; the international system, decision making, perceptions, cooperation, conflict, and policy instruments, such as diplomacy and war. Analysis is linked to specific international events and issues."}, {"courseNum": "POLS 205", "courseName": "Comparative Politics", "info": "Politics and policy outside the United States; concepts for the comparison of political systems. Democracy, Third World politics, revolution, political stability and change, international effects on political processes."}, {"courseNum": "POLS 210", "courseName": "Political Theory", "info": "Examination of the moral dimensions of politics. Authors include Plato, Aristotle, Milton, Hobbes, Locke, Rousseau, and Marx. Major concepts include justice, freedom, rights, and authority."}, {"courseNum": "POLS 211", "courseName": "Third World Politics", "info": "Politics in Latin America, Africa and Asia. The Third World in the modern world system. Politics and economic development. Instability, militarism, and democracy."}, {"courseNum": "POLS 219", "courseName": "Latin American Politics", "info": "The dynamics of politics in Latin American social, economic, and cultural context, with use of general comparative concepts of politics."}, {"courseNum": "POLS 225", "courseName": "Chinese Politics", "info": "This course examines China's rich political history, its dynamic economic and social changes, its lasting political culture, its enduring struggle for modernization, and its evolving relations with the rest of the world. Crosslisted as EAST 269 and IREL 225."}, {"courseNum": "POLS 233", "courseName": "The Politics of College", "info": "A survey of higher education policy and campus politics in the United States. Ideas to be discussed include: national- and state-level education policy, college affordability and debt, student learning and the purposes of college education, new and non-traditional models of education, and controversies surrounding the political environment on college campuses."}, {"courseNum": "POLS 239", "courseName": "Latino Politics in the United States", "info": "This course focuses on the electoral and non-electoral political participation and behavior of Latinos, as well as to some key policy issues of relevance to Latinos at all levels."}, {"courseNum": "POLS 242", "courseName": "Constitutional Law: Civil Liberties", "info": "Examination of civil liberties policy in the U.S. through a study of U.S. Supreme Court decisions."}, {"courseNum": "POLS 254", "courseName": "Sex and Social Order", "info": "Analysis of connections between sex and social structure to determine how our understanding of sexuality is implicated in our political system, economy, and cultural ideology. Crosslisted as WMST 254."}, {"courseNum": "POLS 261", "courseName": "Twentieth-century American Legal Thought", "info": "Analysis of dominant and critical trends through the century including legal realism, liberalism, law and morality, feminist legal theory, law and economics, and critical race theory."}, {"courseNum": "POLS 267", "courseName": "Philosophy of Revolution", "info": "An exploration and analysis of the concept of revolution in political philosophy from modernity to the present day, examining ways that political philosophers have sought to make revolution unnecessary as well as how and why they have emphasized its necessity. Crosslisted as PHIL 276."}, {"courseNum": "POLS 268", "courseName": "Contemporary Democratic Theory", "info": "Analysis of the moral foundations of democracy and the institutional means for achieving it, including voting systems, political parties, alternative representation and workplace democracy."}, {"courseNum": "POLS 276", "courseName": "Comparative Foreign Policy", "info": "This course has two over-arching objectives. Introduce students to the various ways foreign policy can be explained. The second objective is to acquaint students with the substantive foreign policies of specific international actors, notably the EU, Japan, India, Israel, United Kingdom, Brazil, China, and others. Crosslisted as IREL 276."}, {"courseNum": "POLS 291", "courseName": "Environmental Policy and Politics", "info": "An introduction to understanding the role of political institutions, stakeholders, and policy processes (in the U.S. and internationally) in addressing environmental problems. Crosslisted as ENST 245."}, {"courseNum": "POLS 292", "courseName": "Political Economy of Growth", "info": "We will study how institutions affect the immediate determinants of economic growth.  Topics include population growth, microfinance, democracy, geography, international trade, culture, and foreign aid."}, {"courseNum": "POLS 350", "courseName": "Seminar in Comparative Politics", "info": "Selected topics. Prerequisite: POLS 205 or permission of the instructor."}, {"courseNum": "POLS 356", "courseName": "Nationalism, Identity and Nature", "info": "This course explores the geographies and politics of nationalism, the ways in which nature is nationalized, the construction of nature in environmental contestations and reactions to nationalism, and the intersection of nationalism with other social constructions. Crosslisted as ENST 356 and IREL 356."}, {"courseNum": "POLS 381", "courseName": "Arab-Israeli Conflict, Peace Process", "info": "This course examines the failures/successes of the peace process among Israel, the Arab States, and the Palestinians.  Special focus is on Oslo peace process, outstanding issues, and the involvement of outside actors, particularly the role of the U.S. Prerequisite: POLS 170 or permission of instructor. Crosslisted as IREL 381."}, {"courseNum": "POLS 389", "courseName": "Human Rights", "info": "The seminar will study human rights, primarily from an international perspective, including self-determination, cultural rights, ethnic and racial rights, women's rights, religious rights, and lesbian and gay rights.  Preference given to international relations majors. Prerequisite: permission of the instructor. Crosslisted as IREL 415."}, {"courseNum": "POLS 397", "courseName": "Honor Thesis", "info": "Independent research on some topic approved as honors work by the department and Honors Council. Prerequisite: permission of the instructor."}, {"courseNum": "PSYC 100", "courseName": "Introduction to Psychology", "info": "A survey of concepts, principles, and theories of an empirical science of behavior."}, {"courseNum": "PSYC 203", "courseName": "Learning", "info": "The study of basic mechanisms of associative learning in motivated behavior, especially Pavlovian and operant conditioning in the behaviors of various species.Prerequisite: PSYC 100 or ANBE 266 or NEUR 100 or permission of the instructor."}, {"courseNum": "PSYC 204", "courseName": "Human Cognition", "info": "A survey of the theories and methods employed in studying human mental abilities. Issues include attention, memory, language, problem solving, and decision making. Prerequisite: NEUR 100 or PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 207", "courseName": "Developmental Psychology", "info": "Study of stages, sequences, and processes in normal child development, prenatal through childhood. Emphasis on interaction of nature and nurture in cognitive, social, emotional development. Prerequisite: PSYC 100, EDUC 201 is accepted as an alternate prerequisite for students who are Education Bachelor of Science majors, or permission of the instructor."}, {"courseNum": "PSYC 209", "courseName": "Social Psychology", "info": "Theories of social influence and social interaction, their empirical foundations and implications for the individual and society. Prerequisite: PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 213", "courseName": "Abnormal and Clinical Psychology", "info": "A critical introduction to psychological disorders, theories of their causes, and approaches to their treatments. Includes an observational practicum in a psychiatric facility. Prerequisite: PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 215", "courseName": "Psychological Statistics", "info": "An introduction to basic statistical analyses in psychology. Prerequisite: PSYC 100, NEUR 100, or ANBE 266 or permission of the instructor."}, {"courseNum": "PSYC 216", "courseName": "Research Methods in Psychology", "info": "An introduction to the methods used and issues faced by psychological researchers. Topics include ethics, study design (true-experimental, correlational, and quasi-experimental), data collection and analysis, and communication of empirical findings. A foundation for other research-based courses in Psychology. Prerequisites: PSYC 100 and PSYC 215 or MATH 216."}, {"courseNum": "PSYC 229", "courseName": "Directed Study in Psycholoygy", "info": "An entry into psychological research or other independent study directed by a faculty member. Experiences might include library work, collecting data, entering and analyzing data, and other activities associated with engagement in research and in faculty-directed inquiry. Prerequisite: PSYC 100 and instructor permission."}, {"courseNum": "PSYC 240", "courseName": "Multicultural Psychology", "info": "A survey of multiculturalism as a major paradigm in psychology.  Analysis of multicultural principles, concepts, and sociocultural factors and their impact on assessment, practice, and research. Course topics include an exploration of diverse worldviews, communication styles, identity development, acculturation, stereotyping, prejudice, discrimination, structural oppression, and the development of cultural competence."}, {"courseNum": "PSYC 242", "courseName": "Positive Psychology", "info": "This course explores the scientific study of factors that enable individuals and communities to thrive. The class is taught at a nearby prison with both Bucknell and incarcerated students. Prerequisites: permission of the instructor. Not open to first-year students."}, {"courseNum": "PSYC 250", "courseName": "Biopsychology", "info": "Biological bases of behavior and their relationship to motivation, learning, and perception. Prerequisite: one of the following: NEUR 100, PSYC 100, BIOL 206, ANBE 266 or permission of the instructor. Crosslisted as NEUR 250."}, {"courseNum": "PSYC 252", "courseName": "Sensation and Perception", "info": "Anatomy and functions of the sensory systems: vision, audition, kinesthesis, vestibular sensation, taste and smell, with emphasis on theory and abnormalities of the human sensory systems. Prerequisite: NEUR 100 or PSYC 100 or permission of the instructor."}, {"courseNum": "PSYC 266", "courseName": "Animal Behavior", "info": "A survey of important theories, issues, and empirical techniques in the interdisciplinary field of animal behavior, emphasizing both proximate and ultimate explanations for behavior. Crosslisted as ANBE 266 and BIOL 266."}, {"courseNum": "PSYC 285", "courseName": "Research Methods in Social Justice", "info": "Laboratory and/or field research on psychological aspects of social justice issues."}, {"courseNum": "PSYC 287", "courseName": "Research Methods in Multicultural Psychology", "info": "An introduction to research methods in multicultural psychology designed to understand the influence of culture on the physical and mental health of culturally diverse populations. Students will be exposed to qualitative, quantitative, and mixed methods approaches applied to community-based participatory research."}, {"courseNum": "PSYC 290", "courseName": "Research Methods in Biopsychology", "info": "Laboratory research to accompany PSYC 250 Biopsychology. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or PSYC 296 or ANBE 296, and prerequisite or corequisite PSYC 250."}, {"courseNum": "PSYC 296", "courseName": "Research Methods in Animal Behavior", "info": "Laboratory and/or field research to accompany ANBE 266, BIOL 266, or PSYC 266. Prerequisites: PSYC 215 or MATH 216, PSYC 216 or BIOL 205 and prerequisite or corequisite ANBE 266, BIOL 266, or PSYC 266. Crosslisted as ANBE 296."}, {"courseNum": "PSYC 299", "courseName": "Research Methods in Social Psychology", "info": "Laboratory and/or field research to accompany PSYC 209 Social Psychology. Prerequisites: PSYC 100, PSYC 215 or MATH 216."}, {"courseNum": "PSYC 312", "courseName": "Biopsychology of Appetite and Obesity", "info": "Reading and discussion of scholarly research on the neural, physiological, and endocrine signals that influence the psychology of appetite, food reward, eating behavior, and obesity in humans and animal models. Prerequisite: PSYC 250 or NEUR 250. Crosslisted as NEUR 312."}, {"courseNum": "PSYC 316", "courseName": "Advanced Social Psychology", "info": "Consideration of experimental and theoretical issues in social psychology. Prerequisites: PSYC 209 or PSYC 228 and any PSYC research methods class or permission of the instructor. Crosslisted as PSYC 616."}, {"courseNum": "PSYC 318", "courseName": "Cognitive Aging", "info": "Seminar discussing the development and changes in cognition in senior citizens. Topics include memory, language, attention, and decision-making. Prerequisite: PSYC 252 or PSYC 204 or permission of the instructor. Crosslisted as PSYC 618."}, {"courseNum": "PSYC 319", "courseName": "Topics in Psychology", "info": "Occasional seminars on selected topics of current interest in psychology. Prerequisite: permission of the instructor. Crosslisted as PSYC 619."}, {"courseNum": "PSYC 320", "courseName": "Children's Studies", "info": "Critical examination of childhood from multiple disciplinary lenses. Topics include children's advertising and consumerism, child labor, child soldiers, children's spirituality, children in diverse cultures, children and the arts. In this service-learning course students work with children/youth in field placements (e.g., Geisinger Children's Hospital, residential treatment centers). Prerequisites: senior status. Crosslisted as PSYC 620."}, {"courseNum": "PSYC 324", "courseName": "Advanced Psychological Statistics", "info": "A survey of advanced statistical techniques with emphasis on analysis and interpretation of experimental and correlational data. Prerequisites: PSYC 215 or equivalent and permission of the instructor. Crosslisted as PSYC 624."}, {"courseNum": "PSYC 325", "courseName": "Personality, Psychopaths, and Serial Killers", "info": "Considers personality disorders with a focus on psychopathy and serial murders. Biological and environmental causes of psychopathy are considered as well as the developmental course of the condition and ethics of treatment. Prerequisites: PSYC 228 or PSYC 209 or PSYC 210 or permission of the instructor. Crosslisted as PSYC 625."}, {"courseNum": "PSYC 329", "courseName": "Undergraduate Research", "info": "Research or other independent study on any aspect of psychology. Research topics may be posed by students or faculty. Prerequisite: permission of the instructor."}, {"courseNum": "PSYC 348", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as NEUR 348 and PSYC 648."}, {"courseNum": "PSYC 360", "courseName": "Honors Thesis", "info": "Prerequisites: permission of the department and permission of the instructor."}, {"courseNum": "PSYC 369", "courseName": "Psychology of Beauty and Attraction", "info": "Examination of research on beauty and attraction from an evolutionary perspective. Prerequisites: PSYC 209, a Cluster C course and permission of the instructor. Crosslisted as PSYC 669."}, {"courseNum": "PSYC 370", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisites: BIOL 122 or BIOL 208 or ANBE 266 or BIOL 266 or PSYC 266 and permission of the instructor.  Crosslisted as ANBE 370 and ANBE 670 and BIOL 370 and BIOL 670 and PSYC 670."}, {"courseNum": "PSYC 372", "courseName": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition.  Prerequisites: PSYC 266, ANBE 266, and permission of the instructor. Crosslisted as PSYC 672 and ANBE 372 and ANBE 672."}, {"courseNum": "PSYC 374", "courseName": "Latina/o Psychology", "info": "A seminar that examines the psychological research literature related to Latinas/os in the U.S. It considers the influences of Latina/o cultural values, practices, contexts and experiences on physical and mental health outcomes. Prerequisite: PSYC 216 or permission of the instructor. Crosslisted as PSYC 674."}, {"courseNum": "PSYC 375", "courseName": "Child Health Psychology", "info": "Study of the impact that pediatric illness has on child mental health and child development. Focus on the management of chronic illness, adherence, mental health concerns, coping, and family factors. Prerequisite: PSYC 207 or permission of the instructor. Crosslisted as PSYC 675."}, {"courseNum": "PSYC 616", "courseName": "Advanced Social Psychology", "info": "Consideration of experimental and theoretical issues in social psychology. Prerequisite: permission of the instructor. Crosslisted as PSYC 316."}, {"courseNum": "PSYC 618", "courseName": "Cognitive Aging", "info": "Seminar discussing the development and changes in cognition in senior citizens. Topics include memory, language, attention, and decision-making. Prerequisite: permission of the instructor. Crosslisted as PSYC 318."}, {"courseNum": "PSYC 619", "courseName": "Topics in Psychology", "info": "Occasional seminars on selected topics of current interest in psychology. Prerequisite: permission of the instructor. Crosslisted as PSYC 319."}, {"courseNum": "PSYC 620", "courseName": "Children's Studies", "info": "Critical examination of childhood from multiple disciplinary lenses. Topics include children's advertising and consumerism, child labor, child soldiers, children's spirituality, children in diverse cultures, children and the arts. In this service-learning course students work with children/youth in field placements (e.g., Geisinger Children's Hospital, residential treatment centers). Prerequisite: permission of the instructor. Crosslisted as PSYC 320."}, {"courseNum": "PSYC 624", "courseName": "Advanced Psychological Stats", "info": "Statistical analysis of experimental and correlational data. Prerequisite: permission of the instructor. Crosslisted as PSYC 324."}, {"courseNum": "PSYC 625", "courseName": "Personality, Psychopaths, and Serial Killers", "info": "Considers personality disorders with a focus on psychopathy and serial murderers. Biological and environmental causes of psychopathy are considered as well as the developmental course of the condition and the ethics of treatment. Prerequisite: permission of the instructor. Crosslisted as PSYC 325."}, {"courseNum": "PSYC 648", "courseName": "Behavioral Pharmacology", "info": "Focus on drugs that affect the nervous system, drugs of abuse, therapeutic drugs, drug action, behavioral changes as a result of long-term drug use, animal models and human studies. Prerequisites: PSYC 250 or BIOL 205 and permission of the instructor. Crosslisted as PSYC 348 and NEUR 348."}, {"courseNum": "PSYC 669", "courseName": "Psychology-Beauty/ Attraction", "info": "Examination of research on beauty and attraction from a evolutionary perspective. Prerequisite: permission of the instructor. Crosslisted as PSYC 369."}, {"courseNum": "PSYC 670", "courseName": "Primate Behavior and Ecology", "info": "Introduction to research on prosimians, monkeys, and apes with emphasis on the evolutionary origin of diversity, habitat use, social structure, social behavior, and cognitive abilities. Prerequisite: permission of the instructor. Crosslisted as ANBE 370 and ANBE 670 and BIOL 370 and BIOL 670 and PSYC 370."}, {"courseNum": "PSYC 672", "courseName": "Comparative Cognition", "info": "Advanced seminar exploring cognition and behavior from evolutionary and comparative perspectives. Topics will include social behavior, memory, communication, spatial cognition, learning, and meta-cognition.  Prerequisite: permission of the instructor. Crosslisted as PSYC 372 and ANBE 372 and ANBE 672."}, {"courseNum": "PSYC 674", "courseName": "Latina/o Psychology", "info": "A seminar that examines the psychological research literature related to Latinas/os in the U.S. It considers the influences of Latina/o cultural values, practices, contexts and experiences on physical and mental health outcomes. Prerequisite: Permission of the instructor. Crosslisted as PSYC 374."}, {"courseNum": "PSYC 675", "courseName": "Child Health Psychology", "info": "Study of the impact that pediatric illness has on child mental health and child development. Focus on the management of chronic illness, adherence, mental health concerns, coping, and family factors. Prerequisite: Permission of the instructor. Crosslisted as PSYC 375."}, {"courseNum": "PSYC 685", "courseName": "Graduate Research", "info": "Graduate research. Prerequisite: permission of the instructor."}, {"courseNum": "RELI 100", "courseName": "Introduction to Religion", "info": "This course will introduce students to the academic study of religion to provide a foundation for religious literacy.  Multiple sections of this course are offered every semester, under a variety of titles."}, {"courseNum": "RELI 202", "courseName": "Hinduism", "info": "A historical survey of Hindu religious traditions. This course traces the development of Hindu scriptures, rituals, philosophies, and ethics from the ancient to the contemporary world. Concepts such as karma, yoga, and reincarnation will be put in the broader contexts of Hindu dharma (religious law), theism, and ritual."}, {"courseNum": "RELI 214", "courseName": "God, Nature, and Knowledge", "info": "Study of various philosophical, religious, and scientific theories regarding the concept of divine nature, human nature, and non-human nature."}, {"courseNum": "RELI 232", "courseName": "What is Religion? Theories and Methods", "info": "Exploration of theoretical models and methods in religious studies. Readings from major texts may include sociological, psychological, anthropological, and phenomenological approaches, along with challenges to such theories from thinkers of feminist, postmodern, and postcolonial perspectives. Prerequisite: sophomore, junior or senior status only. Open to others by permission of instructor."}, {"courseNum": "RELI 237", "courseName": "Judaism in Film", "info": "This is an introduction to Judaism in Film.  Judaism has been characterized as a culture, a civilization, a philosophy, a nation, an ethnic group, and a religion.  In this introductory class we will discuss ritual, ethical and historical issues."}, {"courseNum": "RELI 245", "courseName": "Marketing Chinese Religions", "info": "Focus on the economic dimensions of Chinese religious institutions in modern and contemporary periods, with attention also paid to premodern precedents. Economics here indicates not only mechanisms of monetary exchange, but also negotiations of spiritual capital (ledgers of [de]merit) and of religious identities amidst rampant consumerism and commodification of sanctity. Crosslisted as EAST 252."}, {"courseNum": "RELI 281", "courseName": "Religion and American Politics", "info": "This course explores the historical relationship of religion and American politics, focusing on the impact of religion in both domestic and foreign policy."}, {"courseNum": "RELI 316", "courseName": "Topics in Religion and Culture", "info": "This course will examine the interrelation between religion and cultural phenomena in diverse contexts of human experience. Prerequisite: sophomore, junior or senior status only. Open to others by permission of the instructor."}, {"courseNum": "RESC 098", "courseName": "Foundation Seminar in Residential Colleges", "info": "Foundation seminar offered only through the individual Residential Colleges. Prerequisite: permission of the instructor."}, {"courseNum": "RESC 220", "courseName": "Residential College Sophomore Program", "info": "Students will build on capacities achieved during the first year by constructing and then engaging in a set of learning experiences in a group."}, {"courseNum": "RUSS 101", "courseName": "Elementary Russian I", "info": "Fundamentals of speaking, reading, writing, and comprehending Russian, and an introduction to Russian culture."}, {"courseNum": "RUSS 103", "courseName": "Intermediate Russian I", "info": "Continued focus on all language skills combined with the study of cultural texts. Prerequisite: RUSS 101A or RUSS 102 or equivalent for RUSS 103; RUSS 103 is the prerequisite for RUSS 104."}, {"courseNum": "RUSS 125", "courseName": "Topics in Russian Culture", "info": "An examination of everyday life in Russia, as a mirror of historical, ideological, sociological, and economic forces. In English."}, {"courseNum": "RUSS 201", "courseName": "Advanced Russian I", "info": "Advanced topics of Russian grammar; review of intermediate grammar. Advanced reading, composition, and conversation. In Russian. Prerequisite: RUSS 104 or equivalent."}, {"courseNum": "RUSS 204", "courseName": "Russian Conversation", "info": "Concentrated development of speaking skill. Conducted entirely in Russian by a native speaker. Intended for students enrolled in 200- and 300-level courses. This course cannot be taken more than twice."}, {"courseNum": "RUSS 209", "courseName": "Russian Complementary Reading", "info": "Russian sources read in conjunction with English language courses. Independent course of study established by instructor and student. Prerequisite: the equivalent of four semesters of Russian. This course cannot be taken more than twice."}, {"courseNum": "RUSS 305", "courseName": "Russian Media", "info": "An advanced study of the Russian language through close reading and discussion of Russian media."}, {"courseNum": "SIGN 101", "courseName": "Elementary American Sign Language I", "info": "An introduction to American Sign Language. Training and practice in signing together with approaches to communicating with deaf people."}, {"courseNum": "SOCI 100", "courseName": "Introduction to Sociology", "info": "The concepts and methods sociologists use to investigate human groups. Focuses on the study of social organization, its variety and development."}, {"courseNum": "SOCI 123", "courseName": "Law and Society", "info": "Introduction to law and the legal system. The effects of economic, political, and other social institutions on the social organization of criminal and civil law."}, {"courseNum": "SOCI 201", "courseName": "Field Research in Local Communities", "info": "Participant-observation, interviewing, and other field research methods. Students will devise and conduct their own ethnographic research projects in a local community. Crosslisted as ANTH 201."}, {"courseNum": "SOCI 208", "courseName": "Methods of Social Research", "info": "An introduction to various paradigms of social research with emphasis on the logic of social inquiry, research design and data collection. Requires two prior sociology courses and permission of the instructor."}, {"courseNum": "SOCI 210", "courseName": "Urban Condition", "info": "Geographic and sociological inquiry into pressing urban issues of advanced industrialized societies, including inequality, housing, employment and how cities fit into the American present and future. Crosslisted as GEOG 210."}, {"courseNum": "SOCI 218", "courseName": "Health and Community", "info": "Explores how community, family, and experiences with health institutions shape and affect well being, physical problems, and health. Crosslisted as UNIV 218."}, {"courseNum": "SOCI 219", "courseName": "Culture and Power", "info": "This course enables students to develop critical perspectives on the ways in which culture serves to create and sustain social, economic, and political power and justifies inequality."}, {"courseNum": "SOCI 234", "courseName": "Criminology", "info": "Theories and research in criminal behavior and the societal reaction to criminality. Causes and consequences of crime, including public policy formulations."}, {"courseNum": "SOCI 235", "courseName": "Nongovernmental Organizations", "info": "Nongovernmental organizations in the world context. The international \"nonprofit\" sector including the role, importance, dynamics, politics, and patterns of change among NGOs."}, {"courseNum": "SOCI 240", "courseName": "The Social Forms of Religious Life: Religion's Role in Social Order and Conflict", "info": "Examination of the evolutionary roots of religion; the role of religion in \"world-construction,\" social solidarity and social change; the secularization thesis; civil religion; fundamentalisms, cults, other new religious movements; religious violence and terrorism. Special attention given to Christianity and Islam."}, {"courseNum": "SOCI 247", "courseName": "Political Sociology", "info": "Introduction to a sociological approach to politics. Exploration of classical debates in political sociology and key issues relevant for understanding the contemporary United States, including the politics of taxation, social assistance and market regulation, political discrimination and exclusion, militarism, and social movements."}, {"courseNum": "SOCI 252", "courseName": "Faces of Death:  Death in Human Nature and Culture", "info": "This course investigates the place of death in human nature and culture. We will look at death as a biological, social, and cultural fact for the human species. Funeral ritual and mourning will be studied in global and historical framework but with emphasis on the modern world."}, {"courseNum": "SOCI 307", "courseName": "Community Action, Rural Poverty and Civil Society", "info": "An advanced course for students who have been involved in community projects, internships (such as the Shepherd Internship), as well as students taking Poverty Studies within the Social Justice Minor. Students in the course will work on a community action project either individually or as a group."}, {"courseNum": "SOCI 325", "courseName": "Advanced Reading in Sociology", "info": "Readings developed around the interest of individual students. Prerequisite: permission of the instructor."}, {"courseNum": "SOCI 328", "courseName": "Mating and Marrying in America", "info": "This is a course on changing patterns in American courtship (dating), marriage, and family life from the 20th to the 21st century. Prerequisite: permission of the instructor. Crosslisted as WMST 328."}, {"courseNum": "SPAN 101", "courseName": "Elementary Spanish I", "info": "Beginning language skills, with practice of points of grammar, through listening, speaking, reading and writing, in the context of Hispanic cultures. SPAN 101 is prerequisite to SPAN 102."}, {"courseNum": "SPAN 103", "courseName": "Toward Intermediate Spanish", "info": "Through grammar review and the development of new linguistic skills, in the context of Hispanic cultures, students reach intermediate competency in Spanish. Prerequisite: SPAN 102 or three years of secondary school Spanish."}, {"courseNum": "SPAN 105", "courseName": "Intermediate Spanish", "info": "Review of grammar and development of new linguistic skills and cultural competency to reach high-intermediate level in Spanish. Prerequisite: SPAN 103 or four years of secondary school Spanish."}, {"courseNum": "SPAN 207", "courseName": "Toward Advanced Spanish", "info": "Students demonstrating high-intermediate skills progress toward advanced language proficiency. Reading, discussion and writing about brief literary or cultural texts advances cultural competency. Prerequisite: SPAN 105 or five years of secondary school Spanish."}, {"courseNum": "SPAN 208", "courseName": "Advanced Conversation and Composition", "info": "Advanced study and practice to enhance oral and written proficiency. A variety of texts and media, including literature, film and internet sources provide a point of departure for class discussion and written assignments. Prerequisite: SPAN 207 or six years of Spanish."}, {"courseNum": "SPAN 220", "courseName": "Introduction to Spanish Literature", "info": "Introduction to Spanish literature across major artistic and cultural periods: Middle Ages, Renaissance, Golden Age, Romanticism, Realism, and 20th-century literature in its cultural context."}, {"courseNum": "SPAN 222", "courseName": "Introduction to Latin American Literature", "info": "Introduction to the authors, topics and genres that constitute the literary tradition of Latin America. Literary works are studied in their historical and cultural context."}, {"courseNum": "SPAN 245", "courseName": "Topics in Spain", "info": "Guides students in their experience of life and culture in Spain, and fosters their reflection on the cross-cultural learning experience. Prerequisite: SPAN 207 or equivalent. Only given in the Bucknell en Espana program."}, {"courseNum": "SPAN 270", "courseName": "Spanish Cultural Tradition", "info": "An introduction to the cultural tradition of Spain through the study of art, history, literature, and film. Prerequisite: SPAN 208."}, {"courseNum": "SPAN 280", "courseName": "Latin American Cultural Traditions", "info": "An introduction to the cultural traditions of Latin America through the study of art, history, literature, and film. Prerequisite: SPAN 208."}, {"courseNum": "SPAN 323", "courseName": "Latin American Short Story", "info": "Art and theory of the short story in Latin America. Topics include Colombian Short Stories, Stories by Women Writers, Children's Stories. Prerequisites: two courses at 200-level beyond SPAN 208."}, {"courseNum": "SPAN 362", "courseName": "Topics in Hispanic Literature", "info": "These courses will deal with topics in Spanish or Latin American literature on an advanced level. Prerequisites: two 200-level courses beyond SPAN 208."}, {"courseNum": "THEA 101", "courseName": "Technical Theatre Practicum", "info": "Quarter-course credit for supervised participation in any one of several aspects of theatrical production of the Department of Theatre and Dance's major productions. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 102", "courseName": "Theatrical Rehearsal and Performance", "info": "Quarter-course credit for substantial participation in a major theatrical production; for example, as actor, stage manager, vocal coach, choreographer. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 145", "courseName": "Bucknell Backstage", "info": "Bucknell Backstage is an introductory course where craft, art and engineering intersect. Subject areas include Stage Management, Lighting, Sound, Properties, Painting, Stagecraft, Rigging and Wardrobe. Preference given to Theatre Majors. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 240", "courseName": "Directing the Play", "info": "The critical and creative responsibilities of the director; the principles of directing and their application. Prerequisite: THEA 110 or THEA 220 or permission of the instructor."}, {"courseNum": "THEA 246", "courseName": "Scene Design", "info": "Create an environment for the action. The stage visual environment embodies mood, character, period style, and concept architecturally. Projects and plays in different styles are evolved through art and architectural research, scale model building, and drafting. The class models collaborative practice key to successful theatre and dance production."}, {"courseNum": "THEA 247", "courseName": "Visual Style", "info": "Scene, costume and lighting designers collaborate on plays and creative projects. Emphasis on exploring actor/audience relationships and looking to influential visual arts movements for inspiration."}, {"courseNum": "THEA 253", "courseName": "Global Dress and Fashion Systems", "info": "This course explores dress and clothing as an expression of culture. Topics include: agency, practice, identity, performance, cultural preservation, aesthetics, the body, gender, ethnicity, globalization."}, {"courseNum": "THEA 255", "courseName": "The Art of Costume Craft", "info": "Use creativity and imagination in the studio to explore the sculptural and expressive nature of costume design as art. Prerequisite: permission of the instructor."}, {"courseNum": "THEA 256", "courseName": "Rituals, Festivals, Institutions", "info": "Investigates various theories concerning the origins of Western theatre in ritual performance and explores the development of theatrical institutions from the Greeks to Shakespeare in the context of social, philosophical, and religious values."}, {"courseNum": "THEA 265", "courseName": "Special Studies in Theatre", "info": "In appropriate years, special topics such as stage combat, mime, or theatrical criticism will be studied."}, {"courseNum": "THEA 365", "courseName": "Independent Studies in Theatre", "info": "Independent special studies in theatre or dance performance, history, design, or technology. Prerequisite: permission of the instructor."}, {"courseNum": "UNIV 130", "courseName": "From Vine to Wine: An Introduction to Viticulture and Oenology", "info": "This introductory survey explores the world of wine through lectures, readings, tastings, field trips and group projects. Topics include grape physiology, the chemistry of vinification, the influence of climate and soil on terroir, major grape varieties, wine styles and regions, and the principles of food and wine pairing."}, {"courseNum": "UNIV 199", "courseName": "Arts Entrepreneurship", "info": "This survey course explores the theories, processes and practices involved in entrepreneurship in arts practice and cultural organizations. The course features guest lectures by faculty and staff who are experts in arts entrepreneurship."}, {"courseNum": "UNIV 200", "courseName": "Integrated Perspectives Course", "info": "Team-taught interdisciplinary course. Topics vary."}, {"courseNum": "UNIV 218", "courseName": "Health and Community", "info": "Explores how community, family, and experiences with health institutions shape and affect well being, physical problems, and health. Crosslisted as SOCI 218."}, {"courseNum": "UNIV 230", "courseName": "Modernism and Crisis", "info": "An interdisciplinary study of major texts, figures, and concepts of the 20th century. Designed to follow HUMN 128 and HUMN 150. Crosslisted as HUMN 250 and ENGL 230."}, {"courseNum": "UNIV 248", "courseName": "Intermediality: Italy, Film, and the Arts", "info": "This IP course will focus on intermediality, film, and Italy. It seeks to examine the relationships of cinema with the other arts, in particular the arts of Italy. Crosslisted as ENFS 248 and ITAL 248."}, {"courseNum": "UNIV 375", "courseName": "Should We Start This Company?", "info": "Project centered course in entrepreneurship, generating new business ideas, and product or service design and development through business planning. Crosslisted as ENGR 375 and MIDE 375"}, {"courseNum": "UNIV 401", "courseName": "Leadership: Theory, History, and Practice", "info": "Leadership is a phenomenon studied by numerous social sciences and humanities. Their different perspectives are compared in a search for the determinants of successful leadership. Prerequisite: junior or senior status."}, {"courseNum": "WMST 150", "courseName": "Introduction to Women's and Gender Studies", "info": "Interdisciplinary introduction to the major theories, themes, methodologies, and issues of women's studies. Emphasis in the social sciences."}, {"courseNum": "WMST 222", "courseName": "Queer Studies", "info": "This course examines social construction frameworks for analyzing contemporary sexualities, gendered identities, and the discourses and practices that maintain them. It introduces students to queer theory and its application to a variety of political and cultural fields."}, {"courseNum": "WMST 224", "courseName": "African Women & Social Action", "info": "Analysis of topics in films and novels by Ousmane Sembene: pre-colonial history, colonialism, post-colonial independence, racial and gender oppression, worker exploitation, religious conflict, and modernization. Prerequisite: ECON 103. Crosslisted as ECON 224."}, {"courseNum": "WMST 225", "courseName": "Modernism on the Margins: Race, Class and Sexuality", "info": "Exploiting the exclusionary nature of \"High Modernism,\" this course highlights literature on the margins of modernism, revealing literature's political investment in race, class, and sexuality. Crosslisted as ENGL 239."}, {"courseNum": "WMST 230", "courseName": "Feminist Philosophy", "info": "An examination of feminist philosophy primarily as it occurs in the U.S. from the late 18th century to the present. Crosslisted as PHIL 230."}, {"courseNum": "WMST 232", "courseName": "Gender and Sexuality in South Asia", "info": "Explores issues of gender and sexuality in South Asia, primarily India and Sri Lanka. Topics include marriage, family, life cycle, religion and nationalism. Crosslisted as ANTH 232."}, {"courseNum": "WMST 251", "courseName": "Women and Development", "info": "This course examines the relationship between women and development, as an ideological, economic, political, and social enterprise. Crosslisted as ANTH 251."}, {"courseNum": "WMST 254", "courseName": "Sex and Social Order", "info": "Analysis of connections between sex and social structure to determine how our understanding of sexuality is implicated in our political system, economy, and cultural ideology. Crosslisted as POLS 254."}, {"courseNum": "WMST 290", "courseName": "Gender Issues in Education", "info": "An examination of how gender affects the teaching-learning process with an emphasis on theory, curriculum, pedagogy, and assessment. Crosslisted as EDUC 290 and EDUC 690."}, {"courseNum": "WMST 320", "courseName": "Independent Studies", "info": "Independent study supervised by Women's and Gender Studies faculty member. Prerequisite: permission of the instructor."}, {"courseNum": "WMST 324", "courseName": "Geographies of Identity", "info": "Who are \"we\"? Seminar considers role of space in constituting society around the world. Explores nationalism, globalization, multiculturalism, citizenship, race, ethnicity, gender, sexuality, age, disability. Crosslisted as GEOG 324."}, {"courseNum": "WMST 325", "courseName": "History of Sexuality", "info": "A cross-cultural and interdisciplinary examination of the signification of sexuality in literature, philosophy, scientific discourse, and the visual arts. Prerequisite: permission of the instructor. Crosslisted as HUMN 320, ENLS 394, and WMST 625."}, {"courseNum": "WMST 328", "courseName": "Mating and Marrying in America", "info": "This is a course on changing patterns in American courtship (dating), marriage, and family life from the 20th to the 21st century. Prerequisite: permission of the instructor. Crosslisted as SOCI 328."}, {"courseNum": "WMST 625", "courseName": "History of Sexuality", "info": "A cross-cultural and interdisciplinary examination of the signification of sexuality in literature, philosophy, scientific discourse, and the visual arts. Prerequisite: permission of the instructor. Crosslisted as WMST 325."}], "semester": "Fall 2017-2018", "ccc": [{"abbreviation": "ARHC", "name": "Arts and Humanities"}, {"abbreviation": "AHLG", "name": "Arts and Humanities Learning Goals"}, {"abbreviation": "CBL", "name": "Community Based Learning"}, {"abbreviation": "DUSC", "name": "Diversity in the U.S."}, {"abbreviation": "GLSP", "name": "Engineering Global and Societal Perspectives"}, {"abbreviation": "EGHU", "name": "Engineering Humanities"}, {"abbreviation": "EGSS", "name": "Engineering Social Science"}, {"abbreviation": "EVCN", "name": "Environmental Connections"}, {"abbreviation": "FRST", "name": "First year course"}, {"abbreviation": "CCFL", "name": "Foreign Language"}, {"abbreviation": "FOUN", "name": "Foundation Seminar"}, {"abbreviation": "GBCC", "name": "Global Connections"}, {"abbreviation": "CCIP", "name": "Integrated Perspectives"}, {"abbreviation": "LBSC", "name": "Lab Science"}, {"abbreviation": "NSMC", "name": "Natural Science and Mathematics"}, {"abbreviation": "NMLG", "name": "Natural Science and Mathematics Learning Goals"}, {"abbreviation": "CCQR", "name": "Quantitative Reasoning"}, {"abbreviation": "SL", "name": "Service Learning Course"}, {"abbreviation": "SLSC", "name": "Social Science"}, {"abbreviation": "SSLG", "name": "Social Science Learning Goals"}, {"abbreviation": "W1", "name": "Writing Level 1"}, {"abbreviation": "W2", "name": "Writing Level 2"}], "credit": [{"abbreviation": ".5", "name": "Half Credit"}, {"abbreviation": ".25", "name": "Quarter Credit"}]}